{"metadata":{"kernelspec":{"language":"python","display_name":"Python 3","name":"python3"},"language_info":{"name":"python","version":"3.10.13","mimetype":"text/x-python","codemirror_mode":{"name":"ipython","version":3},"pygments_lexer":"ipython3","nbconvert_exporter":"python","file_extension":".py"},"kaggle":{"accelerator":"none","dataSources":[{"sourceId":8812575,"sourceType":"datasetVersion","datasetId":5299649},{"sourceId":9288757,"sourceType":"datasetVersion","datasetId":5623080},{"sourceId":9328230,"sourceType":"datasetVersion","datasetId":5651610},{"sourceId":9328232,"sourceType":"datasetVersion","datasetId":5651612},{"sourceId":189203731,"sourceType":"kernelVersion"}],"dockerImageVersionId":30747,"isInternetEnabled":true,"language":"python","sourceType":"notebook","isGpuEnabled":false}},"nbformat_minor":4,"nbformat":4,"cells":[{"cell_type":"markdown","source":"Functions to format the queries properly for the endpoint.","metadata":{}},{"cell_type":"code","source":"import re\n\ndef format_query(query):\n    PREFIXES = \"\"\"PREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX yago: <http://yago-knowledge.org/resource/>\nPREFIX y2geor: <http://kr.di.uoa.gr/yago2geo/resource/>\nPREFIX y2geoo: <http://kr.di.uoa.gr/yago2geo/ontology/>\nPREFIX strdf: <http://strdf.di.uoa.gr/ontology#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\nPREFIX owl: <http://www.w3.org/2002/07/owl#>\"\"\"\n    \n    query = PREFIXES + ' ' + query\n    \n    query = query.replace('strdf:within', 'geof:sfWithin')\n    query = query.replace('strdf:contains', 'geof:sfContains')\n    query = query.replace('strdf:overlaps', 'geof:sfOverlaps')\n    query = query.replace('strdf:distance', 'geof:sfDistance')\n    \n    # Use regex to find and replace strdf:buffer patterns\n    query = re.sub(r'strdf:buffer\\((\\?\\w+),\\s*\\d+,\\s*uom:\\w+\\)', r'\\1', query)\n    \n    return query","metadata":{"_uuid":"8f2839f25d086af736a60e9eeb907d3b93b6e0e5","_cell_guid":"b1076dfc-b9ad-4769-8c92-a6c4dae69d19","execution":{"iopub.status.busy":"2024-09-13T17:22:27.513127Z","iopub.execute_input":"2024-09-13T17:22:27.513494Z","iopub.status.idle":"2024-09-13T17:22:27.546122Z","shell.execute_reply.started":"2024-09-13T17:22:27.513465Z","shell.execute_reply":"2024-09-13T17:22:27.545128Z"},"trusted":true},"execution_count":1,"outputs":[]},{"cell_type":"code","source":"def gost_materialize_query(query: str):\n    data = {\n        \"query\": query\n    }\n\n    headers = {\n        'Content-Type': 'application/json'\n    }\n\n    response = requests.post(\"http://195.134.71.116:9090/materialize-api\", headers=headers, data=json.dumps(data))\n    \n    if response.status_code == 200:\n        return response.text\n    else:\n        print(\"Materialize failed:\", response.text)\n        return (query)","metadata":{"execution":{"iopub.status.busy":"2024-09-13T17:22:27.547596Z","iopub.execute_input":"2024-09-13T17:22:27.547908Z","iopub.status.idle":"2024-09-13T17:22:27.553490Z","shell.execute_reply.started":"2024-09-13T17:22:27.547883Z","shell.execute_reply":"2024-09-13T17:22:27.552369Z"},"trusted":true},"execution_count":2,"outputs":[]},{"cell_type":"markdown","source":"Function that sends query to the endpoint and returns the result.","metadata":{}},{"cell_type":"code","source":"import requests\nimport pandas as pd\nfrom io import StringIO\n\ndef graphdb_send_request(query, endpoint_url=\"http://88.197.53.158:7200/repositories/da4dte_final\", accept_format='application/sparql-results+json'):\n    \"\"\"\n    Sends a SPARQL query to a GraphDB endpoint.\n\n    :param query: SPARQL query to be sent\n    :param endpoint_url: URL of the GraphDB SPARQL endpoint\n    :param accept_format: Desired response format (default is JSON)\n    :return: Response from the endpoint\n    \"\"\"\n    # Format the query, this means add the correct prefixes and fix some endpoint issues with regex.\n    query = format_query(query)\n    original_query = query\n    query = gost_materialize_query(query)\n    \n    headers = {\n        'Accept': accept_format,\n        'Content-Type': 'application/x-www-form-urlencoded'\n    }\n\n    data = {\n        'query': query\n    }\n    \n    try:\n        response = requests.post(endpoint_url, headers=headers, data=data, auth=requests.auth.HTTPBasicAuth('admin', 'p@sx@'))\n\n        if response.status_code == 200:\n            if accept_format == 'application/sparql-results+json':\n#                 print(response.json())\n                json_response = response.json()\n                return convert_json_to_csv(json_response)\n            else:\n#                 print(response.text)\n                return response.text\n        else:\n            response.raise_for_status()\n    except requests.exceptions.HTTPError as err:\n        print(\"HTTP error (most likely invalid query)\")\n        #print(query)\n        #print(err)\n    except Exception as err:\n        print(err)\n        print(\"Endpoint error ENDPOINT DOWN\")\n        \ndef convert_json_to_csv(json_data):\n    \"\"\"\n    Converts JSON data to CSV format.\n\n    :param json_data: JSON data to be converted\n    :return: CSV formatted data as a string\n    \"\"\"\n    if 'boolean' in json_data:\n        # Handling boolean result\n        headers = ['value']\n        rows = [[json_data['boolean']]]\n    else:\n        # Extracting header and rows from JSON response\n        headers = json_data['head']['vars']\n        rows = [{var: result.get(var, {}).get('value', '') for var in headers} for result in json_data['results']['bindings']]\n    \n    # Creating DataFrame and converting to CSV\n    df = pd.DataFrame(rows, columns=headers)\n    csv_output = StringIO()\n    df.to_csv(csv_output, index=False)\n    \n    return csv_output.getvalue()","metadata":{"execution":{"iopub.status.busy":"2024-09-13T17:22:27.554730Z","iopub.execute_input":"2024-09-13T17:22:27.555021Z","iopub.status.idle":"2024-09-13T17:22:28.613052Z","shell.execute_reply.started":"2024-09-13T17:22:27.554998Z","shell.execute_reply":"2024-09-13T17:22:28.612147Z"},"trusted":true},"execution_count":3,"outputs":[]},{"cell_type":"markdown","source":"Inference function.","metadata":{}},{"cell_type":"code","source":"import torch\n\ndef run_inference(model, tokenizer, prompt):\n    results = []\n    \n    if tokenizer == None:\n        # Generate output\n        with torch.no_grad():\n            outputs = model(prompt)\n            \n        # Decode and print output\n        #print(\"Prompt:\", prompt)\n        #print(\"Generated text:\" + outputs + \"\\n\")\n        results.append(\"Generated text:\" + outputs)\n    else:\n        # Move model to GPU\n        device = torch.device(\"cuda\" if torch.cuda.is_available() else \"cpu\")\n        model.to(device)\n        model.eval()  # Set model to evaluation mode\n            \n        # Tokenize prompt\n        inputs = tokenizer(prompt, return_tensors=\"pt\").to(device)\n            \n        # Generate output\n        with torch.no_grad():\n            outputs = model.generate(**inputs, \n                            max_new_tokens=800,  # Set a maximum length for generated text\n                            #do_sample=True,  # Enable sampling\n                            #top_k=7,        # Top-k sampling\n                            #top_p=0.1,      # Top-p sampling (nucleus sampling)\n                            #num_return_sequences=1,\n                            #repetition_penalty=1, # No penalty for instruction tuned models.\n                            repetition_penalty=1.2, # Penalty on repeating tokens.\n                            eos_token_id=tokenizer.eos_token_id,  # Specify EOS token ID\n                            pad_token_id=tokenizer.pad_token_id  # Specify PAD token ID\n                            )\n        \n        # Extract generated text\n        generated_text = tokenizer.decode(outputs[0], skip_special_tokens=True)\n\n        # Remove the prompt text\n        prompt_length = len(prompt)\n        generated_text = generated_text[prompt_length:]\n\n        # Decode and print output\n        #print(\"Prompt:\", prompt)\n        #print(generated_text)\n        results.append(generated_text)\n    \n    # Clear model from RAM\n    del model\n    torch.cuda.empty_cache()\n    \n    return results\n    \ndef compare_strings(str1, str2):\n    # Split strings into words\n    words1 = str1.split()\n    words2 = str2.split()\n    \n    # Determine the length of the shorter list\n    min_length = min(len(words1), len(words2))\n    \n    # Compare words from both lists\n    for i in range(min_length):\n        if words1[i] != words2[i]:\n            print(f\"Difference found: '{words1[i]}' != '{words2[i]}'\")\n    \n    # Handle any extra words in the longer list\n    if len(words1) > min_length:\n        for i in range(min_length, len(words1)):\n            print(f\"Extra word in first string: '{words1[i]}'\")\n    \n    if len(words2) > min_length:\n        for i in range(min_length, len(words2)):\n            print(f\"Extra word in second string: '{words2[i]}'\")\n            \ndef find_prompt_end_position(generated_text, prompt):\n    # Remove all spaces from the sentence and paragraph\n    clean_paragraph = generated_text.replace(' ', '')\n    clean_sentence = prompt.replace(' ', '')\n    \n    # Find the start position of the clean sentence in the clean paragraph\n    start_position = clean_paragraph.find(clean_sentence)\n    \n    if start_position == -1:\n        print(\"MAN\")\n        return -1  # Sentence not found in the paragraph\n    \n    # Calculate the end position in the original paragraph\n    sentence_length = len(clean_sentence)\n    end_position_clean = start_position + sentence_length\n    \n    # Convert the end position to the original paragraph with spaces\n    current_position = 0\n    end_position_original = 0\n    for char in generated_text:\n        if char != ' ':\n            current_position += 1\n        end_position_original += 1\n        if current_position == end_position_clean:\n            break\n    \n    return end_position_original\n\ndef Quantized_Inference(model, tokenizer, prompt):\n    results = []\n    \n    # Move model to GPU\n    device = torch.device(\"cuda\" if torch.cuda.is_available() else \"cpu\")\n    model.eval()  # Set model to evaluation mode\n            \n    # Tokenize prompt\n    inputs = tokenizer(prompt, return_tensors=\"pt\").to(device)\n            \n    # Generate output\n    with torch.no_grad():\n        outputs = model.generate(**inputs, \n                            max_new_tokens=250,  # Set a maximum length for generated text\n                            #do_sample=True,  # Enable sampling\n                            #top_k=7,        # Top-k sampling\n                            #top_p=0.1,      # Top-p sampling (nucleus sampling)\n                            #num_return_sequences=1,\n                            repetition_penalty=1.2, # Penalty on repeating tokens.\n                            eos_token_id=tokenizer.eos_token_id,  # Specify EOS token ID\n                            pad_token_id=tokenizer.pad_token_id  # Specify PAD token ID\n                            )\n        \n    # Extract generated text\n    generated_text = tokenizer.decode(outputs[0], skip_special_tokens=True)\n    \n    # Remove the prompt text\n    prompt_length = find_prompt_end_position(generated_text, prompt)\n    generated_text = generated_text[prompt_length:]\n    \n    # Clear model from RAM\n    del model\n    torch.cuda.empty_cache()\n    \n    return generated_text","metadata":{"execution":{"iopub.status.busy":"2024-09-13T17:22:28.615367Z","iopub.execute_input":"2024-09-13T17:22:28.615910Z","iopub.status.idle":"2024-09-13T17:22:31.844206Z","shell.execute_reply.started":"2024-09-13T17:22:28.615874Z","shell.execute_reply":"2024-09-13T17:22:31.843245Z"},"trusted":true},"execution_count":4,"outputs":[]},{"cell_type":"code","source":"def insert_space_before_punctuation(query):\n    # Function to replace punctuation outside of URIs\n    def replace_punctuation(match):\n        text = match.group(0)\n        if text.startswith('<') and text.endswith('>'):\n            # This is a URI, don't modify it\n            return text\n        else:\n            # Add spaces before punctuation\n            return text.replace('?', ' ?').replace('.', ' .')\n\n    # Regex pattern to match URIs and text between them\n    pattern = r'(<[^>]+>|[^<>]+)'\n\n    # Apply the replacement function\n    processed_query = re.sub(pattern, replace_punctuation, query)\n\n    return processed_query","metadata":{"execution":{"iopub.status.busy":"2024-09-13T17:22:31.845483Z","iopub.execute_input":"2024-09-13T17:22:31.846069Z","iopub.status.idle":"2024-09-13T17:22:31.852686Z","shell.execute_reply.started":"2024-09-13T17:22:31.846032Z","shell.execute_reply":"2024-09-13T17:22:31.851669Z"},"trusted":true},"execution_count":5,"outputs":[]},{"cell_type":"code","source":"import re\n\ndef extract_uris(query):\n    # Regular expression to match both fully expanded and prefixed URIs\n    uri_pattern = r'<([^>]+)>|(\\b[a-zA-Z0-9_]+):([a-zA-Z0-9_]+)'\n    \n    uris = []\n    matches = re.findall(uri_pattern, query)\n    for match in matches:\n        if match[0]:  # Fully expanded URI\n            uris.append(match[0])\n        else:  # Prefixed URI\n            uris.append(f\"{match[1]}:{match[2]}\")\n    return uris\n\ndef expand_uris(query, prefix_dict):\n    prefixed_pattern = r'(\\b[a-zA-Z0-9_]+):([a-zA-Z0-9_]+)'\n    expanded_pattern = r'<([^>]+)>'\n    \n    expanded_uris = []\n    \n    # Find and expand prefixed URIs\n    matches = re.findall(prefixed_pattern, query)\n    for prefix, suffix in matches:\n        if prefix in prefix_dict:\n            expanded_uris.append(f\"{prefix_dict[prefix]}{suffix}\")\n        else:\n            expanded_uris.append(f\"{prefix}:{suffix}\")\n    \n    # Find and add already expanded URIs\n    matches = re.findall(expanded_pattern, query)\n    for uri in matches:\n        expanded_uris.append(uri)\n    \n    return expanded_uris\n\nprefix_dict = {\n    'geo': 'http://www.opengis.net/ont/geosparql#',\n    'osm': 'http://www.openstreetmap.org/ontology#',\n    'xsd': 'http://www.w3.org/2001/XMLSchema#',\n    'geof': 'http://www.opengis.net/def/function/geosparql/',\n    'uom': 'http://www.opengis.net/def/uom/OGC/1.0/'\n}","metadata":{"execution":{"iopub.status.busy":"2024-09-13T17:22:31.853917Z","iopub.execute_input":"2024-09-13T17:22:31.854729Z","iopub.status.idle":"2024-09-13T17:22:31.869654Z","shell.execute_reply.started":"2024-09-13T17:22:31.854696Z","shell.execute_reply":"2024-09-13T17:22:31.868717Z"},"trusted":true},"execution_count":6,"outputs":[]},{"cell_type":"markdown","source":"Function to generate queries with 6 example few shot learning and uri injection. (best experimental results)","metadata":{}},{"cell_type":"code","source":"def get_plain_zero_shot_prompt(user_prompt):\n    prompt = f\"\"\"Generator is an expert SPARQL query generator. For each question that the user supplies, the generator will convert it into a valid SPARQL query that can be used to answer the question. The query will be based on the DBpedia knowledge graph. The query should be enclosed by three backticks on new lines, denoting that it is a code block.\nHuman: {user_prompt}\nGenerator: ```\"\"\"\n    return prompt\n\ndef get_plain_three_shot_prompt(user_prompt):\n    prompt = f\"\"\"Human: In Breckland district, which forests are south of streams?\nGenerator: ```SELECT DISTINCT ?forest WHERE {{ yago:Breckland_District geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . ?forest rdf:type y2geoo:OSM_forest . ?forest geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 . ?stream rdf:type y2geoo:OSM_stream . ?stream geo:hasGeometry ?o3 . ?o3 geo:asWKT ?geoWKT3 . FILTER (strdf:within(?geoWKT2, ?geoWKT1) && strdf:within(?geoWKT3, ?geoWKT1) && strdf:below(?geoWKT2, ?geoWKT3)) }}```\nHuman: How many streams intersect with lakes?\nGenerator: ```SELECT (COUNT (DISTINCT ?p1) as ?streams) WHERE {{ ?p1 rdf:type y2geoo:OSM_stream; geo:hasGeometry ?p1geo. ?p1geo geo:asWKT ?p1WKT. ?p2 rdf:type y2geoo:OSM_lake; geo:hasGeometry ?p2geo. ?p2geo geo:asWKT ?p2WKT. FILTER(geof:sfIntersects(?p1WKT, ?p2WKT)) }}```\nHuman: Which Municipalities are on Thessaly's border?\nGenerator: ```SELECT distinct ?rg where {{ yago:Thessaly geo:hasGeometry ?tgeo . ?tgeo geo:asWKT ?tgWKT . ?rg rdf:type y2geoo:GAG_Municipality . ?rg geo:hasGeometry ?rggeo . ?rggeo geo:asWKT ?rgWKT . FILTER (strdf:touches(?tgWKT,?rgWKT)) . }}```\nHuman: {user_prompt}\nGenerator: ```\"\"\"\n    return prompt\n\ndef get_zero_shot_uri_prompt(user_prompt, uris):\n    prompt = f\"\"\"Generator is an expert SPARQL query generator. For each question that the user supplies, the generator will convert it into a valid SPARQL query that can be used to answer the question. The query will be based on the DBpedia knowledge graph. The query should be enclosed by three backticks on new lines, denoting that it is a code block.\nHuman: {user_prompt}\nThe generator must use these URIs to answer the question: {uris}\nGenerator: ```\"\"\"\n    return prompt\n\ndef get_zero_shot_uri_geos_prompt(user_prompt, uris):\n    prompt = f\"\"\"Generator is an expert SPARQL query generator. For each question that the user supplies, the generator will convert it into a valid SPARQL query that can be used to answer the question. The query will be based on the DBpedia knowledge graph. The query should be enclosed by three backticks on new lines, denoting that it is a code block.\nThe resulting query may have to be in GeoSPARQL. The GeoSPARQL ontology is defined by:\nURI: http://www.opengis.net/ont/geosparql\nClasses: Feature, Feature Collection, Geometry, Geometry Collection, Spatial Object, Spatial Object Collection\nObject Properties: default geometry, contains, covered by, covers, disjoint, equals, inside, meet, overlap, has area, has bounding box, has centroid, has default geometry, has geometry, has length, has perimeter length, has size, has spatial accuracy, has spatial resolution, has volume, disconnected, externally connected, equals, non-tangential proper part, non-tangential proper part inverse, partially overlapping, tangential proper part, tangential proper part inverse, contains, crosses, disjoint, equals, intersects, overlaps, touches, within\nDatatype Properties: as DGGS, as GML, as GeoJSON, as KML, as WKT, coordinate dimension, dimension, has area in square meters, has length in meters, has perimeter length in meters, has metric size, has spatial accuracy in meters, has spatial resolution in meters, has volume in cubic meters, has serialization, is empty, is simple, spatial dimension\nHuman: {user_prompt}\nThe generator must use these URIs to answer the question: {uris}\nGenerator: ```\"\"\"\n    return prompt\n\ndef get_three_shot_uri_prompt(user_prompt, uris):\n    prompt = f\"\"\"Generator is an expert SPARQL query generator. For each question that the user supplies, the generator will convert it into a valid SPARQL query that can be used to answer the question. The query will be based on the DBpedia knowledge graph. The query should be enclosed by three backticks on new lines, denoting that it is a code block.\nHuman: In Breckland district, which forests are south of streams?\nThe generator must use these URIs to answer the question: ['yago:Breckland_District', 'geo:hasGeometry', 'geo:asWKT', 'rdf:type', 'y2geoo:OSM_forest', 'geo:hasGeometry', 'geo:asWKT', 'rdf:type', 'y2geoo:OSM_stream', 'geo:hasGeometry', 'geo:asWKT', 'strdf:within', 'strdf:within', 'strdf:below']\nGenerator: ```SELECT DISTINCT ?forest WHERE {{ yago:Breckland_District geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . ?forest rdf:type y2geoo:OSM_forest . ?forest geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 . ?stream rdf:type y2geoo:OSM_stream . ?stream geo:hasGeometry ?o3 . ?o3 geo:asWKT ?geoWKT3 . FILTER (strdf:within(?geoWKT2, ?geoWKT1) && strdf:within(?geoWKT3, ?geoWKT1) && strdf:below(?geoWKT2, ?geoWKT3)) }}```\nHuman: How many streams intersect with lakes?\nThe generator must use these URIs to answer the question: ['rdf:type', 'y2geoo:OSM_stream', 'geo:hasGeometry', 'geo:asWKT', 'rdf:type', 'y2geoo:OSM_lake', 'geo:hasGeometry', 'geo:asWKT', 'geof:sfIntersects']\nGenerator: ```SELECT (COUNT (DISTINCT ?p1) as ?streams) WHERE {{ ?p1 rdf:type y2geoo:OSM_stream; geo:hasGeometry ?p1geo. ?p1geo geo:asWKT ?p1WKT. ?p2 rdf:type y2geoo:OSM_lake; geo:hasGeometry ?p2geo. ?p2geo geo:asWKT ?p2WKT. FILTER(geof:sfIntersects(?p1WKT, ?p2WKT)) }}```\nHuman: Which Municipalities are on Thessaly's border?\nThe generator must use these URIs to answer the question: ['yago:Thessaly', 'geo:hasGeometry', 'geo:asWKT', 'rdf:type', 'y2geoo:GAG_Municipality', 'geo:hasGeometry', 'geo:asWKT', 'strdf:touches']\nGenerator: ```SELECT distinct ?rg where {{ yago:Thessaly geo:hasGeometry ?tgeo . ?tgeo geo:asWKT ?tgWKT . ?rg rdf:type y2geoo:GAG_Municipality . ?rg geo:hasGeometry ?rggeo . ?rggeo geo:asWKT ?rgWKT . FILTER (strdf:touches(?tgWKT,?rgWKT)) . }}```\nHuman: {user_prompt}\nThe generator must use these URIs to answer the question: {uris}\nGenerator: ```\"\"\"\n    return prompt\n\ndef get_six_shot_uri_prompt(user_prompt, uris):\n    prompt = f\"\"\"Human: In Breckland district, which forests are south of streams?\nThe generator must use these URIs to answer the question: ['yago:Breckland_District', 'geo:hasGeometry', 'geo:asWKT', 'rdf:type', 'y2geoo:OSM_forest', 'geo:hasGeometry', 'geo:asWKT', 'rdf:type', 'y2geoo:OSM_stream', 'geo:hasGeometry', 'geo:asWKT', 'strdf:within', 'strdf:within', 'strdf:below']\nGenerator: ```SELECT DISTINCT ?forest WHERE {{ yago:Breckland_District geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . ?forest rdf:type y2geoo:OSM_forest . ?forest geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 . ?stream rdf:type y2geoo:OSM_stream . ?stream geo:hasGeometry ?o3 . ?o3 geo:asWKT ?geoWKT3 . FILTER (strdf:within(?geoWKT2, ?geoWKT1) && strdf:within(?geoWKT3, ?geoWKT1) && strdf:below(?geoWKT2, ?geoWKT3)) }}```\nHuman: How many streams intersect with lakes?\nThe generator must use these URIs to answer the question: ['rdf:type', 'y2geoo:OSM_stream', 'geo:hasGeometry', 'geo:asWKT', 'rdf:type', 'y2geoo:OSM_lake', 'geo:hasGeometry', 'geo:asWKT', 'geof:sfIntersects']\nGenerator: ```SELECT (COUNT (DISTINCT ?p1) as ?streams) WHERE {{ ?p1 rdf:type y2geoo:OSM_stream; geo:hasGeometry ?p1geo. ?p1geo geo:asWKT ?p1WKT. ?p2 rdf:type y2geoo:OSM_lake; geo:hasGeometry ?p2geo. ?p2geo geo:asWKT ?p2WKT. FILTER(geof:sfIntersects(?p1WKT, ?p2WKT)) }}```\nHuman: Which Municipalities are on Thessaly's border?\nThe generator must use these URIs to answer the question: ['yago:Thessaly', 'geo:hasGeometry', 'geo:asWKT', 'rdf:type', 'y2geoo:GAG_Municipality', 'geo:hasGeometry', 'geo:asWKT', 'strdf:touches']\nGenerator: ```SELECT distinct ?rg where {{ yago:Thessaly geo:hasGeometry ?tgeo . ?tgeo geo:asWKT ?tgWKT . ?rg rdf:type y2geoo:GAG_Municipality . ?rg geo:hasGeometry ?rggeo . ?rggeo geo:asWKT ?rgWKT . FILTER (strdf:touches(?tgWKT,?rgWKT)) . }}```\nHuman: Which is the largest island in Ireland?\nThe generator must use these URIs to answer the question: ['strdf:area', 'yago:Republic_of_Ireland', 'geo:hasGeometry', 'geo:asWKT', 'y2geoo:OSM_island', 'geo:hasGeometry', 'geo:asWKT', 'geof:sfContains']\nGenerator: ```select distinct ?x (strdf:area(?lWKT) as ?area) where {{ yago:Republic_of_Ireland geo:hasGeometry ?geom . ?geom geo:asWKT ?mWKT . ?lake a y2geoo:OSM_island . ?lake geo:hasGeometry ?geol . ?geol geo:asWKT ?lWKT . FILTER (geof:sfContains(?mWKT, ?lWKT)) }} ORDER BY (?area) LIMIT 1```\nHuman: Is Crete south of Thessaly?\nThe generator must use these URIs to answer the question: ['http://yago-knowledge.org/resource/Crete', 'geo:hasGeometry', 'http://yago-knowledge.org/resource/Thessaly', 'geo:hasGeometry', 'geo:asWKT', 'geo:asWKT', 'strdf:below']\nGenerator: ```ASK {{ <http://yago-knowledge.org/resource/Crete> geo:hasGeometry ?geo1 . <http://yago-knowledge.org/resource/Thessaly> geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(strdf:below(?geoWKT1, ?geoWKT2)) }}```\nHuman: What is the population of Northern Ireland?\nThe generator must use these URIs to answer the question: ['xsd:integer', 'yago:Northern_Ireland', 'yago:hasPopulation']\nGenerator: ```SELECT (xsd:integer (?population) as ?pop) WHERE {{ yago:Northern_Ireland yago:'hasPopulation ?population. }}```\nHuman: {user_prompt}\nThe generator must use these URIs to answer the question: {uris}\nGenerator: ```\"\"\"\n    \n    return prompt\n\ndef get_six_shot_auri_prompt(user_prompt, uris):\n    prompt = f\"\"\"Human: In Breckland district, which forests are south of streams?\nThe generator may use these URIs to answer the question: ['yago:Breckland_District', 'y2geoo:OS_DistrictWard', 'y2geoo:OSM_forest', 'y2geoo:OSM_stream']\nGenerator: ```SELECT DISTINCT ?forest WHERE {{ yago:Breckland_District geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . ?forest rdf:type y2geoo:OSM_forest . ?forest geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 . ?stream rdf:type y2geoo:OSM_stream . ?stream geo:hasGeometry ?o3 . ?o3 geo:asWKT ?geoWKT3 . FILTER (strdf:within(?geoWKT2, ?geoWKT1) && strdf:within(?geoWKT3, ?geoWKT1) && strdf:below(?geoWKT2, ?geoWKT3)) }}```\nHuman: How many streams intersect with lakes?\nThe generator may use these URIs to answer the question: ['y2geoo:OSM_lake']\nGenerator: ```SELECT (COUNT (DISTINCT ?p1) as ?streams) WHERE {{ ?p1 rdf:type y2geoo:OSM_stream; geo:hasGeometry ?p1geo. ?p1geo geo:asWKT ?p1WKT. ?p2 rdf:type y2geoo:OSM_lake; geo:hasGeometry ?p2geo. ?p2geo geo:asWKT ?p2WKT. FILTER(geof:sfIntersects(?p1WKT, ?p2WKT)) }}```\nHuman: Which Municipalities are on Thessaly's border?\nThe generator may use these URIs to answer the question: []\nGenerator: ```SELECT distinct ?rg where {{ yago:Thessaly geo:hasGeometry ?tgeo . ?tgeo geo:asWKT ?tgWKT . ?rg rdf:type y2geoo:GAG_Municipality . ?rg geo:hasGeometry ?rggeo . ?rggeo geo:asWKT ?rgWKT . FILTER (strdf:touches(?tgWKT,?rgWKT)) . }}```\nHuman: Which is the largest island in Ireland?\nThe generator may use these URIs to answer the question: ['y2geoo:OSM_island', 'y2geoo:OSM_stream']\nGenerator: ```select distinct ?x (strdf:area(?lWKT) as ?area) where {{ yago:Republic_of_Ireland geo:hasGeometry ?geom . ?geom geo:asWKT ?mWKT . ?lake a y2geoo:OSM_island . ?lake geo:hasGeometry ?geol . ?geol geo:asWKT ?lWKT . FILTER (geof:sfContains(?mWKT, ?lWKT)) }} ORDER BY (?area) LIMIT 1```\nHuman: Is Crete south of Thessaly?\nThe generator may use these URIs to answer the question: []\nGenerator: ```ASK {{ yago:Crete geo:hasGeometry ?geo1 . yago:Thessaly geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(strdf:below(?geoWKT1, ?geoWKT2)) }}```\nHuman: What is the population of Northern Ireland?\nThe generator may use these URIs to answer the question: ['yago:Ireland']\nGenerator: ```SELECT (xsd:integer (?population) as ?pop) WHERE {{ yago:Northern_Ireland yago:'hasPopulation ?population. }}```\nHuman: {user_prompt}\nThe generator may use these URIs to answer the question: {uris}\nGenerator: ```\"\"\"\n    \n    return prompt\n\ndef get_plain_six_shot_prompt(prompt):\n    prompt = f\"\"\"Human: In Breckland district, which forests are south of streams?\nGenerator: ```SELECT DISTINCT ?forest WHERE {{ yago:Breckland_District geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . ?forest rdf:type y2geoo:OSM_forest . ?forest geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 . ?stream rdf:type y2geoo:OSM_stream . ?stream geo:hasGeometry ?o3 . ?o3 geo:asWKT ?geoWKT3 . FILTER (strdf:within(?geoWKT2, ?geoWKT1) && strdf:within(?geoWKT3, ?geoWKT1) && strdf:below(?geoWKT2, ?geoWKT3)) }}```\nHuman: How many streams intersect with lakes?\nGenerator: ```SELECT (COUNT (DISTINCT ?p1) as ?streams) WHERE {{ ?p1 rdf:type y2geoo:OSM_stream; geo:hasGeometry ?p1geo. ?p1geo geo:asWKT ?p1WKT. ?p2 rdf:type y2geoo:OSM_lake; geo:hasGeometry ?p2geo. ?p2geo geo:asWKT ?p2WKT. FILTER(geof:sfIntersects(?p1WKT, ?p2WKT)) }}```\nHuman: Which Municipalities are on Thessaly's border?\nGenerator: ```SELECT distinct ?rg where {{ yago:Thessaly geo:hasGeometry ?tgeo . ?tgeo geo:asWKT ?tgWKT . ?rg rdf:type y2geoo:GAG_Municipality . ?rg geo:hasGeometry ?rggeo . ?rggeo geo:asWKT ?rgWKT . FILTER (strdf:touches(?tgWKT,?rgWKT)) . }}```\nHuman: Which is the largest island in Ireland?\nGenerator: ```select distinct ?x (strdf:area(?lWKT) as ?area) where {{ yago:Republic_of_Ireland geo:hasGeometry ?geom . ?geom geo:asWKT ?mWKT . ?lake a y2geoo:OSM_island . ?lake geo:hasGeometry ?geol . ?geol geo:asWKT ?lWKT . FILTER (geof:sfContains(?mWKT, ?lWKT)) }} ORDER BY (?area) LIMIT 1```\nHuman: Is Crete south of Thessaly?\nGenerator: ```ASK {{ <http://yago-knowledge.org/resource/Crete> geo:hasGeometry ?geo1 . <http://yago-knowledge.org/resource/Thessaly> geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(strdf:below(?geoWKT1, ?geoWKT2)) }}```\nHuman: What is the population of Northern Ireland?\nGenerator: ```SELECT (xsd:integer (?population) as ?pop) WHERE {{ yago:Northern_Ireland yago:'hasPopulation ?population. }}```\nHuman: {prompt}\nGenerator: ```\"\"\"\n    \n    return prompt    \n    \ndef get_uri_prompt(user_prompt, uris):\n    prompt = f\"\"\"Human: {user_prompt}\nThe generator must use these URIs to answer the question: {uris}\nGenerator: ```\"\"\"\n    return prompt\n\ndef get_plain_three_shot_prompt(user_prompt):\n    prompt = f\"\"\"Human: In Breckland district, which forests are south of streams?\nGenerator: ```SELECT DISTINCT ?forest WHERE {{ yago:Breckland_District geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . ?forest rdf:type y2geoo:OSM_forest . ?forest geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 . ?stream rdf:type y2geoo:OSM_stream . ?stream geo:hasGeometry ?o3 . ?o3 geo:asWKT ?geoWKT3 . FILTER (strdf:within(?geoWKT2, ?geoWKT1) && strdf:within(?geoWKT3, ?geoWKT1) && strdf:below(?geoWKT2, ?geoWKT3)) }}```\nHuman: How many streams intersect with lakes?\nGenerator: ```SELECT (COUNT (DISTINCT ?p1) as ?streams) WHERE {{ ?p1 rdf:type y2geoo:OSM_stream; geo:hasGeometry ?p1geo. ?p1geo geo:asWKT ?p1WKT. ?p2 rdf:type y2geoo:OSM_lake; geo:hasGeometry ?p2geo. ?p2geo geo:asWKT ?p2WKT. FILTER(geof:sfIntersects(?p1WKT, ?p2WKT)) }}```\nHuman: Which Municipalities are on Thessaly's border?\nGenerator: ```SELECT distinct ?rg where {{ yago:Thessaly geo:hasGeometry ?tgeo . ?tgeo geo:asWKT ?tgWKT . ?rg rdf:type y2geoo:GAG_Municipality . ?rg geo:hasGeometry ?rggeo . ?rggeo geo:asWKT ?rgWKT . FILTER (strdf:touches(?tgWKT,?rgWKT)) . }}```\nHuman: {user_prompt}\nGenerator: ```\"\"\"\n    return prompt","metadata":{"execution":{"iopub.status.busy":"2024-09-13T17:22:31.871319Z","iopub.execute_input":"2024-09-13T17:22:31.871680Z","iopub.status.idle":"2024-09-13T17:22:31.890007Z","shell.execute_reply.started":"2024-09-13T17:22:31.871649Z","shell.execute_reply":"2024-09-13T17:22:31.889074Z"},"trusted":true},"execution_count":7,"outputs":[]},{"cell_type":"markdown","source":"Inference with GPT-4 Turbo.","metadata":{}},{"cell_type":"code","source":"pip install openai==0.28","metadata":{"execution":{"iopub.status.busy":"2024-09-13T17:22:31.893537Z","iopub.execute_input":"2024-09-13T17:22:31.893905Z","iopub.status.idle":"2024-09-13T17:22:45.061056Z","shell.execute_reply.started":"2024-09-13T17:22:31.893878Z","shell.execute_reply":"2024-09-13T17:22:45.059830Z"},"trusted":true},"execution_count":8,"outputs":[{"name":"stdout","text":"Collecting openai==0.28\n  Downloading openai-0.28.0-py3-none-any.whl.metadata (13 kB)\nRequirement already satisfied: requests>=2.20 in /opt/conda/lib/python3.10/site-packages (from openai==0.28) (2.32.3)\nRequirement already satisfied: tqdm in /opt/conda/lib/python3.10/site-packages (from openai==0.28) (4.66.4)\nRequirement already satisfied: aiohttp in /opt/conda/lib/python3.10/site-packages (from openai==0.28) (3.9.1)\nRequirement already satisfied: charset-normalizer<4,>=2 in /opt/conda/lib/python3.10/site-packages (from requests>=2.20->openai==0.28) (3.3.2)\nRequirement already satisfied: idna<4,>=2.5 in /opt/conda/lib/python3.10/site-packages (from requests>=2.20->openai==0.28) (3.6)\nRequirement already satisfied: urllib3<3,>=1.21.1 in /opt/conda/lib/python3.10/site-packages (from requests>=2.20->openai==0.28) (1.26.18)\nRequirement already satisfied: certifi>=2017.4.17 in /opt/conda/lib/python3.10/site-packages (from requests>=2.20->openai==0.28) (2024.7.4)\nRequirement already satisfied: attrs>=17.3.0 in /opt/conda/lib/python3.10/site-packages (from aiohttp->openai==0.28) (23.2.0)\nRequirement already satisfied: multidict<7.0,>=4.5 in /opt/conda/lib/python3.10/site-packages (from aiohttp->openai==0.28) (6.0.4)\nRequirement already satisfied: yarl<2.0,>=1.0 in /opt/conda/lib/python3.10/site-packages (from aiohttp->openai==0.28) (1.9.3)\nRequirement already satisfied: frozenlist>=1.1.1 in /opt/conda/lib/python3.10/site-packages (from aiohttp->openai==0.28) (1.4.1)\nRequirement already satisfied: aiosignal>=1.1.2 in /opt/conda/lib/python3.10/site-packages (from aiohttp->openai==0.28) (1.3.1)\nRequirement already satisfied: async-timeout<5.0,>=4.0 in /opt/conda/lib/python3.10/site-packages (from aiohttp->openai==0.28) (4.0.3)\nDownloading openai-0.28.0-py3-none-any.whl (76 kB)\n\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m76.5/76.5 kB\u001b[0m \u001b[31m1.1 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0meta \u001b[36m0:00:01\u001b[0m\n\u001b[?25hInstalling collected packages: openai\nSuccessfully installed openai-0.28.0\nNote: you may need to restart the kernel to use updated packages.\n","output_type":"stream"}]},{"cell_type":"code","source":"greatjobman = f\"\"\"Human: In Breckland district, which forests are south of streams?\nGenerator: ```SELECT DISTINCT ?forest WHERE {{ yago:Breckland_District geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . ?forest rdf:type y2geoo:OSM_forest . ?forest geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 . ?stream rdf:type y2geoo:OSM_stream . ?stream geo:hasGeometry ?o3 . ?o3 geo:asWKT ?geoWKT3 . FILTER (strdf:within(?geoWKT2, ?geoWKT1) && strdf:within(?geoWKT3, ?geoWKT1) && strdf:below(?geoWKT2, ?geoWKT3)) }}```\nHuman: How many streams intersect with lakes?\nGenerator: ```SELECT (COUNT (DISTINCT ?p1) as ?streams) WHERE {{ ?p1 rdf:type y2geoo:OSM_stream; geo:hasGeometry ?p1geo. ?p1geo geo:asWKT ?p1WKT. ?p2 rdf:type y2geoo:OSM_lake; geo:hasGeometry ?p2geo. ?p2geo geo:asWKT ?p2WKT. FILTER(geof:sfIntersects(?p1WKT, ?p2WKT)) }}```\nHuman: Which Municipalities are on Thessaly's border?\nGenerator: ```SELECT distinct ?rg where {{ yago:Thessaly geo:hasGeometry ?tgeo . ?tgeo geo:asWKT ?tgWKT . ?rg rdf:type y2geoo:GAG_Municipality . ?rg geo:hasGeometry ?rggeo . ?rggeo geo:asWKT ?rgWKT . FILTER (strdf:touches(?tgWKT,?rgWKT)) . }}```\nHuman: Which is the largest island in Ireland?\nGenerator: ```select distinct ?x (strdf:area(?lWKT) as ?area) where {{ yago:Republic_of_Ireland geo:hasGeometry ?geom . ?geom geo:asWKT ?mWKT . ?lake a y2geoo:OSM_island . ?lake geo:hasGeometry ?geol . ?geol geo:asWKT ?lWKT . FILTER (geof:sfContains(?mWKT, ?lWKT)) }} ORDER BY (?area) LIMIT 1```\nHuman: Is Crete south of Thessaly?\nGenerator: ```ASK {{ <http://yago-knowledge.org/resource/Crete> geo:hasGeometry ?geo1 . <http://yago-knowledge.org/resource/Thessaly> geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(strdf:below(?geoWKT1, ?geoWKT2)) }}```\nHuman: What is the population of Northern Ireland?\nGenerator: ```SELECT (xsd:integer (?population) as ?pop) WHERE {{ yago:Northern_Ireland yago:'hasPopulation ?population. }}```\nHuman: What is the area of West Sussex?\nGenerator: ```\"\"\"","metadata":{"execution":{"iopub.status.busy":"2024-09-13T17:22:45.062497Z","iopub.execute_input":"2024-09-13T17:22:45.062845Z","iopub.status.idle":"2024-09-13T17:22:45.068909Z","shell.execute_reply.started":"2024-09-13T17:22:45.062814Z","shell.execute_reply":"2024-09-13T17:22:45.068002Z"},"trusted":true},"execution_count":9,"outputs":[]},{"cell_type":"code","source":"import openai\n\ndef generate_response(prompt):\n    # Set your OpenAI API key here\n    openai.api_key = 'sk-None-QrNfbvD7lMiRB0cGKUfAT3BlbkFJgi3Rtr632pTKhtmYJi4r'\n    \n    response = openai.ChatCompletion.create(\n        model=\"gpt-4o-mini\",\n        messages=[\n            {\"role\": \"system\", \"content\": \"\"\"You are an expert SPARQL query generator. For each question that the user supplies, you will convert it into a valid SPARQL query that can be used to answer the question. The query will be based on the Yago2Geo knowledge graph. The query should be enclosed by three backticks on new lines, denoting that it is a code block. You will not provide further details. You will also be provided with a few relevant URIs for each query, they are not necesarily correct. You must judge whether to use them or not.\"\"\"},\n            {\"role\": \"user\", \"content\": prompt}\n        ],\n        max_tokens=150,\n        n=1,\n        stop=None,\n        temperature=0.7,\n    )\n#     print(response.choices[0].message['content'])\n    return response.choices[0].message['content']","metadata":{"execution":{"iopub.status.busy":"2024-09-13T17:22:45.070171Z","iopub.execute_input":"2024-09-13T17:22:45.070739Z","iopub.status.idle":"2024-09-13T17:22:45.224135Z","shell.execute_reply.started":"2024-09-13T17:22:45.070705Z","shell.execute_reply":"2024-09-13T17:22:45.223250Z"},"trusted":true},"execution_count":10,"outputs":[]},{"cell_type":"code","source":"import random\n\n# Run inference and cleanup.\ndef generate_URI_injected_query(user_prompt, uris):\n    # Direct extraction, NOTE: try expanded extraction.\n#     uris = extract_uris(gt_query)\n#     Shuffle the uris so their order is not as they appear in the query.\n#     random.shuffle(uris)\n    prompt = get_six_shot_auri_prompt(user_prompt, uris)\n    \n    results = generate_response(prompt)\n    results = results[3:]\n    \n    end_index = results.find(\"```\")\n    query = results\n    # Extract the substring from the start of the string up to the first occurrence of ```\n    if end_index != -1:\n        query = results[:end_index]\n    else:\n        # If ``` is not found, keep the original string\n        query = results\n\n    # Now remove the SPARQL prefix that the model adds.\n    start_index = query.find(\"sparql\")\n    if start_index == 0:\n        # Remove the prefix and all characters leading up to it\n        query = query[start_index + len(\"sparql\"):]\n\n    print(f\"URI QUERY: {query}\")\n    return query","metadata":{"execution":{"iopub.status.busy":"2024-09-13T17:22:45.225246Z","iopub.execute_input":"2024-09-13T17:22:45.225843Z","iopub.status.idle":"2024-09-13T17:22:45.233575Z","shell.execute_reply.started":"2024-09-13T17:22:45.225817Z","shell.execute_reply":"2024-09-13T17:22:45.232296Z"},"trusted":true},"execution_count":11,"outputs":[]},{"cell_type":"code","source":"import random\n\n# Run inference and cleanup.\ndef generate_query(user_prompt, gt_query):\n    prompt = get_plain_six_shot_prompt(user_prompt)\n    \n    results = generate_response(prompt)\n    results = results[3:]\n    \n    end_index = results.find(\"```\")\n    query = results\n    # Extract the substring from the start of the string up to the first occurrence of ```\n    if end_index != -1:\n        query = results[:end_index]\n    else:\n        # If ``` is not found, keep the original string\n        query = results\n\n    # Now remove the SPARQL prefix that the model adds.\n    start_index = query.find(\"sparql\")\n    if start_index == 0:\n        # Remove the prefix and all characters leading up to it\n        query = query[start_index + len(\"sparql\"):]\n\n    print(f\"PLAIN QUERY: {query}\")\n    return query","metadata":{"execution":{"iopub.status.busy":"2024-09-13T17:22:45.235039Z","iopub.execute_input":"2024-09-13T17:22:45.235692Z","iopub.status.idle":"2024-09-13T17:22:45.245583Z","shell.execute_reply.started":"2024-09-13T17:22:45.235657Z","shell.execute_reply":"2024-09-13T17:22:45.244770Z"},"trusted":true},"execution_count":12,"outputs":[]},{"cell_type":"markdown","source":"Normalize queries before passing them to the endpoint to ensure uniformity across results.","metadata":{}},{"cell_type":"code","source":"def normalize_variables(query):\n    if query is None:\n        return \"\"\n    variable_pattern = re.compile(r\"\\?\\w+\")\n    variables = variable_pattern.findall(query)\n    normalized_query = query\n    for i, var in enumerate(variables):\n        normalized_query = normalized_query.replace(var, f\"?var{i}\")\n    return normalized_query","metadata":{"execution":{"iopub.status.busy":"2024-09-13T17:22:45.246772Z","iopub.execute_input":"2024-09-13T17:22:45.247093Z","iopub.status.idle":"2024-09-13T17:22:45.255877Z","shell.execute_reply.started":"2024-09-13T17:22:45.247067Z","shell.execute_reply":"2024-09-13T17:22:45.254978Z"},"trusted":true},"execution_count":13,"outputs":[]},{"cell_type":"markdown","source":"To further ensure that correct results are not rejected, this custom comparisson function: ","metadata":{}},{"cell_type":"code","source":"def csv_to_columns(csv_data):\n    rows = csv_data.strip().split('\\n')\n    data_rows = [row.split(',') for row in rows[1:]]  # Skip the header row\n    columns = list(zip(*data_rows))  # Transpose rows to columns\n    return columns\n\ndef compare_csv_columns(csv1, csv2):\n    columns1 = csv_to_columns(csv1)\n    columns2 = csv_to_columns(csv2)\n    \n    set_columns1 = {tuple(col) for col in columns1}\n    set_columns2 = {tuple(col) for col in columns2}\n    \n    #return not set_columns1.isdisjoint(set_columns2)\n    \n    common_columns = set_columns1.intersection(set_columns2)\n    \n    if common_columns:\n        return True\n    else:\n        return False","metadata":{"execution":{"iopub.status.busy":"2024-09-13T17:22:45.256955Z","iopub.execute_input":"2024-09-13T17:22:45.257256Z","iopub.status.idle":"2024-09-13T17:22:45.268945Z","shell.execute_reply.started":"2024-09-13T17:22:45.257231Z","shell.execute_reply":"2024-09-13T17:22:45.268003Z"},"trusted":true},"execution_count":14,"outputs":[]},{"cell_type":"code","source":"import json, requests\n\n# with open('/kaggle/input/aurii-concepts-dataset/concepts_dataset.json', 'r') as file:\n#     original_dataset = json.load(file)\n    \n# with open('/kaggle/input/auto-uri-i-instances/LLM-WAT-ED-dataest.json', 'r') as file:\n#     original_dataset = json.load(file)\n    \nwith open('/kaggle/input/aurii-concepts-instances-dataset/concepts_instances_dataset.json', 'r') as file:\n    original_dataset = json.load(file)\n    \ndetailed_comp1 = 0\n\ndetailed_comp2 = 0\n\ngt_results = []\ngen_results = []\n\ni = 0\nfor key in original_dataset:\n    print(i)\n    i+=1\n#     if i < 13:\n#         continue\n    query = original_dataset[key]['Query']\n    # Normalize the query\n    query = normalize_variables(query)\n    gt_result = graphdb_send_request(query)\n    gt_results.append(gt_result)\n    \n    question = original_dataset[key]['Question']\n    \n    uris = original_dataset[key]['Gen_URI']\n    gen_query1 = generate_URI_injected_query(question, uris)\n    gen_query2 = generate_query(question, query)\n    # Normalize the query\n    gen_result1 = graphdb_send_request(gen_query1)\n    gen_result2 = graphdb_send_request(gen_query2)\n    gen_results.append(gen_result1)\n    \n    if gen_result1 and gt_result:\n        comparisson = compare_csv_columns(gt_result, gen_result1)\n        if comparisson == True:  \n            detailed_comp1 += 1\n        print(f\"URI: {detailed_comp1}\")\n        \n    if gen_result2 and gt_result:\n        comparisson = compare_csv_columns(gt_result, gen_result2)\n        if comparisson == True:  \n            detailed_comp2 += 1\n        print(f\"PLAIN: {detailed_comp2}\")\n        \nprint (detailed_comp/100)","metadata":{"execution":{"iopub.status.busy":"2024-09-13T17:22:45.270157Z","iopub.execute_input":"2024-09-13T17:22:45.270780Z","iopub.status.idle":"2024-09-13T17:34:39.962952Z","shell.execute_reply.started":"2024-09-13T17:22:45.270753Z","shell.execute_reply":"2024-09-13T17:34:39.961452Z"},"trusted":true},"execution_count":15,"outputs":[{"name":"stdout","text":"0\nURI QUERY: SELECT DISTINCT ?park (strdf:area(?parkWKT) as ?area) WHERE { yago:Greece geo:hasGeometry ?geom . ?geom geo:asWKT ?gWKT . ?park rdf:type y2geoo:OSM_park . ?park geo:hasGeometry ?parkGeo . ?parkGeo geo:asWKT ?parkWKT . FILTER(geof:sfContains(?gWKT, ?parkWKT)) } ORDER BY DESC(?area) LIMIT 1\nPLAIN QUERY: SELECT DISTINCT ?park (strdf:area(?parkWKT) as ?area) WHERE { yago:Greece geo:hasGeometry ?greeceGeom . ?greeceGeom geo:asWKT ?greeceWKT . ?park rdf:type y2geoo:OSM_park . ?park geo:hasGeometry ?parkGeom . ?parkGeom geo:asWKT ?parkWKT . FILTER (geof:sfContains(?greeceWKT, ?parkWKT)) } ORDER BY (?area) LIMIT 1\nURI: 1\nPLAIN: 0\n1\nURI QUERY: SELECT DISTINCT ?woodland WHERE { yago:Staffordshire geo:hasGeometry ?sgeo . ?sgeo geo:asWKT ?sWKT . ?district rdf:type y2geoo:OS_District . ?district geo:hasGeometry ?dgeo . ?dgeo geo:asWKT ?dWKT . ?woodland rdf:type y2geoo:OSM_forest . ?woodland geo:hasGeometry ?wgeo . ?wgeo geo:asWKT ?wWKT . FILTER (strdf:below(?dWKT, ?sWKT)) }\nPLAIN QUERY: SELECT DISTINCT ?woodland WHERE { ?district rdf:type y2geoo:GAG_District ; geo:hasGeometry ?dgeo . ?dgeo geo:asWKT ?dWKT . ?woodland rdf:type y2geoo:OSM_woodland ; geo:hasGeometry ?wgeo . ?wgeo geo:asWKT ?wWKT . FILTER (strdf:below(?dWKT, ?wWKT) && strdf:within(?dWKT, ?wWKT)) . }\nURI: 1\nPLAIN: 0\n2\nURI QUERY: ASK { yago:Edinburgh geo:hasGeometry ?geo1 . yago:London geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(strdf:above(?geoWKT1, ?geoWKT2)) }\nPLAIN QUERY: ASK { <http://yago-knowledge.org/resource/Edinburgh> geo:hasGeometry ?geo1 . <http://yago-knowledge.org/resource/London> geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(strdf:above(?geoWKT1, ?geoWKT2)) }\nURI: 1\nPLAIN: 0\n3\nURI QUERY: SELECT (COUNT(DISTINCT ?lake) AS ?lakeCount) (SUM(strdf:area(?lakeWKT)) AS ?totalLakeArea) WHERE { yago:Thrace geo:hasGeometry ?thraceGeo . ?thraceGeo geo:asWKT ?thraceWKT . ?lake rdf:type y2geoo:OSM_lake; geo:hasGeometry ?lakeGeo . ?lakeGeo geo:asWKT ?lakeWKT . FILTER(geof:sfWithin(?lakeWKT, ?thraceWKT)) }\nPLAIN QUERY: SELECT (SUM(?lakeArea) / SUM(?totalArea) * 100 as ?percentage) WHERE { \n  ?region rdf:type y2geoo:OSM_region; \n          geo:hasGeometry ?regionGeo. \n  ?regionGeo geo:asWKT ?regionWKT. \n  ?lake rdf:type y2geoo:OSM_lake; \n        geo:hasGeometry ?lakeGeo. \n  ?lakeGeo geo:asWKT ?lakeWKT. \n  FILTER(geof:sfWithin(?lakeWKT, ?regionWKT)). \n  BIND(strdf:area(?lakeWKT) as ?lakeArea). \n  BIND(strdf:area(?\nMaterialize failed: {\"timestamp\":\"2024-09-13T17:24:03.446+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\nHTTP error (most likely invalid query)\nURI: 1\n4\nURI QUERY: SELECT DISTINCT ?townland WHERE { yago:Dublin geo:hasGeometry ?dublinGeo . ?dublinGeo geo:asWKT ?dublinWKT . ?townland rdf:type y2geoo:OSNI_Townland . ?townland geo:hasGeometry ?townlandGeo . ?townlandGeo geo:asWKT ?townlandWKT . FILTER (strdf:touches(?dublinWKT, ?townlandWKT)) }\nPLAIN QUERY: SELECT DISTINCT ?townland WHERE { ?townland rdf:type y2geoo:OSM_townland . ?county rdf:type y2geoo:GAG_CountyCouncil . ?county rdfs:label \"Dublin\" . ?townland geo:hasGeometry ?townlandGeo . ?county geo:hasGeometry ?countyGeo . ?townlandGeo geo:asWKT ?townlandWKT . ?countyGeo geo:asWKT ?countyWKT . FILTER (strdf:touches(?townlandWKT, ?countyWKT)) }\nURI: 1\nPLAIN: 0\n5\nURI QUERY: SELECT (COUNT(DISTINCT ?beach) as ?beaches) WHERE { ?beach rdf:type y2geoo:OSM_beach; geo:hasGeometry ?beachGeo. ?beachGeo geo:asWKT ?beachWKT. ?reserve rdf:type y2geoo:OSM_nature_reserve; geo:hasGeometry ?reserveGeo. ?reserveGeo geo:asWKT ?reserveWKT. FILTER(geof:sfIntersects(?beachWKT, ?reserveWKT)) }\nPLAIN QUERY: SELECT (COUNT(DISTINCT ?beach) as ?beaches) WHERE { ?beach rdf:type y2geoo:OSM_beach; geo:hasGeometry ?beachGeo. ?natureReserve rdf:type y2geoo:OSM_nature_reserve; geo:hasGeometry ?reserveGeo. ?beachGeo geo:asWKT ?beachWKT. ?reserveGeo geo:asWKT ?reserveWKT. FILTER(geof:sfTouches(?beachWKT, ?reserveWKT)) }\nURI: 1\nPLAIN: 1\n6\nURI QUERY: SELECT ?location WHERE { yago:Swansea geo:hasGeometry ?geo . ?geo geo:asWKT ?location }\nPLAIN QUERY: SELECT ?location WHERE { yago:Swansea geo:hasGeometry ?geom . ?geom geo:asWKT ?location }\nURI: 2\nPLAIN: 2\n7\nURI QUERY: SELECT (xsd:integer (?population) as ?pop) WHERE { yago:Kallithea geo:hasPopulation ?population. }\nPLAIN QUERY: SELECT (xsd:integer(?population) as ?pop) WHERE { yago:Kallithea yago:hasPopulation ?population. }\nURI: 2\nPLAIN: 3\n8\nURI QUERY: SELECT DISTINCT ?region WHERE { ?region rdf:type y2geoo:GAG_Region . ?region yago:hasPopulation ?population . FILTER(?population >= 500000 && ?population <= 1000000) }\nPLAIN QUERY: SELECT DISTINCT ?region WHERE { ?region rdf:type y2geoo:Region . ?region yago:hasPopulation ?population . FILTER(?population >= 500000 && ?population <= 1000000) }\nURI: 2\nPLAIN: 3\n9\nURI QUERY: SELECT DISTINCT ?municipality WHERE { yago:Central_Athens_Regional_Unit geo:hasGeometry ?regionGeo . ?municipality rdf:type y2geoo:GAG_Municipality . ?municipality geo:hasGeometry ?municipalityGeo . FILTER(geof:sfWithin(?municipalityGeo, ?regionGeo)) }\nPLAIN QUERY: SELECT DISTINCT ?municipality WHERE { yago:Central_Athens_Regional_Unit geo:hasGeometry ?geometry . ?municipality rdf:type y2geoo:GAG_Municipality . ?municipality geo:hasGeometry ?municipalityGeometry . FILTER (geof:sfWithin(?municipalityGeometry, ?geometry)) }\nURI: 2\nPLAIN: 3\n10\nURI QUERY: SELECT DISTINCT ?town WHERE { yago:Thrace geo:hasGeometry ?tgeo . ?tgeo geo:asWKT ?tgWKT . ?lake rdf:type y2geoo:OSM_lake . ?lake geo:hasGeometry ?lgeo . ?lgeo geo:asWKT ?lWKT . ?town rdf:type y2geoo:OSM_town . ?town geo:hasGeometry ?tgeoTown . ?tgeoTown geo:asWKT ?townWKT . FILTER (geof:sfWest(?townWKT, ?lWKT)) }\nPLAIN QUERY: SELECT DISTINCT ?town WHERE { yago:Thrace geo:hasGeometry ?tgeo . ?tgeo geo:asWKT ?tgWKT . ?town rdf:type y2geoo:OSM_town . ?town geo:hasGeometry ?tgeoTown . ?tgeoTown geo:asWKT ?townWKT . ?lake rdf:type y2geoo:OSM_lake . ?lake geo:hasGeometry ?lakegeo . ?lakegeo geo:asWKT ?lakeWKT . FILTER (geof:sfWest(?townWKT, ?lakeWKT)) }\nURI: 2\nPLAIN: 3\n11\nURI QUERY: SELECT (COUNT(DISTINCT ?forest) as ?numberOfForests) WHERE { ?forest rdf:type y2geoo:OSM_forest; geo:hasGeometry ?forestGeo. ?forestGeo geo:asWKT ?forestWKT. ?lake rdf:type y2geoo:OSM_lake; geo:hasGeometry ?lakeGeo. ?lakeGeo geo:asWKT ?lakeWKT. FILTER(geof:sfTouches(?forestWKT, ?lakeWKT)) }\nPLAIN QUERY: SELECT (COUNT(DISTINCT ?forest) AS ?numberOfForests) WHERE { ?forest rdf:type y2geoo:OSM_forest; geo:hasGeometry ?forestGeo. ?lake rdf:type y2geoo:OSM_lake; geo:hasGeometry ?lakeGeo. ?forestGeo geo:asWKT ?forestWKT. ?lakeGeo geo:asWKT ?lakeWKT. FILTER(geof:sfTouches(?forestWKT, ?lakeWKT)) }\nURI: 3\nPLAIN: 4\n12\nURI QUERY: SELECT (COUNT(DISTINCT ?lake) AS ?numberOfLakes) WHERE { ?lake rdf:type y2geoo:OSM_lake; geo:hasGeometry ?lakeGeo. ?forest rdf:type y2geoo:OSM_forest; geo:hasGeometry ?forestGeo. ?lakeGeo geo:asWKT ?lakeWKT. ?forestGeo geo:asWKT ?forestWKT. FILTER(geof:sfIntersects(?lakeWKT, ?forestWKT)) }\nPLAIN QUERY: SELECT (COUNT(DISTINCT ?lake) as ?numLakes) WHERE { ?lake rdf:type y2geoo:OSM_lake; geo:hasGeometry ?lakeGeo. ?forest rdf:type y2geoo:OSM_forest; geo:hasGeometry ?forestGeo. ?lakeGeo geo:asWKT ?lakeWKT. ?forestGeo geo:asWKT ?forestWKT. FILTER(geof:sfIntersects(?lakeWKT, ?forestWKT)) }\nURI: 4\nPLAIN: 5\n13\nURI QUERY: ASK { yago:Liverpool geo:hasGeometry ?geo1 . yago:Manchester geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(geof:sfWithin(geof:sfDistance(?geoWKT1, ?geoWKT2), 40000)) }\nPLAIN QUERY: ASK { <http://yago-knowledge.org/resource/Liverpool> geo:hasGeometry ?geo1 . <http://yago-knowledge.org/resource/Manchester> geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?wkt1 . ?geo2 geo:asWKT ?wkt2 . FILTER(geof:distance(?wkt1, ?wkt2) >= 39 && geof:distance(?wkt1, ?wkt2) <= 41) }\nMaterialize failed: {\"timestamp\":\"2024-09-13T17:25:07.295+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\nHTTP error (most likely invalid query)\nPLAIN: 6\n14\nURI QUERY: ASK { yago:Cardiff geo:hasGeometry ?geo1 . yago:Birmingham geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?wkt1 . ?geo2 geo:asWKT ?wkt2 . FILTER(strdf:touches(?wkt1, ?wkt2)) }\nPLAIN QUERY: ASK { <http://yago-knowledge.org/resource/Cardiff> geo:hasGeometry ?geo1 . <http://yago-knowledge.org/resource/Birmingham> geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(strdf:touches(?geoWKT1, ?geoWKT2)) }\nURI: 5\nPLAIN: 7\n15\nURI QUERY: SELECT (COUNT(?county) AS ?count) WHERE { ?county rdf:type y2geoo:OS_County; yago:hasPopulation ?population. FILTER(?county = yago:County_Leitrim) }\nPLAIN QUERY: ASK { yago:Leitrim yago:hasPopulation ?pop1 . ?county rdf:type y2geoo:OSM_county . ?county yago:hasPopulation ?pop2 . FILTER(?pop1 < ?pop2) }\nURI: 5\nPLAIN: 7\n16\nURI QUERY: SELECT DISTINCT ?lake (strdf:area(?lakeWKT) as ?area) WHERE { yago:England geo:hasGeometry ?englandGeom . ?englandGeom geo:asWKT ?englandWKT . ?lake rdf:type y2geoo:OSM_lake . ?lake geo:hasGeometry ?lakeGeom . ?lakeGeom geo:asWKT ?lakeWKT . FILTER(geof:sfWithin(?lakeWKT, ?englandWKT)) } ORDER BY (?area) LIMIT 1\nPLAIN QUERY: SELECT DISTINCT ?lake (strdf:area(?lakeWKT) AS ?area) WHERE { ?lake rdf:type y2geoo:OSM_lake; geo:hasGeometry ?lakeGeo. ?lakeGeo geo:asWKT ?lakeWKT. FILTER (strdf:within(?lakeWKT, yago:England)) } ORDER BY (?area) LIMIT 1\nMaterialize failed: {\"timestamp\":\"2024-09-13T17:25:59.442+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\nURI: 6\nPLAIN: 7\n17\nURI QUERY: ASK { yago:Doolin geo:hasGeometry ?geo1 . yago:Dublin geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(strdf:below(?geoWKT1, ?geoWKT2)) }\nPLAIN QUERY: ASK { <http://yago-knowledge.org/resource/Doolin> geo:hasGeometry ?geo1 . <http://yago-knowledge.org/resource/Dublin> geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(strdf:below(?geoWKT1, ?geoWKT2)) }\nURI: 7\nPLAIN: 8\n18\nURI QUERY: ASK { yago:Dublin geo:hasGeometry ?geo1 . yago:Arklow geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?wkt1 . ?geo2 geo:asWKT ?wkt2 . FILTER(geof:sfDistance(?wkt1, ?wkt2) > 10000) }\nPLAIN QUERY: ASK { yago:Dublin geo:hasGeometry ?geo1 . yago:Arklow geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?wkt1 . ?geo2 geo:asWKT ?wkt2 . FILTER (geof:sfDistance(?wkt1, ?wkt2) > 10000) }\nHTTP error (most likely invalid query)\nHTTP error (most likely invalid query)\n19\nURI QUERY: SELECT DISTINCT ?bay WHERE { yago:Dublin geo:hasGeometry ?dublinGeo . ?dublinGeo geo:asWKT ?dublinWKT . ?park rdf:type y2geoo:OSM_park . ?park geo:hasGeometry ?parkGeo . ?parkGeo geo:asWKT ?parkWKT . ?bay rdf:type y2geoo:OSM_bay . ?bay geo:hasGeometry ?bayGeo . ?bayGeo geo:asWKT ?bayWKT . FILTER (geof:sfEast(?bayWKT, ?parkWKT)) }\nPLAIN QUERY: SELECT DISTINCT ?bay WHERE { yago:Dublin geo:hasGeometry ?dgeo . ?dgeo geo:asWKT ?dWKT . ?bay rdf:type y2geoo:OSM_bay . ?bay geo:hasGeometry ?bgeo . ?bgeo geo:asWKT ?bWKT . ?park rdf:type y2geoo:OSM_park . ?park geo:hasGeometry ?pgeo . ?pgeo geo:asWKT ?pWKT . FILTER (strdf:within(?bWKT, ?dWKT) && strdf:east(?bWKT, ?pWKT)) }\nHTTP error (most likely invalid query)\nPLAIN: 8\n20\nURI QUERY: ASK { yago:Kent geo:hasGeometry ?geoKent . yago:Norfolk geo:hasGeometry ?geoNorfolk . ?geoKent geo:asWKT ?wktKent . ?geoNorfolk geo:asWKT ?wktNorfolk . FILTER(strdf:leftOf(?wktNorfolk, ?wktKent)) }\nPLAIN QUERY: ASK { <http://yago-knowledge.org/resource/Kent> geo:hasGeometry ?geo1 . <http://yago-knowledge.org/resource/Norfolk> geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(strdf:west(?geoWKT1, ?geoWKT2)) }\nHTTP error (most likely invalid query)\nHTTP error (most likely invalid query)\n21\nURI QUERY: ASK { yago:Essex geo:hasGeometry ?geo1 . yago:Hertfordshire geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?wkt1 . ?geo2 geo:asWKT ?wkt2 . FILTER(strdf:touches(?wkt1, ?wkt2)) }\nPLAIN QUERY: ASK { yago:Essex geo:hasGeometry ?egeo . yago:Hertfordshire geo:hasGeometry ?hgeo . ?egeo geo:asWKT ?eWKT . ?hgeo geo:asWKT ?hWKT . FILTER (strdf:touches(?eWKT, ?hWKT)) }\nURI: 8\nPLAIN: 9\n22\nURI QUERY: SELECT DISTINCT ?forest WHERE { ?barony rdf:type y2geoo:OSI_Barony; geo:hasGeometry ?baronyGeo. ?baronyGeo geo:asWKT ?baronyWKT. ?forest rdf:type y2geoo:OSM_forest; geo:hasGeometry ?forestGeo. ?forestGeo geo:asWKT ?forestWKT. FILTER(geof:sfWithin(?forestWKT, ?baronyWKT)) }\nPLAIN QUERY: SELECT DISTINCT ?forest WHERE { ?barony rdf:type y2geoo:OSM_Baronies; geo:hasGeometry ?baronyGeo. ?baronyGeo geo:asWKT ?baronyWKT. ?forest rdf:type y2geoo:OSM_forest; geo:hasGeometry ?forestGeo. ?forestGeo geo:asWKT ?forestWKT. FILTER (geof:sfWithin(?forestWKT, ?baronyWKT)) }\nURI: 9\nPLAIN: 9\n23\nURI QUERY: SELECT (COUNT(DISTINCT ?city) AS ?count) WHERE { \n  yago:Wales geo:hasGeometry ?walesGeo . \n  ?city rdf:type y2geoo:OSM_city ; geo:hasGeometry ?cityGeo . \n  ?cityGeo geo:asWKT ?cityWKT . \n  ?stream rdf:type y2geoo:OSM_stream ; geo:hasGeometry ?streamGeo . \n  ?streamGeo geo:asWKT ?streamWKT . \n  FILTER(geof:sfNorth(?cityWKT, ?streamWKT)) \n}\nPLAIN QUERY: SELECT (COUNT(DISTINCT ?city) AS ?cityCount) WHERE { ?city rdf:type y2geoo:OSM_city; geo:hasGeometry ?cityGeo. ?stream rdf:type y2geoo:OSM_stream; geo:hasGeometry ?streamGeo. ?cityGeo geo:asWKT ?cityWKT. ?streamGeo geo:asWKT ?streamWKT. FILTER(geof:sfNorthOf(?cityWKT, ?streamWKT) && strdf:within(?cityWKT, <http://yago-knowledge.org/resource/Wales>)) }\nHTTP error (most likely invalid query)\nMaterialize failed: {\"timestamp\":\"2024-09-13T17:26:56.230+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\nHTTP error (most likely invalid query)\n24\nURI QUERY: SELECT DISTINCT ?stream WHERE { yago:County_Longford geo:hasGeometry ?longfordGeo . ?county rdf:type y2geoo:OS_County . ?county geo:hasGeometry ?countyGeo . ?stream rdf:type y2geoo:OSM_stream . ?stream geo:hasGeometry ?streamGeo . FILTER(strdf:touches(?longfordGeo, ?countyGeo) && geof:sfIntersects(?streamGeo, ?countyGeo)) }\nPLAIN QUERY: SELECT DISTINCT ?stream WHERE { ?county rdf:type y2geoo:GAG_County . ?county geo:hasGeometry ?countyGeo . ?county geo:touches ?longfordCounty . ?longfordCounty rdf:type y2geoo:GAG_County . ?stream rdf:type y2geoo:OSM_stream ; geo:hasGeometry ?streamGeo . ?streamGeo geo:asWKT ?streamWKT . ?countyGeo geo:asWKT ?countyWKT . FILTER(geof:sfIntersects(?streamWKT, ?countyWKT)) }\nURI: 9\nPLAIN: 9\n25\nURI QUERY: ASK { yago:Athens geo:hasGeometry ?geo1 . yago:Manchester geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(strdf:below(?geoWKT1, ?geoWKT2)) }\nPLAIN QUERY: ASK { <http://yago-knowledge.org/resource/Athens> geo:hasGeometry ?geo1 . <http://yago-knowledge.org/resource/Manchester> geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(strdf:below(?geoWKT1, ?geoWKT2)) }\nURI: 9\nPLAIN: 9\n26\nURI QUERY: SELECT (COUNT(DISTINCT ?stream) as ?numStreams) WHERE { yago:Oxford geo:hasGeometry ?oxfordGeo . ?natureReserve rdf:type y2geoo:OSM_nature_reserve; geo:hasGeometry ?nrGeo . ?stream rdf:type y2geoo:OSM_stream; geo:hasGeometry ?streamGeo . ?oxfordGeo geo:asWKT ?oxfordWKT . ?nrGeo geo:asWKT ?nrWKT . ?streamGeo geo:asWKT ?streamWKT . FILTER(geof:sfCrosses(?streamWKT, ?nrWKT)) }\nPLAIN QUERY: SELECT (COUNT(DISTINCT ?stream) AS ?streamCount) WHERE { ?stream rdf:type y2geoo:OSM_stream; geo:hasGeometry ?streamGeo. ?natureReserve rdf:type y2geoo:OSM_nature_reserve; geo:hasGeometry ?reserveGeo. ?streamGeo geo:asWKT ?streamWKT. ?reserveGeo geo:asWKT ?reserveWKT. FILTER(geof:sfCrosses(?streamWKT, ?reserveWKT)) }\nURI: 9\nPLAIN: 9\n27\nURI QUERY: SELECT DISTINCT ?municipality WHERE { ?municipality rdf:type y2geoo:GAG_Municipality; geo:hasGeometry ?mgeo. ?mgeo geo:asWKT ?mWKT. ?municipality yago:hasPopulation ?population. ?municipality geo:contains ?park. ?park rdf:type y2geoo:OSM_park. FILTER(?population < 50000 && strdf:within(?mWKT, ?regionWKT)) }\nPLAIN QUERY: SELECT DISTINCT ?municipality WHERE { ?municipality rdf:type y2geoo:GAG_Municipality; yago:hasPopulation ?population; geo:hasGeometry ?geom. ?geom geo:asWKT ?gWKT. ?park rdf:type y2geoo:OSM_park; geo:hasGeometry ?pgeom. ?pgeom geo:asWKT ?pWKT. FILTER(?population < 50000 && geof:sfIntersects(?gWKT, ?pWKT)) }\nMaterialize failed: {\"timestamp\":\"2024-09-13T17:27:12.218+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\nURI: 9\nPLAIN: 9\n28\nURI QUERY: SELECT (SUM(strdf:area(?geoWKT)) as ?totalArea) WHERE { yago:Andover_Massachusetts geo:hasGeometry ?geom . ?geom geo:asWKT ?geoWKT . ?pond rdf:type y2geoo:OSM_pond . ?pond geo:hasGeometry ?pondGeo . ?pondGeo geo:asWKT ?pondWKT . FILTER(geof:sfContains(?geoWKT, ?pondWKT)) }\nPLAIN QUERY: SELECT (SUM(strdf:area(?lWKT)) as ?totalArea) WHERE { yago:Andover_Ponds geo:hasGeometry ?geom . ?geom geo:asWKT ?lWKT . }\nURI: 9\nPLAIN: 9\n29\nURI QUERY: SELECT DISTINCT ?beach WHERE { yago:Athens geo:hasGeometry ?aGeo . ?beach rdf:type y2geoo:OSM_beach . ?beach geo:hasGeometry ?bGeo . ?aGeo geo:asWKT ?aWKT . ?bGeo geo:asWKT ?bWKT . FILTER (geof:sfDistance(?aWKT, ?bWKT) <= 100000) }\nPLAIN QUERY: SELECT DISTINCT ?beach WHERE { ?beach rdf:type y2geoo:OSM_beach; geo:hasGeometry ?bgeo. ?bgeo geo:asWKT ?bWKT. yago:Athens geo:hasGeometry ?ageo. ?ageo geo:asWKT ?aWKT. FILTER(geof:sfDistance(?bWKT, ?aWKT) <= 100000) }\nURI: 9\nPLAIN: 9\n30\nURI QUERY: SELECT ?location WHERE { yago:Texas geo:hasGeometry ?geo . ?geo geo:asWKT ?location }\nPLAIN QUERY: SELECT ?location WHERE { yago:Texas geo:hasGeometry ?geo . ?geo geo:asWKT ?location }\nURI: 10\nPLAIN: 10\n31\nURI QUERY: SELECT ?university WHERE { yago:Athlone rdf:type y2geoo:GAG_Municipality . ?university rdf:type y2geoo:University . ?university geo:locatedIn yago:Athlone . }\nPLAIN QUERY: SELECT ?university WHERE { yago:Athlone geo:hasUniversity ?university }\nURI: 10\nPLAIN: 10\n32\nURI QUERY: ASK { yago:Norilsk geo:hasGeometry ?geo1 . yago:Dublin geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(strdf:above(?geoWKT1, ?geoWKT2)) }\nPLAIN QUERY: ASK { <http://yago-knowledge.org/resource/Norilsk> geo:hasGeometry ?geo1 . <http://yago-knowledge.org/resource/Dublin> geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(strdf:above(?geoWKT1, ?geoWKT2)) }\nURI: 11\nPLAIN: 11\n33\nURI QUERY: SELECT (SUM(?woodland_area) AS ?totalWoodland) WHERE { yago:United_Kingdom geo:hasGeometry ?ukgeo . ?forest rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?forestgeo . ?forestgeo geo:asWKT ?forestWKT . ?forest geo:hasArea ?woodland_area . FILTER(geof:sfContains(?ukgeo, ?forestWKT)) }\nPLAIN QUERY: SELECT (SUM(strdf:area(?geoWKT)) as ?woodlandArea) WHERE { ?forest rdf:type y2geoo:OSM_woodland; geo:hasGeometry ?geo . ?geo geo:asWKT ?geoWKT . FILTER(geof:sfWithin(?geoWKT, ?ukWKT)) }\nMaterialize failed: {\"timestamp\":\"2024-09-13T17:27:57.431+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\nURI: 11\nPLAIN: 11\n34\nURI QUERY: SELECT ?bridge WHERE { ?bridge rdf:type y2geoo:OSM_bridge . ?bridge yago:isLocatedIn yago:Ireland . ?bridge yago:dateOpened ?date . } ORDER BY ?date LIMIT 2\nPLAIN QUERY: SELECT ?bridge WHERE { ?bridge rdf:type y2geoo:OSM_bridge; geo:hasGeometry ?bridgegeo. ?bridgegeo geo:asWKT ?bridgeWKT. } ORDER BY DESC(?bridge:date) LIMIT 2\nMaterialize failed: {\"timestamp\":\"2024-09-13T17:28:03.704+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\nHTTP error (most likely invalid query)\nURI: 11\n35\nURI QUERY: SELECT ?location WHERE { yago:Kilkenny geo:hasGeometry ?geo . ?geo geo:asWKT ?location . }\nPLAIN QUERY: SELECT ?location WHERE { yago:Kilkenny geo:hasGeometry ?geo . ?geo geo:asWKT ?location }\nURI: 11\nPLAIN: 11\n36\nURI QUERY: ASK { yago:England geo:hasGeometry ?geo1 . yago:Greece geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(strdf:west(?geoWKT1, ?geoWKT2)) }\nPLAIN QUERY: ASK { <http://yago-knowledge.org/resource/England> geo:hasGeometry ?geo1 . <http://yago-knowledge.org/resource/Greece> geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(strdf:west(?geoWKT1, ?geoWKT2)) }\nHTTP error (most likely invalid query)\nHTTP error (most likely invalid query)\n37\nURI QUERY: SELECT (COUNT(DISTINCT ?county) as ?countyCount) WHERE { ?county rdf:type y2geoo:OS_County. ?county geo:hasGeometry ?countyGeo. yago:Texas geo:hasGeometry ?texasGeo. ?countyGeo geo:asWKT ?countyWKT. ?texasGeo geo:asWKT ?texasWKT. FILTER(geof:sfWithin(?countyWKT, ?texasWKT)) }\nPLAIN QUERY: SELECT (COUNT(DISTINCT ?county) as ?counties) WHERE { ?county rdf:type y2geoo:County; geo:hasGeometry ?geo. ?geo geo:asWKT ?wkt. FILTER (strdf:within(?wkt, yago:Texas)) }\nMaterialize failed: {\"timestamp\":\"2024-09-13T17:28:15.689+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\nURI: 11\nPLAIN: 11\n38\nURI QUERY: SELECT ?location WHERE { yago:Lake_Kerkini geo:hasGeometry ?geo . ?geo geo:asWKT ?locationWKT . ?location rdf:type y2geoo:OSM_lake . ?location geo:hasGeometry ?locationGeo . ?locationGeo geo:asWKT ?locationWKT . }\nPLAIN QUERY: SELECT ?location WHERE { yago:Lake_Kerkini geo:hasGeometry ?geom . ?geom geo:asWKT ?location }\nURI: 11\nPLAIN: 12\n39\nURI QUERY: SELECT (COUNT(DISTINCT ?v1) as ?villageCount) WHERE { ?v1 rdf:type y2geoo:OSM_village; geo:hasGeometry ?v1geo. ?v2 rdf:type y2geoo:OSM_village; geo:hasGeometry ?v2geo. FILTER(geof:sfTouches(?v1WKT, ?v2WKT)) }\nPLAIN QUERY: SELECT (COUNT(DISTINCT ?v1) as ?villageCount) WHERE { ?v1 rdf:type y2geoo:OSM_village; geo:hasGeometry ?v1geo. ?v1geo geo:asWKT ?v1WKT. ?v2 rdf:type y2geoo:OSM_village; geo:hasGeometry ?v2geo. ?v2geo geo:asWKT ?v2WKT. FILTER(geof:sfTouches(?v1WKT, ?v2WKT) && ?v1 != ?v2) }\nMaterialize failed: {\"timestamp\":\"2024-09-13T17:28:23.648+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\nURI: 11\nPLAIN: 12\n40\nURI QUERY: SELECT (COUNT(DISTINCT ?park) as ?parkCount) WHERE { ?county rdf:type y2geoo:OS_County . ?park rdf:type y2geoo:OSM_park . ?park geo:hasGeometry ?parkGeo . ?county geo:hasGeometry ?countyGeo . FILTER(geof:sfWithin(?parkGeo, ?countyGeo)) }\nPLAIN QUERY: SELECT (COUNT(DISTINCT ?park) AS ?parkCount) WHERE { ?park rdf:type y2geoo:OSM_park . ?county rdf:type y2geoo:OSM_county . ?park geo:hasGeometry ?parkGeo . ?county geo:hasGeometry ?countyGeo . FILTER(geof:sfWithin(?parkGeo, ?countyGeo)) }\nURI: 12\nPLAIN: 12\n41\nURI QUERY: SELECT (COUNT(DISTINCT ?city) as ?cityCount) WHERE { ?city rdf:type y2geoo:OSM_city; geo:hasGeometry ?cityGeo. ?cityGeo geo:asWKT ?cityWKT. ?bay rdf:type y2geoo:OSM_bay; geo:hasGeometry ?bayGeo. ?bayGeo geo:asWKT ?bayWKT. FILTER(geof:sfIntersects(?cityWKT, ?bayWKT)) }\nPLAIN QUERY: SELECT (COUNT(DISTINCT ?city) AS ?cityCount) WHERE { ?city rdf:type y2geoo:OSM_city; geo:hasGeometry ?cityGeo. ?bay rdf:type y2geoo:OSM_bay; geo:hasGeometry ?bayGeo. FILTER(geof:sfIntersects(?cityGeo, ?bayGeo)) }\nURI: 12\nPLAIN: 12\n42\nURI QUERY: SELECT DISTINCT ?locality WHERE { ?locality rdf:type y2geoo:OSM_locality; geo:hasGeometry ?localityGeo. ?lake rdf:type y2geoo:OSM_lake; geo:hasGeometry ?lakeGeo. FILTER(geof:sfAdjacent(?localityGeo, ?lakeGeo)) }\nPLAIN QUERY: SELECT DISTINCT ?locality WHERE { ?locality rdf:type y2geoo:OSM_locality; geo:hasGeometry ?lgeo. ?lake rdf:type y2geoo:OSM_lake; geo:hasGeometry ?lakegeo. FILTER(geof:sfTouches(?lgeo, ?lakegeo)) }\nHTTP error (most likely invalid query)\nPLAIN: 13\n43\nURI QUERY: SELECT (COUNT(DISTINCT ?river) as ?riverCount) WHERE { ?island rdf:type y2geoo:OSM_island; geo:hasGeometry ?islandGeo. ?river rdf:type y2geoo:OSM_river; geo:hasGeometry ?riverGeo. FILTER(geof:sfContains(?islandGeo, ?riverGeo)) }\nPLAIN QUERY: SELECT (COUNT(DISTINCT ?river) AS ?riverCount) WHERE { ?island rdf:type y2geoo:OSM_island; geo:hasGeometry ?islandGeo. ?islandGeo geo:asWKT ?islandWKT. ?river rdf:type y2geoo:OSM_river; geo:hasGeometry ?riverGeo. ?riverGeo geo:asWKT ?riverWKT. FILTER(geof:sfContains(?islandWKT, ?riverWKT)) }\nURI: 12\nPLAIN: 13\n44\nURI QUERY: ASK { yago:Chania geo:hasGeometry ?geo1 . yago:Athens geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(strdf:rightOf(?geoWKT1, ?geoWKT2)) }\nPLAIN QUERY: ASK { <http://yago-knowledge.org/resource/Chania> geo:hasGeometry ?geo1 . <http://yago-knowledge.org/resource/Athens> geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(strdf:rightOf(?geoWKT1, ?geoWKT2)) }\nURI: 12\nPLAIN: 13\n45\nURI QUERY: SELECT (strdf:area(?geoWKT) as ?area) WHERE { yago:West_Sussex geo:hasGeometry ?geom . ?geom geo:asWKT ?geoWKT . }\nPLAIN QUERY: SELECT (strdf:area(?areaWKT) as ?area) WHERE { yago:West_Sussex geo:hasGeometry ?geom . ?geom geo:asWKT ?areaWKT . }\nURI: 13\nPLAIN: 14\n46\nURI QUERY: SELECT DISTINCT ?ward (strdf:area(?wardWKT) as ?area) WHERE { yago:Plymouth geo:hasGeometry ?pgeo . ?pgeo geo:asWKT ?pWKT . ?ward rdf:type y2geoo:OS_DistrictWard . ?ward geo:hasGeometry ?wardgeo . ?wardgeo geo:asWKT ?wardWKT . FILTER (geof:sfIntersects(?pWKT, ?wardWKT)) } ORDER BY DESC(?area) LIMIT 3\nPLAIN QUERY: SELECT DISTINCT ?ward (strdf:area(?wardWKT) as ?area) WHERE { ?ward rdf:type y2geoo:GAG_DistrictWard; geo:hasGeometry ?wardGeo. ?wardGeo geo:asWKT ?wardWKT. yago:Plymouth geo:hasGeometry ?plymouthGeo. ?plymouthGeo geo:asWKT ?plymouthWKT. FILTER(geof:sfIntersects(?wardWKT, ?plymouthWKT)) } ORDER BY DESC(?area) LIMIT 3\nURI: 14\nPLAIN: 14\n47\nURI QUERY: SELECT DISTINCT ?state (strdf:area(?stateWKT) AS ?area) WHERE { ?state rdf:type y2geoo:NBD_State . ?state geo:hasGeometry ?stateGeo . ?stateGeo geo:asWKT ?stateWKT . } ORDER BY DESC(?area) LIMIT 1\nPLAIN QUERY: SELECT DISTINCT ?state (strdf:area(?stateWKT) as ?area) WHERE { ?state rdf:type y2geoo:OSM_state; geo:hasGeometry ?stateGeo. ?stateGeo geo:asWKT ?stateWKT. } ORDER BY (?area) LIMIT 1\nURI: 14\nPLAIN: 14\n48\nURI QUERY: SELECT (COUNT(DISTINCT ?town) as ?town_count) WHERE { ?town rdf:type y2geoo:OSM_town; yago:hasPopulation ?population. FILTER(?population >= 5000 && ?population <= 10000) . ?town geo:hasGeometry ?geom . ?geom geo:asWKT ?wkt . FILTER(geof:sfWithin(?wkt, yago:Norfolk)) }\nPLAIN QUERY: SELECT (COUNT(DISTINCT ?town) as ?townCount) WHERE { ?town rdf:type y2geoo:GAG_Town; yago:hasPopulation ?population. FILTER(?population >= 5000 && ?population <= 10000) . ?town geo:hasGeometry ?geom . ?geom geo:within yago:Norfolk }\nMaterialize failed: {\"timestamp\":\"2024-09-13T17:29:12.664+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\nURI: 14\nPLAIN: 14\n49\nURI QUERY: SELECT distinct ?lake (strdf:area(?lakeWKT) as ?area) WHERE { ?lake rdf:type y2geoo:OSM_lake . ?lake geo:hasGeometry ?lakeGeo . ?lakeGeo geo:asWKT ?lakeWKT . FILTER (geof:sfWithin(?lakeWKT, ?regionWKT)) } ORDER BY (?area) LIMIT 1\nPLAIN QUERY: SELECT DISTINCT ?lake (strdf:area(?lWKT) as ?area) WHERE { yago:Thessaloniki geo:hasGeometry ?tgeo1 . ?tgeo1 geo:asWKT ?thessalonikiWKT . yago:Athens geo:hasGeometry ?tgeo2 . ?tgeo2 geo:asWKT ?athensWKT . ?lake rdf:type y2geoo:OSM_lake . ?lake geo:hasGeometry ?geol . ?geol geo:asWKT ?lWKT . FILTER (geof:sfContains(?thessalonikiWKT, ?lWKT) && strdf:below(?lWKT,\nMaterialize failed: {\"timestamp\":\"2024-09-13T17:29:17.440+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\nMaterialize failed: {\"timestamp\":\"2024-09-13T17:29:18.231+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\nHTTP error (most likely invalid query)\nURI: 14\n50\nURI QUERY: SELECT ?state WHERE { yago:Key_Largo geo:isLocatedIn ?state . ?state rdf:type y2geoo:NBD_State }\nPLAIN QUERY: SELECT ?state WHERE { yago:Key_Largo geo:hasGeometry ?keyLargoGeo . ?state rdf:type y2geoo:USA_State . ?state geo:hasGeometry ?stateGeo . FILTER (geof:sfContains(?stateGeo, ?keyLargoGeo)) }\nURI: 14\nPLAIN: 14\n51\nURI QUERY: SELECT DISTINCT ?bay WHERE { yago:Greece geo:hasGeometry ?greeceGeo . ?greeceGeo geo:asWKT ?greeceWKT . ?reservoir rdf:type y2geoo:OSM_reservoir . ?reservoir geo:hasGeometry ?reservoirGeo . ?reservoirGeo geo:asWKT ?reservoirWKT . ?bay rdf:type y2geoo:OSM_bay . ?bay geo:hasGeometry ?bayGeo . ?bayGeo geo:asWKT ?bayWKT . FILTER (geof:sfEastOf(?bayWKT, ?reservoirWKT) && geof:sfWithin(?reservoirWKT, ?greeceW\nPLAIN QUERY: SELECT DISTINCT ?bay WHERE { ?reservoir rdf:type y2geoo:OSM_reservoir; geo:hasGeometry ?rgeo. ?rgeo geo:asWKT ?rWKT. ?bay rdf:type y2geoo:OSM_bay; geo:hasGeometry ?bgeo. ?bgeo geo:asWKT ?bWKT. FILTER(geof:sfEastOf(?bWKT, ?rWKT)) }\nMaterialize failed: {\"timestamp\":\"2024-09-13T17:30:18.768+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\nHTTP error (most likely invalid query)\nHTTP error (most likely invalid query)\n52\nURI QUERY: SELECT ?region (xsd:integer(?population) as ?pop) WHERE { ?region rdf:type y2geoo:GAG_Region . ?region yago:hasPopulation ?population . FILTER(strdf:within(?region, yago:Greece)) } ORDER BY DESC(?pop) LIMIT 1\nPLAIN QUERY: SELECT ?region (xsd:integer(?population) as ?pop) WHERE { ?region rdf:type y2geoo:Region_of_Greece; yago:hasPopulation ?population. } ORDER BY DESC(?pop) LIMIT 1\nMaterialize failed: {\"timestamp\":\"2024-09-13T17:30:22.292+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\nURI: 14\nPLAIN: 14\n53\nURI QUERY: ASK { yago:Norilsk geo:hasGeometry ?geo1 . yago:Dublin geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(strdf:above(?geoWKT1, ?geoWKT2)) }\nPLAIN QUERY: ASK { <http://yago-knowledge.org/resource/Norilsk> geo:hasGeometry ?geo1 . <http://yago-knowledge.org/resource/Dublin> geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(strdf:above(?geoWKT1, ?geoWKT2)) }\nURI: 15\nPLAIN: 15\n54\nURI QUERY: ASK { yago:Sennen_Cove_Beach geo:hasGeometry ?geo1 . yago:Helston geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(strdf:rightOf(?geoWKT1, ?geoWKT2)) }\nPLAIN QUERY: ASK { <http://yago-knowledge.org/resource/Sennen_Cove> geo:hasGeometry ?geo1 . <http://yago-knowledge.org/resource/Helston> geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(strdf:rightOf(?geoWKT1, ?geoWKT2)) }\nHTTP error (most likely invalid query)\nURI: 16\n55\nURI QUERY: SELECT DISTINCT ?forest WHERE { yago:Illinois geo:hasGeometry ?illinoisGeo . ?forest rdf:type y2geoo:OSM_forest; geo:hasGeometry ?forestGeo. ?village rdf:type y2geoo:OSM_village; geo:hasGeometry ?villageGeo. FILTER(geof:sfIntersects(?forestGeo, ?villageGeo)) }\nPLAIN QUERY: SELECT DISTINCT ?forest WHERE { yago:Illinois geo:hasGeometry ?geoIllinois . ?forest rdf:type y2geoo:OSM_forest; geo:hasGeometry ?forestGeo . ?village rdf:type y2geoo:OSM_village; geo:hasGeometry ?villageGeo . FILTER(geof:sfIntersects(?forestGeo, ?villageGeo)) }\nURI: 16\nPLAIN: 15\n56\nURI QUERY: SELECT (xsd:integer(?population) as ?pop) WHERE { yago:Gravia yago:hasPopulation ?population. }\nPLAIN QUERY: SELECT (xsd:integer(?population) as ?pop) WHERE { yago:Gravia yago:'hasPopulation ?population. }\nMaterialize failed: {\"timestamp\":\"2024-09-13T17:30:40.284+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\nHTTP error (most likely invalid query)\nURI: 17\n57\nURI QUERY: SELECT (COUNT(DISTINCT ?state) as ?numStates) WHERE { ?hotel rdf:type y2geoo:Intercontinental_Hotel . ?hotel geo:hasGeometry ?hotelGeo . ?state rdf:type y2geoo:NBD_State . ?state geo:hasGeometry ?stateGeo . FILTER(geof:sfIntersects(?hotelGeo, ?stateGeo)) }\nPLAIN QUERY: SELECT (COUNT(DISTINCT ?state) AS ?count) WHERE { ?hotel rdf:type y2geoo:Intercontinental_Hotel . ?hotel geo:locatedIn ?state . }\nURI: 17\nPLAIN: 15\n58\nURI QUERY: SELECT (COUNT(DISTINCT ?bay) as ?numberOfBays) WHERE { ?bay rdf:type y2geoo:OSM_bay; geo:hasGeometry ?bayGeo. ?village rdf:type y2geoo:OSM_village; geo:hasGeometry ?villageGeo. FILTER(geof:sfAdjacent(?bayGeo, ?villageGeo)) }\nPLAIN QUERY: SELECT (COUNT(DISTINCT ?bay) as ?bayCount) WHERE { ?bay rdf:type y2geoo:OSM_bay; geo:hasGeometry ?bayGeo. ?village rdf:type y2geoo:OSM_village; geo:hasGeometry ?villageGeo. ?bayGeo geo:asWKT ?bayWKT. ?villageGeo geo:asWKT ?villageWKT. FILTER(geof:sfAdjacent(?bayWKT, ?villageWKT)) }\nHTTP error (most likely invalid query)\nHTTP error (most likely invalid query)\n59\nURI QUERY: SELECT DISTINCT ?park WHERE { ?park rdf:type y2geoo:OSM_park . ?park geo:hasGeometry ?geo . ?geo geo:asWKT ?wkt . FILTER(geof:sfWithin(?wkt, ?liverpoolArea)) }\nPLAIN QUERY: SELECT DISTINCT ?park WHERE { ?park rdf:type y2geoo:OSM_park . ?park geo:hasGeometry ?geo . ?geo geo:asWKT ?wkt . FILTER (geof:sfWithin(?wkt, yago:Liverpool_geo)) }\nMaterialize failed: {\"timestamp\":\"2024-09-13T17:30:50.873+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\nMaterialize failed: {\"timestamp\":\"2024-09-13T17:30:51.820+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\nURI: 17\nPLAIN: 15\n60\nURI QUERY: SELECT DISTINCT ?lake WHERE { ?lake rdf:type y2geoo:OSM_lake; geo:hasGeometry ?lakeGeo. ?barony rdf:type y2geoo:OSI_Barony; geo:hasGeometry ?baronyGeo. FILTER(geof:sfWithin(?lakeGeo, ?baronyGeo)) }\nPLAIN QUERY: SELECT DISTINCT ?lake WHERE { ?lake rdf:type y2geoo:OSM_lake; geo:hasGeometry ?lakeGeo. ?barony rdf:type y2geoo:Irish_Barony; geo:hasGeometry ?baronyGeo. ?lakeGeo geo:asWKT ?lakeWKT. ?baronyGeo geo:asWKT ?baronyWKT. FILTER (geof:sfWithin(?lakeWKT, ?baronyWKT)) }\nURI: 18\nPLAIN: 15\n61\nURI QUERY: SELECT ?location WHERE { yago:Southampton geo:hasGeometry ?geom . ?geom geo:asWKT ?location . }\nPLAIN QUERY: SELECT ?location WHERE { yago:Southampton geo:hasGeometry ?geom . ?geom geo:asWKT ?location }\nURI: 19\nPLAIN: 16\n62\nURI QUERY: SELECT DISTINCT ?church WHERE { yago:New_York_City geo:hasGeometry ?geo . ?church rdf:type y2geoo:OSM_church . ?church geo:hasGeometry ?churchGeo . FILTER(geof:sfWithin(?churchGeo, ?geo)) }\nPLAIN QUERY: SELECT DISTINCT ?church WHERE { ?church rdf:type y2geoo:OSM_church; geo:hasGeometry ?geo. ?geo geo:asWKT ?wkt. FILTER (geof:sfWithin(?wkt, yago:New_York_City)) }\nMaterialize failed: {\"timestamp\":\"2024-09-13T17:31:09.022+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\nURI: 19\nPLAIN: 16\n63\nURI QUERY: SELECT ?length WHERE { yago:Loch_Awe yago:hasLength ?length }\nPLAIN QUERY: SELECT (strdf:length(?geoWKT) as ?length) WHERE { yago:Loch_Awe geo:hasGeometry ?geom . ?geom geo:asWKT ?geoWKT . }\nURI: 20\nPLAIN: 16\n64\nURI QUERY: ASK { yago:Plymouth geo:hasGeometry ?geo1 . yago:Cardiff geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(geof:sfWithin(?geoWKT1, ?geoWKT2) || geof:sfWithin(?geoWKT2, ?geoWKT1)) }\nPLAIN QUERY: ASK { <http://yago-knowledge.org/resource/Plymouth> geo:hasGeometry ?geo1 . <http://yago-knowledge.org/resource/Cardiff> geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(geof:sfWithin(?geoWKT1, ?geoWKT2) || geof:sfWithin(?geoWKT2, ?geoWKT1)) }\nURI: 21\nPLAIN: 17\n65\nURI QUERY: ASK { yago:Belfast geo:hasGeometry ?geo1 . yago:London geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(strdf:leftOf(?geoWKT1, ?geoWKT2)) }\nPLAIN QUERY: ASK { <http://yago-knowledge.org/resource/Belfast> geo:hasGeometry ?geo1 . <http://yago-knowledge.org/resource/London> geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(strdf:leftOf(?geoWKT1, ?geoWKT2)) }\nURI: 22\nPLAIN: 18\n66\nURI QUERY: ASK { yago:Sfakia rdf:type yago:Scotland . }\nPLAIN QUERY: ASK { yago:Sfakia rdf:type y2geoo:Location . yago:Scotland rdf:type y2geoo:Region . FILTER (strdf:within(?sfakiaGeo, ?scotlandGeo)) }\nMaterialize failed: {\"timestamp\":\"2024-09-13T17:31:23.676+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\nURI: 23\nPLAIN: 19\n67\nURI QUERY: SELECT ?latitude ?longitude WHERE { yago:New_York_City geo:hasGeometry ?geo . ?geo geo:asWKT ?wkt . BIND(geof:latitude(?wkt) AS ?latitude) . BIND(geof:longitude(?wkt) AS ?longitude) }\nPLAIN QUERY: SELECT ?latitude ?longitude WHERE { yago:New_York_City geo:hasGeometry ?geometry . ?geometry geo:asWKT ?wkt . BIND(geof:lat(?wkt) AS ?latitude) . BIND(geof:long(?wkt) AS ?longitude) }\nHTTP error (most likely invalid query)\nHTTP error (most likely invalid query)\n68\nURI QUERY: \nSELECT DISTINCT ?county (strdf:area(?countyWKT) as ?area) WHERE { \n  ?county rdf:type y2geoo:OS_County; \n  geo:hasGeometry ?countyGeo. \n  ?countyGeo geo:asWKT ?countyWKT. \n} ORDER BY (?area) LIMIT 2\n\nPLAIN QUERY: SELECT ?county (strdf:area(?geom) as ?area) WHERE { ?county rdf:type y2geoo:GAG_County . ?county geo:hasGeometry ?geom . } ORDER BY ?area LIMIT 2\nURI: 23\nPLAIN: 19\n69\nURI QUERY: SELECT ?county (xsd:integer(?population) as ?pop) WHERE { ?county rdf:type y2geoo:OS_County . ?county yago:hasPopulation ?population . ?county yago:isPartOf yago:Kansas . } ORDER BY ?pop LIMIT 1\nPLAIN QUERY: SELECT DISTINCT ?county (xsd:integer(?population) as ?pop) WHERE { ?county rdf:type y2geoo:GAG_County; yago:hasPopulation ?population. FILTER (strdf:within(?county, yago:Kansas)) } ORDER BY ?pop LIMIT 1\nMaterialize failed: {\"timestamp\":\"2024-09-13T17:31:36.626+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\nURI: 23\nPLAIN: 19\n70\nURI QUERY: SELECT ?municipality WHERE { ?municipality rdf:type y2geoo:GAG_Municipality . ?municipality yago:hasPopulation ?population . FILTER(?population < 30000) }\nPLAIN QUERY: SELECT DISTINCT ?municipality WHERE { ?municipality rdf:type y2geoo:GAG_Municipality; yago:hasPopulation ?population. FILTER(?population < 30000) }\nURI: 23\nPLAIN: 19\n71\nURI QUERY: SELECT ?city (MAX(?population) as ?maxPopulation) WHERE { ?city rdf:type y2geoo:OSM_city . ?city yago:hasPopulation ?population . ?city yago:isLocatedIn yago:Missouri . } GROUP BY ?city ORDER BY DESC(?maxPopulation) LIMIT 1\nPLAIN QUERY: SELECT ?city (xsd:integer(?population) as ?pop) WHERE { ?city rdf:type y2geoo:OSM_city; yago:locatedIn yago:Missouri; yago:hasPopulation ?population. } ORDER BY DESC(?population) LIMIT 1\nURI: 24\nPLAIN: 19\n72\nURI QUERY: SELECT (xsd:integer (?population) as ?pop) WHERE { yago:Dublin yago:'hasPopulation ?population. }\nPLAIN QUERY: SELECT (xsd:integer (?population) as ?pop) WHERE { yago:Dublin yago:'hasPopulation ?population. }\nMaterialize failed: {\"timestamp\":\"2024-09-13T17:31:47.845+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\nHTTP error (most likely invalid query)\nMaterialize failed: {\"timestamp\":\"2024-09-13T17:31:48.463+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\nHTTP error (most likely invalid query)\n73\nURI QUERY: ASK { yago:Oxfordshire geo:hasGeometry ?geo1 . yago:Kent geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(geof:sfDistance(?geoWKT1, ?geoWKT2) > 100000) }\nPLAIN QUERY: ASK { <http://yago-knowledge.org/resource/Oxfordshire> geo:hasGeometry ?geo1 . <http://yago-knowledge.org/resource/Kent> geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(geof:sfDistance(?geoWKT1, ?geoWKT2) > 100000) }\nHTTP error (most likely invalid query)\nHTTP error (most likely invalid query)\n74\nURI QUERY: SELECT DISTINCT ?city (MAX(?population) as ?maxPop) WHERE { ?city rdf:type y2geoo:OSM_city . ?city yago:hasPopulation ?population . ?city yago:isPartOf y2geoo:NBD_State . FILTER (yago:NBD_State = yago:Missouri) } GROUP BY ?city ORDER BY DESC(?maxPop) LIMIT 1\nPLAIN QUERY: SELECT DISTINCT ?city (xsd:integer(?population) as ?pop) WHERE { ?city rdf:type y2geoo:OSM_city; geo:hasGeometry ?geo. ?city yago:hasPopulation ?population. FILTER (?state = yago:Missouri) } ORDER BY DESC(?pop) LIMIT 1\nURI: 24\nPLAIN: 19\n75\nURI QUERY: SELECT ?location WHERE { yago:Ullswater geo:hasGeometry ?geo . ?geo geo:asWKT ?location }\nPLAIN QUERY: SELECT ?location WHERE { yago:Ullswater geo:hasGeometry ?geo . ?geo geo:asWKT ?location . }\nURI: 25\nPLAIN: 20\n76\nURI QUERY: SELECT ?municipality (xsd:integer(?population) as ?pop) WHERE { ?municipality rdf:type y2geoo:GAG_Municipality; yago:hasPopulation ?population. } ORDER BY ?pop LIMIT 3\nPLAIN QUERY: SELECT ?municipality (xsd:integer(?population) as ?pop) WHERE { ?municipality rdf:type y2geoo:GAG_Municipality; yago:hasPopulation ?population. } ORDER BY (?pop) LIMIT 3\nURI: 25\nPLAIN: 20\n77\nURI QUERY: SELECT ?location WHERE { yago:Drogheda geo:hasGeometry ?geo . ?geo geo:asWKT ?location }\nPLAIN QUERY: SELECT ?location WHERE { yago:Drogheda geo:hasGeometry ?geo . ?geo geo:asWKT ?location }\nURI: 26\nPLAIN: 21\n78\nURI QUERY: SELECT ?island (COUNT(DISTINCT ?beach) AS ?beachCount) WHERE { ?island rdf:type y2geoo:OSM_island; geo:hasGeometry ?islandGeo. ?beach rdf:type y2geoo:OSM_beach; geo:hasGeometry ?beachGeo. FILTER(geof:sfContains(?islandGeo, ?beachGeo)) } GROUP BY ?island ORDER BY DESC(?beachCount) LIMIT 1\nPLAIN QUERY: SELECT DISTINCT ?island (COUNT(?beach) AS ?beachCount) WHERE { ?island rdf:type y2geoo:OSM_island . ?beach rdf:type y2geoo:OSM_beach . ?beach geo:hasGeometry ?beachGeo . ?island geo:hasGeometry ?islandGeo . FILTER(geof:sfContains(?islandGeo, ?beachGeo)) } GROUP BY ?island ORDER BY DESC(?beachCount) LIMIT 1\nURI: 26\nPLAIN: 21\n79\nURI QUERY: SELECT (COUNT(DISTINCT ?stream) as ?streamCount) WHERE { yago:Alabama geo:hasGeometry ?geo . ?stream rdf:type y2geoo:OSM_stream . ?stream geo:hasGeometry ?streamGeo . ?streamGeo geo:asWKT ?streamWKT . FILTER(geof:sfWithin(?streamWKT, ?geo)) }\nPLAIN QUERY: SELECT (COUNT (DISTINCT ?stream) as ?streamCount) WHERE { ?stream rdf:type y2geoo:OSM_stream; geo:hasGeometry ?geo. ?geo geo:asWKT ?wkt. FILTER (strdf:within(?wkt, yago:Alabama)) }\nMaterialize failed: {\"timestamp\":\"2024-09-13T17:32:44.646+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\nURI: 27\nPLAIN: 21\n80\nURI QUERY: ASK { yago:Howth geo:hasGeometry ?geo1 . yago:Dublin geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(geof:sfDistance(?geoWKT1, ?geoWKT2) > ?threshold) }\nPLAIN QUERY: ASK { <http://yago-knowledge.org/resource/Howth> geo:hasGeometry ?geo1 . <http://yago-knowledge.org/resource/Dublin> geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(geof:sfDistance(?geoWKT1, ?geoWKT2) > ?threshold) }\nHTTP error (most likely invalid query)\nHTTP error (most likely invalid query)\n81\nURI QUERY: SELECT DISTINCT ?reserve WHERE { yago:Ireland geo:hasGeometry ?irelandGeo . ?reserve rdf:type y2geoo:OSM_nature_reserve; geo:hasGeometry ?reserveGeo . ?lake rdf:type y2geoo:OSM_lake; geo:hasGeometry ?lakeGeo . FILTER(geof:sfWithin(?lakeGeo, ?reserveGeo)) }\nPLAIN QUERY: SELECT DISTINCT ?reserve WHERE { ?reserve rdf:type y2geoo:OSM_nature_reserve; geo:hasGeometry ?rgeo. ?rgeo geo:asWKT ?rWKT. ?lake rdf:type y2geoo:OSM_lake; geo:hasGeometry ?lgeo. ?lgeo geo:asWKT ?lWKT. FILTER(geof:sfWithin(?lWKT, ?rWKT)) }\nURI: 27\nPLAIN: 21\n82\nURI QUERY: ASK { yago:Leicester geo:hasGeometry ?geo1 . yago:Birmingham geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(strdf:toEast(?geoWKT1, ?geoWKT2)) }\nPLAIN QUERY: ASK { <http://yago-knowledge.org/resource/Leicester> geo:hasGeometry ?geo1 . <http://yago-knowledge.org/resource/Birmingham> geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(strdf:rightOf(?geoWKT1, ?geoWKT2)) }\nURI: 28\nPLAIN: 22\n83\nURI QUERY: SELECT DISTINCT ?park WHERE { yago:United_States geo:hasGeometry ?geoUS . ?forest rdf:type y2geoo:OSM_forest; geo:hasGeometry ?geoForest . ?park rdf:type y2geoo:OSM_park; geo:hasGeometry ?geoPark . FILTER(geof:sfWithin(?geoPark, ?geoForest)) }\nPLAIN QUERY: SELECT DISTINCT ?park WHERE { ?park rdf:type y2geoo:OSM_park . ?forest rdf:type y2geoo:OSM_forest . ?forest geo:hasGeometry ?forestGeo . ?park geo:hasGeometry ?parkGeo . FILTER(geof:sfWithin(?parkGeo, ?forestGeo)) }\nURI: 29\nPLAIN: 23\n84\nURI QUERY: SELECT DISTINCT ?district WHERE { yago:Cambridge geo:hasGeometry ?cgeo . ?district rdf:type y2geoo:OS_District . ?district geo:hasGeometry ?dgeo . ?dgeo geo:asWKT ?dWKT . ?forest rdf:type y2geoo:OSM_forest . ?forest geo:hasGeometry ?fgeo . ?fgeo geo:asWKT ?fWKT . FILTER (geof:sfWithin(?fWKT, ?dWKT)) }\nPLAIN QUERY: SELECT DISTINCT ?district WHERE { ?district rdf:type y2geoo:GAG_District . ?forest rdf:type y2geoo:OSM_forest . ?forest geo:hasGeometry ?fgeo . ?district geo:hasGeometry ?dgeo . FILTER(geof:sfIntersects(?fgeo, ?dgeo)) }\nURI: 29\nPLAIN: 23\n85\nURI QUERY: SELECT ?location WHERE { yago:Luton geo:hasGeometry ?geom . ?geom geo:asWKT ?location }\nPLAIN QUERY: SELECT ?location WHERE { yago:Luton geo:hasGeometry ?geom . ?geom geo:asWKT ?location }\nURI: 30\nPLAIN: 24\n86\nURI QUERY: SELECT ?district (COUNT(?village) AS ?villageCount) WHERE { ?district rdf:type y2geoo:OS_District . ?district geo:hasGeometry ?dgeo . ?village rdf:type y2geoo:OSM_village . ?village geo:hasGeometry ?vgeo . FILTER (geof:sfWithin(?vgeo, ?dgeo)) } GROUP BY ?district ORDER BY DESC(?villageCount) LIMIT 1\nPLAIN QUERY: SELECT ?district (COUNT(DISTINCT ?village) as ?villageCount) WHERE { ?district rdf:type y2geoo:OSM_district . ?village rdf:type y2geoo:OSM_village . ?village geo:hasGeometry ?villageGeo . ?district geo:hasGeometry ?districtGeo . FILTER(geof:sfWithin(?villageGeo, ?districtGeo)) } GROUP BY ?district ORDER BY DESC(?villageCount) LIMIT 1\nURI: 31\nPLAIN: 24\n87\nURI QUERY: SELECT (SUM(?population) as ?totalPopulation) WHERE { { yago:London yago:hasPopulation ?population . } UNION { yago:Manchester yago:hasPopulation ?population . } UNION { yago:Liverpool yago:hasPopulation ?population . } UNION { yago:Birmingham yago:hasPopulation ?population . } UNION { yago:Glasgow yago:hasPopulation ?population . } }\nPLAIN QUERY: SELECT (SUM(?population) as ?totalPopulation) WHERE { ?city rdf:type y2geoo:GAG_City; geo:hasGeometry ?cityGeo; yago:hasPopulation ?population. ?city geo:asWKT ?cityWKT. FILTER(geof:sfWithin(?cityWKT, yago:United_Kingdom)) } ORDER BY DESC(?population) LIMIT 5\nMaterialize failed: {\"timestamp\":\"2024-09-13T17:33:44.450+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\nURI: 31\nPLAIN: 24\n88\nURI QUERY: SELECT ?city (COUNT(DISTINCT ?lake) AS ?lakeCount) WHERE { ?city rdf:type y2geoo:OSM_city; geo:hasGeometry ?cityGeo. ?cityGeo geo:asWKT ?cityWKT. ?lake rdf:type y2geoo:OSM_lake; geo:hasGeometry ?lakeGeo. ?lakeGeo geo:asWKT ?lakeWKT. FILTER (geof:sfIntersects(?cityWKT, ?lakeWKT)) } GROUP BY ?city ORDER BY DESC(?lakeCount) LIMIT 1\nPLAIN QUERY: SELECT ?city (COUNT(DISTINCT ?lake) AS ?lakeCount) WHERE { ?city rdf:type y2geoo:GAG_City; geo:hasGeometry ?cityGeo. ?lake rdf:type y2geoo:OSM_lake; geo:hasGeometry ?lakeGeo. FILTER(geof:sfTouches(?cityGeo, ?lakeGeo)) } GROUP BY ?city ORDER BY DESC(?lakeCount) LIMIT 1\nURI: 31\nPLAIN: 24\n89\nURI QUERY: SELECT ?location WHERE { yago:Chichester geo:hasGeometry ?geo . ?geo geo:asWKT ?location . }\nPLAIN QUERY: SELECT ?location WHERE { yago:Chichester geo:hasGeometry ?geo . ?geo geo:asWKT ?location }\nURI: 32\nPLAIN: 25\n90\nURI QUERY: ASK { yago:Dublin geo:hasGeometry ?geoDublin . yago:Belfast geo:hasGeometry ?geoBelfast . ?geoDublin geo:asWKT ?wktDublin . ?geoBelfast geo:asWKT ?wktBelfast . FILTER(strdf:below(?wktDublin, ?wktBelfast)) }\nPLAIN QUERY: ASK { <http://yago-knowledge.org/resource/Dublin> geo:hasGeometry ?geo1 . <http://yago-knowledge.org/resource/Belfast> geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(strdf:below(?geoWKT1, ?geoWKT2)) }\nURI: 32\nPLAIN: 25\n91\nURI QUERY: SELECT DISTINCT ?park (strdf:area(?parkWKT) as ?area) WHERE { yago:Dublin geo:hasGeometry ?dublinGeo . ?park rdf:type y2geoo:OSM_park . ?park geo:hasGeometry ?parkGeo . ?parkGeo geo:asWKT ?parkWKT . FILTER(geof:sfContains(?dublinGeo, ?parkWKT)) } ORDER BY DESC(?area) LIMIT 1\nPLAIN QUERY: SELECT DISTINCT ?park (strdf:area(?parkWKT) AS ?area) WHERE { yago:Dublin geo:hasGeometry ?geom . ?geom geo:asWKT ?dublinWKT . ?park rdf:type y2geoo:OSM_park . ?park geo:hasGeometry ?parkGeo . ?parkGeo geo:asWKT ?parkWKT . FILTER (geof:sfContains(?dublinWKT, ?parkWKT)) } ORDER BY DESC(?area) LIMIT 1\nURI: 33\nPLAIN: 26\n92\nURI QUERY: SELECT DISTINCT ?district WHERE { yago:Stafford_District geo:hasGeometry ?sgeo . ?district rdf:type y2geoo:OS_District . ?district geo:hasGeometry ?dgeo . FILTER (strdf:touches(?sgeo, ?dgeo)) }\nPLAIN QUERY: SELECT DISTINCT ?district WHERE { yago:Stafford_District geo:hasGeometry ?sgeo . ?district rdf:type y2geoo:GAG_District . ?district geo:hasGeometry ?dgeo . FILTER (strdf:touches(?sgeo, ?dgeo)) }\nURI: 33\nPLAIN: 26\n93\nURI QUERY: SELECT DISTINCT ?lake WHERE { yago:Central_Macedonia geo:hasGeometry ?cmGeo . ?lake rdf:type y2geoo:OSM_lake . ?lake geo:hasGeometry ?lakeGeo . FILTER (geof:sfWithin(?lakeGeo, ?cmGeo)) }\nPLAIN QUERY: SELECT DISTINCT ?lake WHERE { yago:Central_Macedonia geo:hasGeometry ?geo . ?lake rdf:type y2geoo:OSM_lake . ?lake geo:hasGeometry ?lakeGeo . ?lakeGeo geo:asWKT ?lakeWKT . ?geo geo:asWKT ?centralMacedoniaWKT . FILTER(geof:sfWithin(?lakeWKT, ?centralMacedoniaWKT)) }\nURI: 34\nPLAIN: 27\n94\nURI QUERY: SELECT DISTINCT ?municipality (strdf:area(?geoWKT) as ?area) WHERE { yago:Greece geo:hasGeometry ?greeceGeo . ?municipality rdf:type y2geoo:GAG_Municipality . ?municipality geo:hasGeometry ?municipalityGeo . ?municipalityGeo geo:asWKT ?geoWKT . FILTER(geof:sfContains(?greeceGeo, ?geoWKT)) } ORDER BY (?area) LIMIT 1\nPLAIN QUERY: SELECT DISTINCT ?municipality (strdf:area(?mWKT) as ?area) WHERE { ?municipality rdf:type y2geoo:GAG_Municipality; geo:hasGeometry ?mGeo. ?mGeo geo:asWKT ?mWKT. FILTER (strdf:within(yago:Greece, ?mWKT)) } ORDER BY (?area) LIMIT 1\nMaterialize failed: {\"timestamp\":\"2024-09-13T17:34:15.520+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\nURI: 34\nPLAIN: 27\n95\nURI QUERY: SELECT DISTINCT ?municipality (strdf:area(?municipalityWKT) AS ?area) WHERE { yago:Thessaloniki geo:hasGeometry ?tgeo . ?tgeo geo:asWKT ?tWKT . ?municipality rdf:type y2geoo:GAG_Municipality . ?municipality geo:hasGeometry ?municipalityGeo . ?municipalityGeo geo:asWKT ?municipalityWKT . FILTER (strdf:touches(?tWKT, ?municipalityWKT)) } ORDER BY DESC(?area) LIMIT 1\nPLAIN QUERY: SELECT DISTINCT ?municipality (strdf:area(?geoWKT) as ?area) WHERE { yago:Thessaloniki geo:hasGeometry ?tgeo . ?tgeo geo:asWKT ?tgWKT . ?municipality rdf:type y2geoo:GAG_Municipality . ?municipality geo:hasGeometry ?mgeo . ?mgeo geo:asWKT ?geoWKT . FILTER (strdf:touches(?tgWKT, ?geoWKT)) } ORDER BY DESC(?area) LIMIT 1\nURI: 34\nPLAIN: 27\n96\nURI QUERY: SELECT DISTINCT ?municipality WHERE { ?municipality rdf:type y2geoo:GAG_Municipality; geo:hasGeometry ?mGeo. ?mGeo geo:asWKT ?mWKT. ?lake rdf:type y2geoo:OSM_lake; geo:hasGeometry ?lGeo. ?lGeo geo:asWKT ?lWKT. FILTER(geof:sfWithin(?lWKT, ?mWKT)) }\nPLAIN QUERY: SELECT DISTINCT ?municipality WHERE { ?municipality rdf:type y2geoo:GAG_Municipality; geo:hasGeometry ?mgeo. ?mgeo geo:asWKT ?mWKT. ?lake rdf:type y2geoo:OSM_lake; geo:hasGeometry ?lgeo. ?lgeo geo:asWKT ?lWKT. FILTER(geof:sfWithin(?lWKT, ?mWKT)) }\nURI: 34\nPLAIN: 27\n97\nURI QUERY: SELECT DISTINCT ?forest WHERE { ?barony rdf:type y2geoo:OSI_Barony; geo:hasGeometry ?baronyGeo. ?baronyGeo geo:asWKT ?baronyWKT. ?forest rdf:type y2geoo:OSM_forest; geo:hasGeometry ?forestGeo. ?forestGeo geo:asWKT ?forestWKT. FILTER(geof:sfWithin(?forestWKT, ?baronyWKT)) }\nPLAIN QUERY: SELECT DISTINCT ?forest WHERE { ?barony rdf:type y2geoo:GAG_Baronie; geo:hasGeometry ?baronyGeo. ?forest rdf:type y2geoo:OSM_forest; geo:hasGeometry ?forestGeo. ?baronyGeo geo:asWKT ?baronyWKT. ?forestGeo geo:asWKT ?forestWKT. FILTER (geof:sfWithin(?forestWKT, ?baronyWKT)) }\nURI: 34\nPLAIN: 27\n98\nURI QUERY: SELECT ?location WHERE { yago:Birmingham geo:hasGeometry ?geo . ?geo geo:asWKT ?location . }\nPLAIN QUERY: SELECT ?location WHERE { yago:Birmingham geo:hasGeometry ?geom . ?geom geo:asWKT ?location }\nURI: 35\nPLAIN: 28\n99\nURI QUERY: SELECT (COUNT(DISTINCT ?city) AS ?cityCount) WHERE { yago:Merseyside geo:hasGeometry ?geo . ?city rdf:type y2geoo:OSM_city . ?city geo:hasGeometry ?cityGeo . FILTER(geof:sfWithin(?cityGeo, ?geo)) }\nPLAIN QUERY: SELECT (COUNT(DISTINCT ?city) AS ?cityCount) WHERE { ?city rdf:type y2geoo:OSM_city; geo:hasGeometry ?cityGeo. ?cityGeo geo:asWKT ?cityWKT. FILTER (strdf:within(?cityWKT, yago:Merseyside)) }\nMaterialize failed: {\"timestamp\":\"2024-09-13T17:34:36.139+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\nURI: 36\nPLAIN: 29\n","output_type":"stream"},{"traceback":["\u001b[0;31m---------------------------------------------------------------------------\u001b[0m","\u001b[0;31mNameError\u001b[0m                                 Traceback (most recent call last)","Cell \u001b[0;32mIn[15], line 53\u001b[0m\n\u001b[1;32m     50\u001b[0m             detailed_comp2 \u001b[38;5;241m+\u001b[39m\u001b[38;5;241m=\u001b[39m \u001b[38;5;241m1\u001b[39m\n\u001b[1;32m     51\u001b[0m         \u001b[38;5;28mprint\u001b[39m(\u001b[38;5;124mf\u001b[39m\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mPLAIN: \u001b[39m\u001b[38;5;132;01m{\u001b[39;00mdetailed_comp2\u001b[38;5;132;01m}\u001b[39;00m\u001b[38;5;124m\"\u001b[39m)\n\u001b[0;32m---> 53\u001b[0m \u001b[38;5;28mprint\u001b[39m (\u001b[43mdetailed_comp\u001b[49m\u001b[38;5;241m/\u001b[39m\u001b[38;5;241m100\u001b[39m)\n","\u001b[0;31mNameError\u001b[0m: name 'detailed_comp' is not defined"],"ename":"NameError","evalue":"name 'detailed_comp' is not defined","output_type":"error"}]},{"cell_type":"code","source":"# import json\n\n# with open('/kaggle/input/100geoquestions/100_Sub_Dataset.json', 'r') as file:\n#     original_dataset = json.load(file)\n\n# # Create a new dataset with questions and generated queries\n# new_dataset = {}\n# for key, item in original_dataset.items():\n#     question = item['Question']\n#     gt_query = item['Query']\n#     query = generate_URI_injected_query(question, gt_query)\n#     new_dataset[key] = {'Question': question, 'Query': query}\n#     #print (f\"{key}/{len(original_dataset.items())}\")\n\n# # Save the new dataset to a JSON file\n# with open('/kaggle/working/generated_dataset1.json', 'w') as file:\n#     json.dump(new_dataset, file, indent=4)","metadata":{"execution":{"iopub.status.busy":"2024-09-13T17:34:39.964704Z","iopub.status.idle":"2024-09-13T17:34:39.965219Z","shell.execute_reply.started":"2024-09-13T17:34:39.964987Z","shell.execute_reply":"2024-09-13T17:34:39.965010Z"},"trusted":true},"execution_count":null,"outputs":[]},{"cell_type":"code","source":"# !pip install rdflib","metadata":{"execution":{"iopub.status.busy":"2024-09-13T17:34:39.966248Z","iopub.status.idle":"2024-09-13T17:34:39.966603Z","shell.execute_reply.started":"2024-09-13T17:34:39.966441Z","shell.execute_reply":"2024-09-13T17:34:39.966455Z"},"trusted":true},"execution_count":null,"outputs":[]},{"cell_type":"code","source":"# import re\n# from collections import Counter\n# from sklearn.feature_extraction.text import CountVectorizer\n# from sklearn.metrics.pairwise import cosine_similarity\n# import numpy as np\n# from nltk.translate.bleu_score import sentence_bleu, SmoothingFunction\n# from rdflib.plugins.sparql.parser import parseQuery\n\n# def normalize_variables(query):\n#     if query is None:\n#         return \"\"\n#     variable_pattern = re.compile(r\"\\?\\w+\")\n#     variables = variable_pattern.findall(query)\n#     normalized_query = query\n#     for i, var in enumerate(variables):\n#         normalized_query = normalized_query.replace(var, f\"?var{i}\")\n#     return normalized_query\n\n# def is_parsable(query):\n#     try:\n#         parsed_query = parseQuery(query)\n#         return True\n#     except Exception as e:\n#         print(f\"Error parsing query: {e}\")\n#         return False\n\n# def extract_tokens(query):\n#     if query is None:\n#         return []\n#     # Tokenize by splitting on non-word characters\n#     tokens = re.findall(r'\\b\\w+\\b', query)\n#     return tokens\n\n# def mod_jaccard_similarity(list1, list2):\n#     generated_freq = Counter(list1)\n#     reference_freq = Counter(list2)\n\n#     intersection = sum((generated_freq & reference_freq).values())\n#     union = sum((generated_freq | reference_freq).values())\n\n#     if not union:\n#         return 0.0\n\n#     return intersection / union\n\n# def cosine_similarity_score(generated_query, reference_query):\n#     # Normalize and extract tokens\n#     normalized_generated_query = normalize_variables(generated_query)\n#     normalized_reference_query = normalize_variables(reference_query)\n\n#     generated_tokens = ' '.join(extract_tokens(normalized_generated_query))\n#     reference_tokens = ' '.join(extract_tokens(normalized_reference_query))\n\n#     # Vectorize the tokens\n#     vectorizer = CountVectorizer().fit_transform([generated_tokens, reference_tokens])\n#     vectors = vectorizer.toarray()\n\n#     # Calculate cosine similarity\n#     cosine_sim = cosine_similarity(vectors)\n#     return cosine_sim[0, 1]\n\n# def bleu_score(generated_query, reference_query):\n#     # Normalize and extract tokens\n#     normalized_generated_query = normalize_variables(generated_query)\n#     normalized_reference_query = normalize_variables(reference_query)\n    \n#     generated_tokens = extract_tokens(normalized_generated_query)\n#     reference_tokens = extract_tokens(normalized_reference_query)\n\n#     # Calculate BLEU score\n#     smoothie = SmoothingFunction().method4\n#     return sentence_bleu([reference_tokens], generated_tokens, smoothing_function=smoothie)\n\n# def calculate_similarity_score(generated_query, reference_query):\n#     # Normalize and extract tokens\n#     normalized_generated_query = normalize_variables(generated_query)\n#     normalized_reference_query = normalize_variables(reference_query)\n    \n#     generated_tokens = extract_tokens(normalized_generated_query)\n#     reference_tokens = extract_tokens(normalized_reference_query)\n    \n#     # Calculate Jaccard similarity\n#     m_j_s = mod_jaccard_similarity(generated_tokens, reference_tokens)\n#     cos_s = cosine_similarity_score(generated_query, reference_query)\n#     bleu = bleu_score(generated_query, reference_query)\n#     parsability_score = 1 if is_parsable(generated_query) else 0\n    \n#     hybrid_bleu = 0.2 * m_j_s + 0.2 * cos_s + 0.05 * parsability_score + 0.55 * bleu\n    \n#     return bleu, hybrid_bleu","metadata":{"execution":{"iopub.status.busy":"2024-09-13T17:34:39.968599Z","iopub.status.idle":"2024-09-13T17:34:39.968972Z","shell.execute_reply.started":"2024-09-13T17:34:39.968774Z","shell.execute_reply":"2024-09-13T17:34:39.968788Z"},"trusted":true},"execution_count":null,"outputs":[]},{"cell_type":"code","source":"# def evaluate_generations(dataset, generated_queries):\n#     blues = []\n#     hybrid_blues = []\n    \n#     for key in dataset:\n#         query = dataset[key]['Query']\n#         generated_query = generated_queries[key]['Query']\n        \n#         blue, hbleu = calculate_similarity_score(query, generated_query)\n        \n#         blues.append(blue)\n#         hybrid_blues.append(hbleu)\n        \n#     average_bleu = sum(blues) / len(blues) if blues else 0\n#     average_hybrid_bleu = sum(hybrid_blues) / len(hybrid_blues) if hybrid_blues else 0\n    \n#     return average_bleu, average_hybrid_bleu","metadata":{"execution":{"iopub.status.busy":"2024-09-13T17:34:39.970239Z","iopub.status.idle":"2024-09-13T17:34:39.970604Z","shell.execute_reply.started":"2024-09-13T17:34:39.970438Z","shell.execute_reply":"2024-09-13T17:34:39.970453Z"},"trusted":true},"execution_count":null,"outputs":[]},{"cell_type":"code","source":"# with open('/kaggle/input/100geoquestions/100_Sub_Dataset.json', 'r') as file:\n#     original_dataset = json.load(file)\n\n# avg_bleu, avg_hbleu = evaluate_generations(original_dataset, new_dataset)\n# print(avg_bleu, avg_hbleu)","metadata":{"execution":{"iopub.status.busy":"2024-09-13T17:34:39.972603Z","iopub.status.idle":"2024-09-13T17:34:39.972991Z","shell.execute_reply.started":"2024-09-13T17:34:39.972790Z","shell.execute_reply":"2024-09-13T17:34:39.972822Z"},"trusted":true},"execution_count":null,"outputs":[]}]}