{"cells":[{"cell_type":"code","execution_count":1,"metadata":{"execution":{"iopub.execute_input":"2024-09-17T10:47:01.095170Z","iopub.status.busy":"2024-09-17T10:47:01.094805Z","iopub.status.idle":"2024-09-17T10:47:01.646146Z","shell.execute_reply":"2024-09-17T10:47:01.645213Z","shell.execute_reply.started":"2024-09-17T10:47:01.095123Z"},"trusted":true},"outputs":[{"name":"stdout","output_type":"stream","text":["The token has not been saved to the git credentials helper. Pass `add_to_git_credential=True` in this function directly or `--add-to-git-credential` if using via `huggingface-cli` if you want to set the git credential as well.\n","Token is valid (permission: read).\n","Your token has been saved to /root/.cache/huggingface/token\n","Login successful\n"]}],"source":["import os\n","from huggingface_hub import login\n","\n","login(token='')"]},{"cell_type":"markdown","metadata":{},"source":["Functions to format the queries properly for the endpoint."]},{"cell_type":"code","execution_count":2,"metadata":{"_cell_guid":"b1076dfc-b9ad-4769-8c92-a6c4dae69d19","_uuid":"8f2839f25d086af736a60e9eeb907d3b93b6e0e5","execution":{"iopub.execute_input":"2024-09-17T10:47:01.648524Z","iopub.status.busy":"2024-09-17T10:47:01.647856Z","iopub.status.idle":"2024-09-17T10:47:01.655232Z","shell.execute_reply":"2024-09-17T10:47:01.654044Z","shell.execute_reply.started":"2024-09-17T10:47:01.648494Z"},"trusted":true},"outputs":[],"source":["import re\n","\n","def format_query(query):\n","    PREFIXES = \"\"\"PREFIX geo: <http://www.opengis.net/ont/geosparql#>\n","PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\n","PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n","PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n","PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n","PREFIX yago: <http://yago-knowledge.org/resource/>\n","PREFIX y2geor: <http://kr.di.uoa.gr/yago2geo/resource/>\n","PREFIX y2geoo: <http://kr.di.uoa.gr/yago2geo/ontology/>\n","PREFIX strdf: <http://strdf.di.uoa.gr/ontology#>\n","PREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n","PREFIX owl: <http://www.w3.org/2002/07/owl#>\"\"\"\n","    \n","    query = PREFIXES + ' ' + query\n","    \n","    query = query.replace('strdf:within', 'geof:sfWithin')\n","    query = query.replace('strdf:contains', 'geof:sfContains')\n","    query = query.replace('strdf:overlaps', 'geof:sfOverlaps')\n","    query = query.replace('strdf:distance', 'geof:sfDistance')\n","    \n","    # Use regex to find and replace strdf:buffer patterns\n","    query = re.sub(r'strdf:buffer\\((\\?\\w+),\\s*\\d+,\\s*uom:\\w+\\)', r'\\1', query)\n","    \n","    return query"]},{"cell_type":"code","execution_count":3,"metadata":{"execution":{"iopub.execute_input":"2024-09-17T10:47:01.656665Z","iopub.status.busy":"2024-09-17T10:47:01.656366Z","iopub.status.idle":"2024-09-17T10:47:01.667780Z","shell.execute_reply":"2024-09-17T10:47:01.666827Z","shell.execute_reply.started":"2024-09-17T10:47:01.656641Z"},"trusted":true},"outputs":[],"source":["def gost_materialize_query(query: str):\n","    data = {\n","        \"query\": query\n","    }\n","\n","    headers = {\n","        'Content-Type': 'application/json'\n","    }\n","\n","    response = requests.post(\"\", headers=headers, data=json.dumps(data))\n","    \n","    if response.status_code == 200:\n","        return response.text\n","    else:\n","        print(\"Materialize failed:\", response.text)\n","        return (query)"]},{"cell_type":"markdown","metadata":{},"source":["Function that sends query to the endpoint and returns the result."]},{"cell_type":"code","execution_count":4,"metadata":{"execution":{"iopub.execute_input":"2024-09-17T10:47:01.669524Z","iopub.status.busy":"2024-09-17T10:47:01.669166Z","iopub.status.idle":"2024-09-17T10:47:02.091863Z","shell.execute_reply":"2024-09-17T10:47:02.090982Z","shell.execute_reply.started":"2024-09-17T10:47:01.669492Z"},"trusted":true},"outputs":[],"source":["import requests\n","import pandas as pd\n","from io import StringIO\n","\n","def graphdb_send_request(query, endpoint_url=\"\", accept_format='application/sparql-results+json'):\n","    \"\"\"\n","    Sends a SPARQL query to a GraphDB endpoint.\n","\n","    :param query: SPARQL query to be sent\n","    :param endpoint_url: URL of the GraphDB SPARQL endpoint\n","    :param accept_format: Desired response format (default is JSON)\n","    :return: Response from the endpoint\n","    \"\"\"\n","    # Format the query, this means add the correct prefixes and fix some endpoint issues with regex.\n","    query = format_query(query)\n","    original_query = query\n","    query = gost_materialize_query(query)\n","    \n","    headers = {\n","        'Accept': accept_format,\n","        'Content-Type': 'application/x-www-form-urlencoded'\n","    }\n","\n","    data = {\n","        'query': query\n","    }\n","    \n","    try:\n","        response = requests.post(endpoint_url, headers=headers, data=data, auth=requests.auth.HTTPBasicAuth('us', 'pas'))\n","\n","        if response.status_code == 200:\n","            if accept_format == 'application/sparql-results+json':\n","#                 print(response.json())\n","                json_response = response.json()\n","                return convert_json_to_csv(json_response)\n","            else:\n","#                 print(response.text)\n","                return response.text\n","        else:\n","            response.raise_for_status()\n","    except requests.exceptions.HTTPError as err:\n","        print(\"HTTP error (most likely invalid query)\")\n","        #print(query)\n","        #print(err)\n","    except Exception as err:\n","        print(err)\n","        print(\"Endpoint error ENDPOINT DOWN\")\n","        \n","def convert_json_to_csv(json_data):\n","    \"\"\"\n","    Converts JSON data to CSV format.\n","\n","    :param json_data: JSON data to be converted\n","    :return: CSV formatted data as a string\n","    \"\"\"\n","    if 'boolean' in json_data:\n","        # Handling boolean result\n","        headers = ['value']\n","        rows = [[json_data['boolean']]]\n","    else:\n","        # Extracting header and rows from JSON response\n","        headers = json_data['head']['vars']\n","        rows = [{var: result.get(var, {}).get('value', '') for var in headers} for result in json_data['results']['bindings']]\n","    \n","    # Creating DataFrame and converting to CSV\n","    df = pd.DataFrame(rows, columns=headers)\n","    csv_output = StringIO()\n","    df.to_csv(csv_output, index=False)\n","    \n","    return csv_output.getvalue()"]},{"cell_type":"markdown","metadata":{},"source":["Inference function."]},{"cell_type":"code","execution_count":5,"metadata":{"execution":{"iopub.execute_input":"2024-09-17T10:47:02.094881Z","iopub.status.busy":"2024-09-17T10:47:02.094473Z","iopub.status.idle":"2024-09-17T10:47:05.494744Z","shell.execute_reply":"2024-09-17T10:47:05.493756Z","shell.execute_reply.started":"2024-09-17T10:47:02.094854Z"},"trusted":true},"outputs":[],"source":["import torch\n","\n","def run_chat_inference(model, tokenizer, system_role, user_message):\n","    results = []\n","    \n","    device = torch.device(\"cuda\" if torch.cuda.is_available() else \"cpu\")\n","    model.to(device)\n","    \n","    messages = [\n","        {\"role\": \"system\", \"content\": system_role},\n","        {\"role\": \"user\", \"content\": user_message}\n","    ]\n","\n","    tokenizer.apply_chat_template(messages, tokenize=False)\n","\n","    model_inputs = tokenizer.apply_chat_template(messages, return_tensors = \"pt\").to(device)\n","    \n","    generated_ids = model.generate(\n","        model_inputs,\n","        max_new_tokens = 1000,\n","        do_sample = True,\n","    )\n","\n","    # Decode generated text\n","    generated_text = tokenizer.batch_decode(generated_ids, skip_special_tokens=True)[0]\n","    \n","    # Remove the system message\n","    if system_role in generated_text:\n","        generated_text = generated_text.split(system_role)[-1].strip()\n","\n","    # Remove the user message from the output to get only the assistant's response\n","    if user_message in generated_text:\n","        generated_text = generated_text.split(user_message)[-1].strip()\n","\n","    # Clear model from RAM\n","    del model\n","    torch.cuda.empty_cache()\n","    \n","    return generated_text"]},{"cell_type":"code","execution_count":6,"metadata":{"execution":{"iopub.execute_input":"2024-09-17T10:47:05.499217Z","iopub.status.busy":"2024-09-17T10:47:05.498554Z","iopub.status.idle":"2024-09-17T10:47:06.110336Z","shell.execute_reply":"2024-09-17T10:47:06.109565Z","shell.execute_reply.started":"2024-09-17T10:47:05.499179Z"},"trusted":true},"outputs":[],"source":["from transformers import AutoTokenizer, AutoModelForCausalLM\n","import torch\n","\n","def run_chat_inference_llama(model, tokenizer, system_role, user_message):\n","    messages = [\n","        {\"role\": \"system\", \"content\": system_role},\n","        {\"role\": \"user\", \"content\": user_message}\n","    ]\n","\n","    input_ids = tokenizer.apply_chat_template(\n","        messages,\n","        add_generation_prompt=True,\n","        return_tensors=\"pt\"\n","    ).to(model.device)\n","\n","    terminators = [\n","        tokenizer.eos_token_id,\n","        tokenizer.convert_tokens_to_ids(\"<|eot_id|>\")\n","    ]\n","\n","    outputs = model.generate(\n","        input_ids,\n","        max_new_tokens=128,\n","        eos_token_id=terminators,\n","        do_sample=True,\n","        temperature=0.6,\n","        top_p=0.9,\n","    )\n","    response = outputs[0][input_ids.shape[-1]:]\n","    result = tokenizer.decode(response, skip_special_tokens=True)\n","\n","    return (result)"]},{"cell_type":"code","execution_count":7,"metadata":{"execution":{"iopub.execute_input":"2024-09-17T10:47:06.112250Z","iopub.status.busy":"2024-09-17T10:47:06.111659Z","iopub.status.idle":"2024-09-17T10:47:06.131982Z","shell.execute_reply":"2024-09-17T10:47:06.131093Z","shell.execute_reply.started":"2024-09-17T10:47:06.112216Z"},"trusted":true},"outputs":[],"source":["import torch\n","\n","def run_inference(model, tokenizer, prompt):\n","    results = \"\"\n","    \n","    if tokenizer == None:\n","        # Generate output\n","        with torch.no_grad():\n","            outputs = model(prompt)\n","            \n","        # Decode and print output\n","        #print(\"Prompt:\", prompt)\n","        #print(\"Generated text:\" + outputs + \"\\n\")\n","        results = outputs\n","    else:\n","        # Move model to GPU\n","        device = torch.device(\"cuda\" if torch.cuda.is_available() else \"cpu\")\n","        model.to(device)\n","        model.eval()  # Set model to evaluation mode\n","            \n","        # Tokenize prompt\n","        inputs = tokenizer(prompt, return_tensors=\"pt\").to(device)\n","            \n","        # Generate output\n","        with torch.no_grad():\n","            outputs = model.generate(**inputs, \n","                            max_new_tokens=800,  # Set a maximum length for generated text\n","                            #do_sample=True,  # Enable sampling\n","                            #top_k=7,        # Top-k sampling\n","                            #top_p=0.1,      # Top-p sampling (nucleus sampling)\n","                            #num_return_sequences=1,\n","                            #repetition_penalty=1, # No penalty for instruction tuned models.\n","                            repetition_penalty=1.2, # Penalty on repeating tokens.\n","                            eos_token_id=tokenizer.eos_token_id,  # Specify EOS token ID\n","                            pad_token_id=tokenizer.pad_token_id  # Specify PAD token ID\n","                            )\n","        \n","        # Extract generated text\n","        generated_text = tokenizer.decode(outputs[0], skip_special_tokens=True)\n","\n","        # Remove the prompt text\n","        prompt_length = len(prompt)\n","        generated_text = generated_text[prompt_length:]\n","\n","        # Decode and print output\n","        #print(\"Prompt:\", prompt)\n","        #print(generated_text)\n","        results = generated_text\n","    \n","    # Clear model from RAM\n","    del model\n","    torch.cuda.empty_cache()\n","    \n","    return results\n","    \n","def compare_strings(str1, str2):\n","    # Split strings into words\n","    words1 = str1.split()\n","    words2 = str2.split()\n","    \n","    # Determine the length of the shorter list\n","    min_length = min(len(words1), len(words2))\n","    \n","    # Compare words from both lists\n","    for i in range(min_length):\n","        if words1[i] != words2[i]:\n","            print(f\"Difference found: '{words1[i]}' != '{words2[i]}'\")\n","    \n","    # Handle any extra words in the longer list\n","    if len(words1) > min_length:\n","        for i in range(min_length, len(words1)):\n","            print(f\"Extra word in first string: '{words1[i]}'\")\n","    \n","    if len(words2) > min_length:\n","        for i in range(min_length, len(words2)):\n","            print(f\"Extra word in second string: '{words2[i]}'\")\n","            \n","def find_prompt_end_position(generated_text, prompt):\n","    # Remove all spaces from the sentence and paragraph\n","    clean_paragraph = generated_text.replace(' ', '')\n","    clean_sentence = prompt.replace(' ', '')\n","    \n","    # Find the start position of the clean sentence in the clean paragraph\n","    start_position = clean_paragraph.find(clean_sentence)\n","    \n","    if start_position == -1:\n","        print(\"MAN\")\n","        return -1  # Sentence not found in the paragraph\n","    \n","    # Calculate the end position in the original paragraph\n","    sentence_length = len(clean_sentence)\n","    end_position_clean = start_position + sentence_length\n","    \n","    # Convert the end position to the original paragraph with spaces\n","    current_position = 0\n","    end_position_original = 0\n","    for char in generated_text:\n","        if char != ' ':\n","            current_position += 1\n","        end_position_original += 1\n","        if current_position == end_position_clean:\n","            break\n","    \n","    return end_position_original\n","\n","def Quantized_Inference(model, tokenizer, prompt):\n","    results = []\n","    \n","    # Move model to GPU\n","    device = torch.device(\"cuda\" if torch.cuda.is_available() else \"cpu\")\n","    model.eval()  # Set model to evaluation mode\n","            \n","    # Tokenize prompt\n","    inputs = tokenizer(prompt, return_tensors=\"pt\").to(device)\n","            \n","    # Generate output\n","    with torch.no_grad():\n","        outputs = model.generate(**inputs, \n","                            max_new_tokens=250,  # Set a maximum length for generated text\n","                            #do_sample=True,  # Enable sampling\n","                            #top_k=7,        # Top-k sampling\n","                            #top_p=0.1,      # Top-p sampling (nucleus sampling)\n","                            #num_return_sequences=1,\n","                            repetition_penalty=1.2, # Penalty on repeating tokens.\n","                            eos_token_id=tokenizer.eos_token_id,  # Specify EOS token ID\n","                            pad_token_id=tokenizer.pad_token_id  # Specify PAD token ID\n","                            )\n","        \n","    # Extract generated text\n","    generated_text = tokenizer.decode(outputs[0], skip_special_tokens=True)\n","    \n","    # Remove the prompt text\n","    prompt_length = find_prompt_end_position(generated_text, prompt)\n","    generated_text = generated_text[prompt_length:]\n","    \n","    # Clear model from RAM\n","    del model\n","    torch.cuda.empty_cache()\n","    \n","    return generated_text"]},{"cell_type":"code","execution_count":8,"metadata":{"execution":{"iopub.execute_input":"2024-09-17T10:47:06.133762Z","iopub.status.busy":"2024-09-17T10:47:06.133279Z","iopub.status.idle":"2024-09-17T10:47:06.146995Z","shell.execute_reply":"2024-09-17T10:47:06.146208Z","shell.execute_reply.started":"2024-09-17T10:47:06.133730Z"},"trusted":true},"outputs":[],"source":["def insert_space_before_punctuation(query):\n","    # Function to replace punctuation outside of URIs\n","    def replace_punctuation(match):\n","        text = match.group(0)\n","        if text.startswith('<') and text.endswith('>'):\n","            # This is a URI, don't modify it\n","            return text\n","        else:\n","            # Add spaces before punctuation\n","            return text.replace('?', ' ?').replace('.', ' .')\n","\n","    # Regex pattern to match URIs and text between them\n","    pattern = r'(<[^>]+>|[^<>]+)'\n","\n","    # Apply the replacement function\n","    processed_query = re.sub(pattern, replace_punctuation, query)\n","\n","    return processed_query"]},{"cell_type":"code","execution_count":9,"metadata":{"execution":{"iopub.execute_input":"2024-09-17T10:47:06.148680Z","iopub.status.busy":"2024-09-17T10:47:06.148179Z","iopub.status.idle":"2024-09-17T10:47:06.158046Z","shell.execute_reply":"2024-09-17T10:47:06.157147Z","shell.execute_reply.started":"2024-09-17T10:47:06.148649Z"},"trusted":true},"outputs":[],"source":["import re\n","\n","def extract_uris(query):\n","    # Regular expression to match both fully expanded and prefixed URIs\n","    uri_pattern = r'<([^>]+)>|(\\b[a-zA-Z0-9_]+):([a-zA-Z0-9_]+)'\n","    \n","    uris = []\n","    matches = re.findall(uri_pattern, query)\n","    for match in matches:\n","        if match[0]:  # Fully expanded URI\n","            uris.append(match[0])\n","        else:  # Prefixed URI\n","            uris.append(f\"{match[1]}:{match[2]}\")\n","    return uris\n","\n","def expand_uris(query, prefix_dict):\n","    prefixed_pattern = r'(\\b[a-zA-Z0-9_]+):([a-zA-Z0-9_]+)'\n","    expanded_pattern = r'<([^>]+)>'\n","    \n","    expanded_uris = []\n","    \n","    # Find and expand prefixed URIs\n","    matches = re.findall(prefixed_pattern, query)\n","    for prefix, suffix in matches:\n","        if prefix in prefix_dict:\n","            expanded_uris.append(f\"{prefix_dict[prefix]}{suffix}\")\n","        else:\n","            expanded_uris.append(f\"{prefix}:{suffix}\")\n","    \n","    # Find and add already expanded URIs\n","    matches = re.findall(expanded_pattern, query)\n","    for uri in matches:\n","        expanded_uris.append(uri)\n","    \n","    return expanded_uris\n","\n","prefix_dict = {\n","    'geo': 'http://www.opengis.net/ont/geosparql#',\n","    'osm': 'http://www.openstreetmap.org/ontology#',\n","    'xsd': 'http://www.w3.org/2001/XMLSchema#',\n","    'geof': 'http://www.opengis.net/def/function/geosparql/',\n","    'uom': 'http://www.opengis.net/def/uom/OGC/1.0/'\n","}"]},{"cell_type":"markdown","metadata":{},"source":["Function to generate queries with 6 example few shot learning and uri injection. (best experimental results)"]},{"cell_type":"code","execution_count":10,"metadata":{"execution":{"iopub.execute_input":"2024-09-17T10:47:06.159762Z","iopub.status.busy":"2024-09-17T10:47:06.159470Z","iopub.status.idle":"2024-09-17T10:47:06.178088Z","shell.execute_reply":"2024-09-17T10:47:06.177322Z","shell.execute_reply.started":"2024-09-17T10:47:06.159738Z"},"trusted":true},"outputs":[],"source":["def get_plain_zero_shot_prompt(user_prompt):\n","    prompt = f\"\"\"Generator is an expert SPARQL query generator. For each question that the user supplies, the generator will convert it into a valid SPARQL query that can be used to answer the question. The query will be based on the DBpedia knowledge graph. The query should be enclosed by three backticks on new lines, denoting that it is a code block.\n","Human: {user_prompt}\n","Generator: ```\"\"\"\n","    return prompt\n","\n","def get_plain_three_shot_prompt(user_prompt):\n","    prompt = f\"\"\"Generator is an expert SPARQL query generator. For each question that the user supplies, the generator will convert it into a valid SPARQL query that can be used to answer the question. The query will be based on the DBpedia knowledge graph. The query should be enclosed by three backticks on new lines, denoting that it is a code block.\n","Human: In Breckland district, which forests are south of streams?\n","Generator: ```SELECT DISTINCT ?forest WHERE {{ yago:Breckland_District geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . ?forest rdf:type y2geoo:OSM_forest . ?forest geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 . ?stream rdf:type y2geoo:OSM_stream . ?stream geo:hasGeometry ?o3 . ?o3 geo:asWKT ?geoWKT3 . FILTER (strdf:within(?geoWKT2, ?geoWKT1) && strdf:within(?geoWKT3, ?geoWKT1) && strdf:below(?geoWKT2, ?geoWKT3)) }}```\n","Human: How many streams intersect with lakes?\n","Generator: ```SELECT (COUNT (DISTINCT ?p1) as ?streams) WHERE {{ ?p1 rdf:type y2geoo:OSM_stream; geo:hasGeometry ?p1geo. ?p1geo geo:asWKT ?p1WKT. ?p2 rdf:type y2geoo:OSM_lake; geo:hasGeometry ?p2geo. ?p2geo geo:asWKT ?p2WKT. FILTER(geof:sfIntersects(?p1WKT, ?p2WKT)) }}```\n","Human: Which Municipalities are on Thessaly's border?\n","Generator: ```SELECT distinct ?rg where {{ yago:Thessaly geo:hasGeometry ?tgeo . ?tgeo geo:asWKT ?tgWKT . ?rg rdf:type y2geoo:GAG_Municipality . ?rg geo:hasGeometry ?rggeo . ?rggeo geo:asWKT ?rgWKT . FILTER (strdf:touches(?tgWKT,?rgWKT)) . }}```\n","Human: {user_prompt}\n","Generator: ```\"\"\"\n","    return prompt\n","\n","def get_zero_shot_uri_prompt(user_prompt, uris):\n","    prompt = f\"\"\"Generator is an expert SPARQL query generator. For each question that the user supplies, the generator will convert it into a valid SPARQL query that can be used to answer the question. The query will be based on the Yago2Geo knowledge graph. The query should be enclosed by three backticks on new lines, denoting that it is a code block.\n","Human: {user_prompt}\n","The generator must use these URIs to answer the question: {uris}\n","Generator: ```\"\"\"\n","    return prompt\n","\n","def get_zero_shot_uri_geos_prompt(user_prompt, uris):\n","    prompt = f\"\"\"Generator is an expert SPARQL query generator. For each question that the user supplies, the generator will convert it into a valid SPARQL query that can be used to answer the question. The query will be based on the DBpedia knowledge graph. The query should be enclosed by three backticks on new lines, denoting that it is a code block.\n","The resulting query may have to be in GeoSPARQL. The GeoSPARQL ontology is defined by:\n","URI: http://www.opengis.net/ont/geosparql\n","Classes: Feature, Feature Collection, Geometry, Geometry Collection, Spatial Object, Spatial Object Collection\n","Object Properties: default geometry, contains, covered by, covers, disjoint, equals, inside, meet, overlap, has area, has bounding box, has centroid, has default geometry, has geometry, has length, has perimeter length, has size, has spatial accuracy, has spatial resolution, has volume, disconnected, externally connected, equals, non-tangential proper part, non-tangential proper part inverse, partially overlapping, tangential proper part, tangential proper part inverse, contains, crosses, disjoint, equals, intersects, overlaps, touches, within\n","Datatype Properties: as DGGS, as GML, as GeoJSON, as KML, as WKT, coordinate dimension, dimension, has area in square meters, has length in meters, has perimeter length in meters, has metric size, has spatial accuracy in meters, has spatial resolution in meters, has volume in cubic meters, has serialization, is empty, is simple, spatial dimension\n","Human: {user_prompt}\n","The generator must use these URIs to answer the question: {uris}\n","Generator: ```\"\"\"\n","    return prompt\n","\n","def get_three_shot_uri_prompt(user_prompt, uris):\n","    prompt = f\"\"\"Generator is an expert SPARQL query generator. For each question that the user supplies, the generator will convert it into a valid SPARQL query that can be used to answer the question. The query will be based on the DBpedia knowledge graph. The query should be enclosed by three backticks on new lines, denoting that it is a code block.\n","Human: In Breckland district, which forests are south of streams?\n","The generator must use these URIs to answer the question: ['yago:Breckland_District', 'geo:hasGeometry', 'geo:asWKT', 'rdf:type', 'y2geoo:OSM_forest', 'geo:hasGeometry', 'geo:asWKT', 'rdf:type', 'y2geoo:OSM_stream', 'geo:hasGeometry', 'geo:asWKT', 'strdf:within', 'strdf:within', 'strdf:below']\n","Generator: ```SELECT DISTINCT ?forest WHERE {{ yago:Breckland_District geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . ?forest rdf:type y2geoo:OSM_forest . ?forest geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 . ?stream rdf:type y2geoo:OSM_stream . ?stream geo:hasGeometry ?o3 . ?o3 geo:asWKT ?geoWKT3 . FILTER (strdf:within(?geoWKT2, ?geoWKT1) && strdf:within(?geoWKT3, ?geoWKT1) && strdf:below(?geoWKT2, ?geoWKT3)) }}```\n","Human: How many streams intersect with lakes?\n","The generator must use these URIs to answer the question: ['rdf:type', 'y2geoo:OSM_stream', 'geo:hasGeometry', 'geo:asWKT', 'rdf:type', 'y2geoo:OSM_lake', 'geo:hasGeometry', 'geo:asWKT', 'geof:sfIntersects']\n","Generator: ```SELECT (COUNT (DISTINCT ?p1) as ?streams) WHERE {{ ?p1 rdf:type y2geoo:OSM_stream; geo:hasGeometry ?p1geo. ?p1geo geo:asWKT ?p1WKT. ?p2 rdf:type y2geoo:OSM_lake; geo:hasGeometry ?p2geo. ?p2geo geo:asWKT ?p2WKT. FILTER(geof:sfIntersects(?p1WKT, ?p2WKT)) }}```\n","Human: Which Municipalities are on Thessaly's border?\n","The generator must use these URIs to answer the question: ['yago:Thessaly', 'geo:hasGeometry', 'geo:asWKT', 'rdf:type', 'y2geoo:GAG_Municipality', 'geo:hasGeometry', 'geo:asWKT', 'strdf:touches']\n","Generator: ```SELECT distinct ?rg where {{ yago:Thessaly geo:hasGeometry ?tgeo . ?tgeo geo:asWKT ?tgWKT . ?rg rdf:type y2geoo:GAG_Municipality . ?rg geo:hasGeometry ?rggeo . ?rggeo geo:asWKT ?rgWKT . FILTER (strdf:touches(?tgWKT,?rgWKT)) . }}```\n","Human: {user_prompt}\n","The generator must use these URIs to answer the question: {uris}\n","Generator: ```\"\"\"\n","    return prompt\n","\n","def get_six_shot_uri_prompt(user_prompt, uris):\n","    prompt = f\"\"\"Generator is an expert SPARQL query generator. For each question that the user supplies, the generator will convert it into a valid SPARQL query that can be used to answer the question. The query will be based on the Yago2Geo knowledge graph. The query should be enclosed by three backticks on new lines, denoting that it is a code block.\n","    Human: In Breckland district, which forests are south of streams?\n","The generator must use these URIs to answer the question: ['yago:Breckland_District', 'geo:hasGeometry', 'geo:asWKT', 'rdf:type', 'y2geoo:OSM_forest', 'geo:hasGeometry', 'geo:asWKT', 'rdf:type', 'y2geoo:OSM_stream', 'geo:hasGeometry', 'geo:asWKT', 'strdf:within', 'strdf:within', 'strdf:below']\n","Generator: ```SELECT DISTINCT ?forest WHERE {{ yago:Breckland_District geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . ?forest rdf:type y2geoo:OSM_forest . ?forest geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 . ?stream rdf:type y2geoo:OSM_stream . ?stream geo:hasGeometry ?o3 . ?o3 geo:asWKT ?geoWKT3 . FILTER (strdf:within(?geoWKT2, ?geoWKT1) && strdf:within(?geoWKT3, ?geoWKT1) && strdf:below(?geoWKT2, ?geoWKT3)) }}```\n","Human: How many streams intersect with lakes?\n","The generator must use these URIs to answer the question: ['rdf:type', 'y2geoo:OSM_stream', 'geo:hasGeometry', 'geo:asWKT', 'rdf:type', 'y2geoo:OSM_lake', 'geo:hasGeometry', 'geo:asWKT', 'geof:sfIntersects']\n","Generator: ```SELECT (COUNT (DISTINCT ?p1) as ?streams) WHERE {{ ?p1 rdf:type y2geoo:OSM_stream; geo:hasGeometry ?p1geo. ?p1geo geo:asWKT ?p1WKT. ?p2 rdf:type y2geoo:OSM_lake; geo:hasGeometry ?p2geo. ?p2geo geo:asWKT ?p2WKT. FILTER(geof:sfIntersects(?p1WKT, ?p2WKT)) }}```\n","Human: Which Municipalities are on Thessaly's border?\n","The generator must use these URIs to answer the question: ['yago:Thessaly', 'geo:hasGeometry', 'geo:asWKT', 'rdf:type', 'y2geoo:GAG_Municipality', 'geo:hasGeometry', 'geo:asWKT', 'strdf:touches']\n","Generator: ```SELECT distinct ?rg where {{ yago:Thessaly geo:hasGeometry ?tgeo . ?tgeo geo:asWKT ?tgWKT . ?rg rdf:type y2geoo:GAG_Municipality . ?rg geo:hasGeometry ?rggeo . ?rggeo geo:asWKT ?rgWKT . FILTER (strdf:touches(?tgWKT,?rgWKT)) . }}```\n","Human: Which is the largest island in Ireland?\n","The generator must use these URIs to answer the question: ['strdf:area', 'yago:Republic_of_Ireland', 'geo:hasGeometry', 'geo:asWKT', 'y2geoo:OSM_island', 'geo:hasGeometry', 'geo:asWKT', 'geof:sfContains']\n","Generator: ```select distinct ?x (strdf:area(?lWKT) as ?area) where {{ yago:Republic_of_Ireland geo:hasGeometry ?geom . ?geom geo:asWKT ?mWKT . ?lake a y2geoo:OSM_island . ?lake geo:hasGeometry ?geol . ?geol geo:asWKT ?lWKT . FILTER (geof:sfContains(?mWKT, ?lWKT)) }} ORDER BY (?area) LIMIT 1```\n","Human: Is Crete south of Thessaly?\n","The generator must use these URIs to answer the question: ['http://yago-knowledge.org/resource/Crete', 'geo:hasGeometry', 'http://yago-knowledge.org/resource/Thessaly', 'geo:hasGeometry', 'geo:asWKT', 'geo:asWKT', 'strdf:below']\n","Generator: ```ASK {{ <http://yago-knowledge.org/resource/Crete> geo:hasGeometry ?geo1 . <http://yago-knowledge.org/resource/Thessaly> geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(strdf:below(?geoWKT1, ?geoWKT2)) }}```\n","Human: What is the population of Northern Ireland?\n","The generator must use these URIs to answer the question: ['xsd:integer', 'yago:Northern_Ireland', 'yago:hasPopulation']\n","Generator: ```SELECT (xsd:integer (?population) as ?pop) WHERE {{ yago:Northern_Ireland yago:hasPopulation ?population. }}\n","Human: {user_prompt}\n","The generator must use these URIs to answer the question: {uris}\n","Generator: ```\"\"\"\n","    \n","    return prompt\n","\n","def get_plain_three_shot_prompt(user_prompt):\n","    prompt = f\"\"\"Generator is an expert SPARQL query generator. For each question that the user supplies, the generator will convert it into a valid SPARQL query that can be used to answer the question. The query will be based on the DBpedia knowledge graph. The query should be enclosed by three backticks on new lines, denoting that it is a code block.\n","Human: In Breckland district, which forests are south of streams?\n","Generator: ```SELECT DISTINCT ?forest WHERE {{ yago:Breckland_District geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . ?forest rdf:type y2geoo:OSM_forest . ?forest geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 . ?stream rdf:type y2geoo:OSM_stream . ?stream geo:hasGeometry ?o3 . ?o3 geo:asWKT ?geoWKT3 . FILTER (strdf:within(?geoWKT2, ?geoWKT1) && strdf:within(?geoWKT3, ?geoWKT1) && strdf:below(?geoWKT2, ?geoWKT3)) }}```\n","Human: Is Crete south of Thessaly?\n","Generator: ```ASK {{ <http://yago-knowledge.org/resource/Crete> geo:hasGeometry ?geo1 . <http://yago-knowledge.org/resource/Thessaly> geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(strdf:below(?geoWKT1, ?geoWKT2)) }}```\n","Human: Which Municipalities are on Thessaly's border?\n","Generator: ```SELECT distinct ?rg where {{ yago:Thessaly geo:hasGeometry ?tgeo . ?tgeo geo:asWKT ?tgWKT . ?rg rdf:type y2geoo:GAG_Municipality . ?rg geo:hasGeometry ?rggeo . ?rggeo geo:asWKT ?rgWKT . FILTER (strdf:touches(?tgWKT,?rgWKT)) . }}```\n","Human: {user_prompt}\n","Generator: ```\"\"\"\n","    return prompt"]},{"cell_type":"code","execution_count":11,"metadata":{"execution":{"iopub.execute_input":"2024-09-17T10:47:06.179594Z","iopub.status.busy":"2024-09-17T10:47:06.179332Z","iopub.status.idle":"2024-09-17T10:47:06.194919Z","shell.execute_reply":"2024-09-17T10:47:06.193992Z","shell.execute_reply.started":"2024-09-17T10:47:06.179571Z"},"trusted":true},"outputs":[],"source":["def get_six_shot_auri_prompt(user_prompt, uris):\n","    prompt = f\"\"\"Human: In Breckland district, which forests are south of streams?\n","The generator may use these URIs to answer the question: ['yago:Breckland_District', 'y2geoo:OS_DistrictWard', 'y2geoo:OSM_forest', 'y2geoo:OSM_stream']\n","Generator: ```SELECT DISTINCT ?forest WHERE {{ yago:Breckland_District geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . ?forest rdf:type y2geoo:OSM_forest . ?forest geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 . ?stream rdf:type y2geoo:OSM_stream . ?stream geo:hasGeometry ?o3 . ?o3 geo:asWKT ?geoWKT3 . FILTER (strdf:within(?geoWKT2, ?geoWKT1) && strdf:within(?geoWKT3, ?geoWKT1) && strdf:below(?geoWKT2, ?geoWKT3)) }}```\n","Human: How many streams intersect with lakes?\n","The generator may use these URIs to answer the question: ['y2geoo:OSM_lake']\n","Generator: ```SELECT (COUNT (DISTINCT ?p1) as ?streams) WHERE {{ ?p1 rdf:type y2geoo:OSM_stream; geo:hasGeometry ?p1geo. ?p1geo geo:asWKT ?p1WKT. ?p2 rdf:type y2geoo:OSM_lake; geo:hasGeometry ?p2geo. ?p2geo geo:asWKT ?p2WKT. FILTER(geof:sfIntersects(?p1WKT, ?p2WKT)) }}```\n","Human: Which Municipalities are on Thessaly's border?\n","The generator may use these URIs to answer the question: []\n","Generator: ```SELECT distinct ?rg where {{ yago:Thessaly geo:hasGeometry ?tgeo . ?tgeo geo:asWKT ?tgWKT . ?rg rdf:type y2geoo:GAG_Municipality . ?rg geo:hasGeometry ?rggeo . ?rggeo geo:asWKT ?rgWKT . FILTER (strdf:touches(?tgWKT,?rgWKT)) . }}```\n","Human: Which is the largest island in Ireland?\n","The generator may use these URIs to answer the question: ['y2geoo:OSM_island', 'y2geoo:OSM_stream']\n","Generator: ```select distinct ?x (strdf:area(?lWKT) as ?area) where {{ yago:Republic_of_Ireland geo:hasGeometry ?geom . ?geom geo:asWKT ?mWKT . ?lake a y2geoo:OSM_island . ?lake geo:hasGeometry ?geol . ?geol geo:asWKT ?lWKT . FILTER (geof:sfContains(?mWKT, ?lWKT)) }} ORDER BY (?area) LIMIT 1```\n","Human: Is Crete south of Thessaly?\n","The generator may use these URIs to answer the question: []\n","Generator: ```ASK {{ yago:Crete geo:hasGeometry ?geo1 . yago:Thessaly geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(strdf:below(?geoWKT1, ?geoWKT2)) }}```\n","Human: What is the population of Northern Ireland?\n","The generator may use these URIs to answer the question: ['yago:Ireland']\n","Generator: ```SELECT (xsd:integer (?population) as ?pop) WHERE {{ yago:Northern_Ireland yago:'hasPopulation ?population. }}```\n","Human: {user_prompt}\n","The generator may use these URIs to answer the question: {uris}\n","Generator: ```\"\"\"\n","    \n","    return prompt\n","\n","def get_plain_six_shot_prompt(prompt):\n","    prompt = f\"\"\"Human: In Breckland district, which forests are south of streams?\n","Generator: ```SELECT DISTINCT ?forest WHERE {{ yago:Breckland_District geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . ?forest rdf:type y2geoo:OSM_forest . ?forest geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 . ?stream rdf:type y2geoo:OSM_stream . ?stream geo:hasGeometry ?o3 . ?o3 geo:asWKT ?geoWKT3 . FILTER (strdf:within(?geoWKT2, ?geoWKT1) && strdf:within(?geoWKT3, ?geoWKT1) && strdf:below(?geoWKT2, ?geoWKT3)) }}```\n","Human: How many streams intersect with lakes?\n","Generator: ```SELECT (COUNT (DISTINCT ?p1) as ?streams) WHERE {{ ?p1 rdf:type y2geoo:OSM_stream; geo:hasGeometry ?p1geo. ?p1geo geo:asWKT ?p1WKT. ?p2 rdf:type y2geoo:OSM_lake; geo:hasGeometry ?p2geo. ?p2geo geo:asWKT ?p2WKT. FILTER(geof:sfIntersects(?p1WKT, ?p2WKT)) }}```\n","Human: Which Municipalities are on Thessaly's border?\n","Generator: ```SELECT distinct ?rg where {{ yago:Thessaly geo:hasGeometry ?tgeo . ?tgeo geo:asWKT ?tgWKT . ?rg rdf:type y2geoo:GAG_Municipality . ?rg geo:hasGeometry ?rggeo . ?rggeo geo:asWKT ?rgWKT . FILTER (strdf:touches(?tgWKT,?rgWKT)) . }}```\n","Human: Which is the largest island in Ireland?\n","Generator: ```select distinct ?x (strdf:area(?lWKT) as ?area) where {{ yago:Republic_of_Ireland geo:hasGeometry ?geom . ?geom geo:asWKT ?mWKT . ?lake a y2geoo:OSM_island . ?lake geo:hasGeometry ?geol . ?geol geo:asWKT ?lWKT . FILTER (geof:sfContains(?mWKT, ?lWKT)) }} ORDER BY (?area) LIMIT 1```\n","Human: Is Crete south of Thessaly?\n","Generator: ```ASK {{ <http://yago-knowledge.org/resource/Crete> geo:hasGeometry ?geo1 . <http://yago-knowledge.org/resource/Thessaly> geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(strdf:below(?geoWKT1, ?geoWKT2)) }}```\n","Human: What is the population of Northern Ireland?\n","Generator: ```SELECT (xsd:integer (?population) as ?pop) WHERE {{ yago:Northern_Ireland yago:'hasPopulation ?population. }}```\n","Human: {prompt}\n","Generator: ```\"\"\"\n","    \n","    return prompt    "]},{"cell_type":"code","execution_count":12,"metadata":{"execution":{"iopub.execute_input":"2024-09-17T10:47:06.196866Z","iopub.status.busy":"2024-09-17T10:47:06.196133Z","iopub.status.idle":"2024-09-17T10:47:06.209284Z","shell.execute_reply":"2024-09-17T10:47:06.208466Z","shell.execute_reply.started":"2024-09-17T10:47:06.196834Z"},"trusted":true},"outputs":[],"source":["# Run inference and cleanup.\n","def generate_URI_injected_query(model, tokenizer, user_prompt, gt_query, auris=None):\n","    # Direct extraction, NOTE: try expanded extraction.\n","#     uris = extract_uris(gt_query)\n","    \n","    prompt = get_six_shot_auri_prompt(user_prompt, auris)\n","    \n","#     results = run_chat_inference_llama(model, tokenizer, role, prompt)\n","    results = run_inference(model, tokenizer, prompt)\n","    query = results\n","#     start_index = results.find(\"```\")\n","    \n","#     # Extract the substring from the start of the string up to the first occurrence of ```\n","#     if start_index != -1:\n","#         query = query[start_index+3:]\n","#     else:\n","#         # If ``` is not found, keep the original string\n","#         query = query\n","\n","    end_index = query.find(\"```\")\n","    \n","    # Extract the substring from the start of the string up to the first occurrence of ```\n","    if end_index != -1:\n","        query = query[:end_index]\n","    else:\n","        # If ``` is not found, keep the original string\n","        query = query\n","        \n","    # Now remove the SPARQL prefix that the model adds.\n","    start_index = query.find(\"SPARQL\")\n","    if start_index == 0:\n","        # Remove the prefix and all characters leading up to it\n","        query = query[start_index + len(\"SPARQL\"):]\n","    \n","     # For llama 3 add spaces before the punctiations.\n","#     query = insert_space_before_punctuation(query)\n","    print(query)\n","    return query"]},{"cell_type":"code","execution_count":13,"metadata":{"execution":{"iopub.execute_input":"2024-09-17T10:47:06.210609Z","iopub.status.busy":"2024-09-17T10:47:06.210290Z","iopub.status.idle":"2024-09-17T10:47:06.220808Z","shell.execute_reply":"2024-09-17T10:47:06.220051Z","shell.execute_reply.started":"2024-09-17T10:47:06.210584Z"},"trusted":true},"outputs":[],"source":["# Run inference and cleanup.\n","def generate_query(model, tokenizer, user_prompt):\n","    # Direct extraction, NOTE: try expanded extraction.\n","    prompt = get_plain_six_shot_prompt(user_prompt)\n","    \n","#     results = run_chat_inference_llama(model, tokenizer, role, prompt)\n","    results = run_inference(model, tokenizer, prompt)\n","    query = results\n","#     start_index = results.find(\"```\")\n","    \n","#     # Extract the substring from the start of the string up to the first occurrence of ```\n","#     if start_index != -1:\n","#         query = query[start_index+3:]\n","#     else:\n","#         # If ``` is not found, keep the original string\n","#         query = query\n","\n","    end_index = query.find(\"```\")\n","    \n","    # Extract the substring from the start of the string up to the first occurrence of ```\n","    if end_index != -1:\n","        query = query[:end_index]\n","    else:\n","        # If ``` is not found, keep the original string\n","        query = query\n","        \n","    # Now remove the SPARQL prefix that the model adds.\n","    start_index = query.find(\"SPARQL\")\n","    if start_index == 0:\n","        # Remove the prefix and all characters leading up to it\n","        query = query[start_index + len(\"SPARQL\"):]\n","    \n","     # For llama 3 add spaces before the punctiations.\n","#     query = insert_space_before_punctuation(query)\n","    print(query)\n","    return query"]},{"cell_type":"code","execution_count":14,"metadata":{"execution":{"iopub.execute_input":"2024-09-17T10:47:06.224524Z","iopub.status.busy":"2024-09-17T10:47:06.224264Z","iopub.status.idle":"2024-09-17T10:47:06.233975Z","shell.execute_reply":"2024-09-17T10:47:06.233202Z","shell.execute_reply.started":"2024-09-17T10:47:06.224503Z"},"trusted":true},"outputs":[],"source":["# Llama 3 version\n","def generate_URI_injected_query_quantized(model, tokenizer, user_prompt, gt_query):\n","    # Direct extraction, NOTE: try expanded extraction.\n","    uris = extract_uris(gt_query)\n","    \n","    prompt = get_six_shot_uri_prompt(user_prompt, uris)\n","    \n","    #results = run_inference(model, tokenizer, prompt)\n","    results = Quantized_Inference(model, tokenizer, prompt)\n","    end_index = results.find(\"```\")\n","    query = results\n","    # Extract the substring from the start of the string up to the first occurrence of ```\n","    if end_index != -1:\n","        query = query[:end_index]\n","    else:\n","        # If ``` is not found, keep the original string\n","        query = query\n","    # Now remove the SPARQL prefix that the model adds.\n","    start_index = query.find(\"SPARQL\")\n","    if start_index == 0:\n","        # Remove the prefix and all characters leading up to it\n","        query = query[start_index + len(\"SPARQL\"):]\n","\n","    # For llama 3 add spaces before the punctiations.\n","    query = insert_space_before_punctuation(query)\n","    print(query)\n","    return query"]},{"cell_type":"markdown","metadata":{},"source":["Normalize queries before passing them to the endpoint to ensure uniformity across results."]},{"cell_type":"code","execution_count":15,"metadata":{"execution":{"iopub.execute_input":"2024-09-17T10:47:06.235250Z","iopub.status.busy":"2024-09-17T10:47:06.234962Z","iopub.status.idle":"2024-09-17T10:47:06.248474Z","shell.execute_reply":"2024-09-17T10:47:06.247625Z","shell.execute_reply.started":"2024-09-17T10:47:06.235217Z"},"trusted":true},"outputs":[],"source":["def normalize_variables(query):\n","    if query is None:\n","        return \"\"\n","    variable_pattern = re.compile(r\"\\?\\w+\")\n","    variables = variable_pattern.findall(query)\n","    normalized_query = query\n","    for i, var in enumerate(variables):\n","        normalized_query = normalized_query.replace(var, f\"?var{i}\")\n","    return normalized_query"]},{"cell_type":"markdown","metadata":{},"source":["To further ensure that correct results are not rejected, this custom comparisson function: "]},{"cell_type":"code","execution_count":16,"metadata":{"execution":{"iopub.execute_input":"2024-09-17T10:47:06.250411Z","iopub.status.busy":"2024-09-17T10:47:06.249550Z","iopub.status.idle":"2024-09-17T10:47:06.258193Z","shell.execute_reply":"2024-09-17T10:47:06.257310Z","shell.execute_reply.started":"2024-09-17T10:47:06.250386Z"},"trusted":true},"outputs":[],"source":["def csv_to_columns(csv_data):\n","    rows = csv_data.strip().split('\\n')\n","    data_rows = [row.split(',') for row in rows[1:]]  # Skip the header row\n","    columns = list(zip(*data_rows))  # Transpose rows to columns\n","    return columns\n","\n","def compare_csv_columns(csv1, csv2):\n","    columns1 = csv_to_columns(csv1)\n","    columns2 = csv_to_columns(csv2)\n","    \n","    set_columns1 = {tuple(col) for col in columns1}\n","    set_columns2 = {tuple(col) for col in columns2}\n","    \n","    #return not set_columns1.isdisjoint(set_columns2)\n","    \n","    common_columns = set_columns1.intersection(set_columns2)\n","    \n","    if common_columns:\n","        return True\n","    else:\n","        return False"]},{"cell_type":"markdown","metadata":{},"source":["Load mistral."]},{"cell_type":"code","execution_count":17,"metadata":{"execution":{"iopub.execute_input":"2024-09-17T10:47:06.260120Z","iopub.status.busy":"2024-09-17T10:47:06.259320Z","iopub.status.idle":"2024-09-17T10:49:06.345833Z","shell.execute_reply":"2024-09-17T10:49:06.343003Z","shell.execute_reply.started":"2024-09-17T10:47:06.260094Z"},"trusted":true},"outputs":[{"data":{"application/vnd.jupyter.widget-view+json":{"model_id":"cc34411fe6054e6781578e045d615b5c","version_major":2,"version_minor":0},"text/plain":["config.json:   0%|          | 0.00/596 [00:00<?, ?B/s]"]},"metadata":{},"output_type":"display_data"},{"data":{"application/vnd.jupyter.widget-view+json":{"model_id":"469f80aec7644391a605559ae657e1cf","version_major":2,"version_minor":0},"text/plain":["model.safetensors.index.json:   0%|          | 0.00/23.9k [00:00<?, ?B/s]"]},"metadata":{},"output_type":"display_data"},{"data":{"application/vnd.jupyter.widget-view+json":{"model_id":"931980b9105447338311c005b70ad6f9","version_major":2,"version_minor":0},"text/plain":["Downloading shards:   0%|          | 0/3 [00:00<?, ?it/s]"]},"metadata":{},"output_type":"display_data"},{"data":{"application/vnd.jupyter.widget-view+json":{"model_id":"98600e9aa6014a8ebb2378e0cd6d36e0","version_major":2,"version_minor":0},"text/plain":["model-00001-of-00003.safetensors:   0%|          | 0.00/4.94G [00:00<?, ?B/s]"]},"metadata":{},"output_type":"display_data"},{"data":{"application/vnd.jupyter.widget-view+json":{"model_id":"2bddb1c4194e45a78e8940fc885619a2","version_major":2,"version_minor":0},"text/plain":["model-00002-of-00003.safetensors:   0%|          | 0.00/5.00G [00:00<?, ?B/s]"]},"metadata":{},"output_type":"display_data"},{"data":{"application/vnd.jupyter.widget-view+json":{"model_id":"3ecbcb8aca954b0fbd2801f5455f5cb5","version_major":2,"version_minor":0},"text/plain":["model-00003-of-00003.safetensors:   0%|          | 0.00/4.54G [00:00<?, ?B/s]"]},"metadata":{},"output_type":"display_data"},{"data":{"application/vnd.jupyter.widget-view+json":{"model_id":"b7e70b9aaf834fab9d652727a335a131","version_major":2,"version_minor":0},"text/plain":["Loading checkpoint shards:   0%|          | 0/3 [00:00<?, ?it/s]"]},"metadata":{},"output_type":"display_data"},{"data":{"application/vnd.jupyter.widget-view+json":{"model_id":"a54b10a8aa5746d9a4e80756ad2e13a8","version_major":2,"version_minor":0},"text/plain":["generation_config.json:   0%|          | 0.00/111 [00:00<?, ?B/s]"]},"metadata":{},"output_type":"display_data"},{"data":{"application/vnd.jupyter.widget-view+json":{"model_id":"b8e39fbbae444bd1a860c942629c094c","version_major":2,"version_minor":0},"text/plain":["tokenizer_config.json:   0%|          | 0.00/960 [00:00<?, ?B/s]"]},"metadata":{},"output_type":"display_data"},{"data":{"application/vnd.jupyter.widget-view+json":{"model_id":"d37abb2aa9964015b821332dbdbf1fff","version_major":2,"version_minor":0},"text/plain":["tokenizer.model:   0%|          | 0.00/493k [00:00<?, ?B/s]"]},"metadata":{},"output_type":"display_data"},{"data":{"application/vnd.jupyter.widget-view+json":{"model_id":"c287192d98ca4de9b0297b1b25177c9b","version_major":2,"version_minor":0},"text/plain":["tokenizer.json:   0%|          | 0.00/1.80M [00:00<?, ?B/s]"]},"metadata":{},"output_type":"display_data"},{"data":{"application/vnd.jupyter.widget-view+json":{"model_id":"d6b76ad1bf47475cafc168ec68875a30","version_major":2,"version_minor":0},"text/plain":["special_tokens_map.json:   0%|          | 0.00/414 [00:00<?, ?B/s]"]},"metadata":{},"output_type":"display_data"}],"source":["from transformers import AutoModelForCausalLM, AutoTokenizer, AutoModel\n","\n","model = AutoModelForCausalLM.from_pretrained(\"alpindale/Mistral-7B-v0.2-hf\", torch_dtype=torch.float16)\n","from transformers import AutoModelForCausalLM, AutoTokenizer, AutoModel\n","tokenizer = AutoTokenizer.from_pretrained(\"alpindale/Mistral-7B-v0.2-hf\")"]},{"cell_type":"markdown","metadata":{},"source":["Mistral IT"]},{"cell_type":"code","execution_count":18,"metadata":{"execution":{"iopub.execute_input":"2024-09-17T10:49:06.349892Z","iopub.status.busy":"2024-09-17T10:49:06.349249Z","iopub.status.idle":"2024-09-17T10:49:06.358485Z","shell.execute_reply":"2024-09-17T10:49:06.357602Z","shell.execute_reply.started":"2024-09-17T10:49:06.349842Z"},"trusted":true},"outputs":[],"source":["# from transformers import AutoModelForCausalLM, AutoTokenizer, AutoModel\n","\n","# model = AutoModelForCausalLM.from_pretrained(\"mistralai/Mistral-7B-Instruct-v0.2\", torch_dtype=torch.float16)\n","# tokenizer = AutoTokenizer.from_pretrained(\"mistralai/Mistral-7B-Instruct-v0.2\")"]},{"cell_type":"markdown","metadata":{},"source":["Load 8 bit llama 3 8b instruct"]},{"cell_type":"code","execution_count":19,"metadata":{"execution":{"iopub.execute_input":"2024-09-17T10:49:06.360486Z","iopub.status.busy":"2024-09-17T10:49:06.360103Z","iopub.status.idle":"2024-09-17T10:49:06.377344Z","shell.execute_reply":"2024-09-17T10:49:06.376112Z","shell.execute_reply.started":"2024-09-17T10:49:06.360451Z"},"trusted":true},"outputs":[],"source":["# !pip install accelerate\n","# !pip install -i https://pypi.org/simple/ bitsandbytes"]},{"cell_type":"code","execution_count":20,"metadata":{"execution":{"iopub.execute_input":"2024-09-17T10:49:06.378809Z","iopub.status.busy":"2024-09-17T10:49:06.378457Z","iopub.status.idle":"2024-09-17T10:49:06.388646Z","shell.execute_reply":"2024-09-17T10:49:06.387408Z","shell.execute_reply.started":"2024-09-17T10:49:06.378774Z"},"trusted":true},"outputs":[],"source":["# # NOTE: If this crashes because accellerate or bits and bytes is not installed properly restart and clear shell outputs.\n","# # Load model directly\n","# from transformers import AutoTokenizer, AutoModelForCausalLM\n","\n","# tokenizer = AutoTokenizer.from_pretrained(\"meta-llama/Meta-Llama-3-8B-Instruct\")\n","# model = AutoModelForCausalLM.from_pretrained(\"meta-llama/Meta-Llama-3-8B-Instruct\", device_map=\"auto\", load_in_8bit=True)"]},{"cell_type":"markdown","metadata":{},"source":["8bit llama 3 8b"]},{"cell_type":"code","execution_count":21,"metadata":{"execution":{"iopub.execute_input":"2024-09-17T10:49:06.390487Z","iopub.status.busy":"2024-09-17T10:49:06.389955Z","iopub.status.idle":"2024-09-17T10:49:06.400005Z","shell.execute_reply":"2024-09-17T10:49:06.399074Z","shell.execute_reply.started":"2024-09-17T10:49:06.390454Z"},"trusted":true},"outputs":[],"source":["# !pip install accelerate\n","# !pip install -i https://pypi.org/simple/ bitsandbytes\n","    \n","# # Load model directly\n","# from transformers import AutoTokenizer, AutoModelForCausalLM\n","\n","# tokenizer = AutoTokenizer.from_pretrained(\"meta-llama/Meta-Llama-3-8B\")\n","# model = AutoModelForCausalLM.from_pretrained(\"meta-llama/Meta-Llama-3-8B\", device_map=\"auto\", load_in_8bit=True)"]},{"cell_type":"markdown","metadata":{},"source":["Load gemma 2b"]},{"cell_type":"code","execution_count":22,"metadata":{"execution":{"iopub.execute_input":"2024-09-17T10:49:06.401439Z","iopub.status.busy":"2024-09-17T10:49:06.401081Z","iopub.status.idle":"2024-09-17T10:49:06.411141Z","shell.execute_reply":"2024-09-17T10:49:06.409875Z","shell.execute_reply.started":"2024-09-17T10:49:06.401404Z"},"trusted":true},"outputs":[],"source":["# # Load model directly\n","# from transformers import AutoTokenizer, AutoModelForCausalLM\n","\n","# tokenizer = AutoTokenizer.from_pretrained(\"google/gemma-2b\")\n","# model = AutoModelForCausalLM.from_pretrained(\"google/gemma-2b\", device_map=\"auto\", torch_dtype=torch.float32)"]},{"cell_type":"markdown","metadata":{},"source":["Inference with GPT-4 Turbo."]},{"cell_type":"code","execution_count":23,"metadata":{"execution":{"iopub.execute_input":"2024-09-17T10:49:06.412751Z","iopub.status.busy":"2024-09-17T10:49:06.412413Z","iopub.status.idle":"2024-09-17T10:49:06.422173Z","shell.execute_reply":"2024-09-17T10:49:06.421334Z","shell.execute_reply.started":"2024-09-17T10:49:06.412718Z"},"trusted":true},"outputs":[],"source":["# # Install the openai library if it's not already installed\n","# !pip install openai\n","\n","# import openai\n","\n","# def generate_response(prompt):\n","#     # Set your OpenAI API key here\n","    \n","#     response = openai.ChatCompletion.create(\n","#         model=\"gpt-4o-mini\",\n","#         messages=[\n","#             {\"role\": \"system\", \"content\": \"You are a helpful assistant.\"},\n","#             {\"role\": \"user\", \"content\": prompt}\n","#         ],\n","#         max_tokens=150,\n","#         n=1,\n","#         stop=None,\n","#         temperature=0.7,\n","#     )\n","    \n","#     return response.choices[0].message['content']\n","\n","# # Example usage\n","# prompt = \"Generate a SPARQL query to retrieve the names and birthdates of authors who have written more than 3 books.\"\n","# result = generate_response(prompt)\n","# print(result)\n"]},{"cell_type":"markdown","metadata":{},"source":["concepts: 0.14"]},{"cell_type":"code","execution_count":24,"metadata":{"execution":{"iopub.execute_input":"2024-09-17T10:49:06.423500Z","iopub.status.busy":"2024-09-17T10:49:06.423233Z","iopub.status.idle":"2024-09-17T12:25:18.073178Z","shell.execute_reply":"2024-09-17T12:25:18.071992Z","shell.execute_reply.started":"2024-09-17T10:49:06.423478Z"},"trusted":true},"outputs":[{"name":"stdout","output_type":"stream","text":["0\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT (MAX(?a) AS ?maxArea) WHERE { yago:Greece geo:hasGeometry ?greekGeom . ?greekGeom geo:asWKT ?wkt . ?park rdf:type y2geoo:OSM_park ; geo:hasGeometry ?parkGeom . ?parkGeom geo:asWKT ?parkWkt . FILTER(strdf:contains(?wkt, ?parkWkt)) . BIND(STRDF:AREA(?parkWkt) AS ?a)} GROUP BY ?park\n","Materialize failed: {\"timestamp\":\"2024-09-17T10:50:09.398+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\n","HTTP error (most likely invalid query)\n","1\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT DISTINCT ?district ?woodland WHERE { yago:Staffordshire geo:hasGeometry ?staffGeom . ?staffGeom geo:asWKT ?staffWKT . ?district rdf:type y2geoo:OS_District ; geo:hasGeometry ?distGeom . ?distGeom geo:asWKT ?distWKT . ?woodland rdf:type y2geoo:OSM_woodland ; geo:hasGeometry ?wooGeom . ?wooGeom geo:asWKT ?wooWKT . FILTER (strdf:within(?distWKT, ?staffWKT) && strdf:above(?wooWKT, ?distWKT)) }\n","URI: 0\n","2\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["ASK { yago:London geo:hasGeometry ?geo1 . yago:Edinburgh geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(strdf:above(?geoWKT1, ?geoWKT2)) }\n","URI: 0\n","3\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT ((count(distinct ?lg) * 100)/(count(distinct ?th))) AS ?percentage WHERE { yago:Thrace geo:hasGeometry ?thgeo . ?thgeo geo:asWKT ?thWKT . ?lg rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?lggeo . ?lggeo geo:asWKT ?lgWKT . FILTER (strdf:contains(?thWKT, ?lgWKT)) }\n","Materialize failed: {\"timestamp\":\"2024-09-17T10:53:08.807+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\n","HTTP error (most likely invalid query)\n","4\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT distinct ?tl where { yago:Dublin geo:hasGeometry ?dgeo . ?dgeo geo:asWKT ?dgWKT . ?tl rdf:type y2geoo:OSNI_Townland . ?tl geo:hasGeometry ?tlgeo . ?tlgeo geo:asWKT ?tlWKT . FILTER (strdf:touches(?dgWKT,?tlWKT)) . }\n","URI: 0\n","5\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT (count(distinct ?b) AS ?beachCount) WHERE { ?b rdf:type y2geoo:OSM_beach ; geo:hasGeometry ?bGeom . ?br rdf:type y2geoo:OSM_nature_reserve ; geo:hasGeometry ?brGeom . FILTER(geof:sfOverlap(?bGeom, ?brGeom)) }\n","HTTP error (most likely invalid query)\n","6\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT * WHERE { yago:Swansea geo:hasGeometry ?swanGeom . ?swanGeom geo:asWKT ?wkt . }\n","URI: 1\n","7\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT (xsd:integer (?population) as ?pop) WHERE { yago:Kallithea_F.C. yago:'hasPopulation ?population. }\n","Materialize failed: {\"timestamp\":\"2024-09-17T10:56:49.960+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\n","HTTP error (most likely invalid query)\n","8\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT DISTINCT ?region WHERE { yago:Greece geo:hasGeometry ?greekGeom . ?greekGeom geo:asWKT ?wkt . ?region rdf:type y2geoo:GAG_Region . ?region geo:hasGeometry ?regGeom . ?regGeom geo:asWKT ?rWkt . FILTER(strdf:contains(?wkt, ?rWkt)) . FILTER(strdf:between(?pop, xsd:int(\"500000\"), xsd:int(\"1000000\"))) }\n","HTTP error (most likely invalid query)\n","9\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT DISTINCT ?gagmu WHERE { yago:Central_Athens_Regional_Unit geo:hasGeometry ?centralathensgwkt . ?centralathensgwkt geo:asWKT ?centralathenswktt . ?gagmu rdf:type y2geoo:GAG_Municipality . ?gagmu geo:hasGeometry ?gagmugwkt . ?gagmugwkt geo:asWKT ?gagmuwktt . FILTER (strdf:contains(?centralathenswktt, ?gagmuwktt)) }\n","URI: 1\n","10\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT DISTINCT ?town WHERE { yago:Thrace geo:hasGeometry ?thraceGeo . ?thraceGeo geo:asWKT ?thraceWKT . ?town rdf:type y2geoo:OSM_town . ?town geo:hasGeometry ?townGeo . ?townGeo geo:asWKT ?townWKT . ?lake rdf:type y2geoo:OSM_lake . ?lake geo:hasGeometry ?lakeGeo . ?lakeGeo geo:asWKT ?lakeWKT . FILTER (strdf:westOf(?townWKT, ?lakeWKT)) }\n","URI: 1\n","11\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT (count(distinct ?f) AS ?numForests) WHERE { ?f rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?fg . ?g rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?gl . FILTER(geof:sfWithinDistance(?fg, ?gl, 0.5)) }\n","HTTP error (most likely invalid query)\n","12\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT (count(distinct ?c) AS ?numLakes) WHERE { ?c rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?g1 . ?f rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?g2 . ?g1 geo:intersects ?g2 . } GROUP BY ?c\n","URI: 1\n","13\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["ASK { yago:Manchester geo:hasGeometry ?manGeom . yago:Liverpool geo:hasGeometry ?livGeom . ?manGeom geo:asWKT ?manWKT . ?livGeom geo:asWKT ?livWKT . FILTER(geof:sfDistance(?manWKT, ?livWKT) < xsd:double(\"40\"))} \n","HTTP error (most likely invalid query)\n","14\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["ASK { yago:Cardiff geo:hasGeometry ?cardiffGeom . yago:Birmingham geo:hasGeometry ?bhamGeom . ?cardiffGeom geo:asWKT ?cardiffWKT . ?bhamGeom geo:asWKT ?bhamWKT . FILTER(strdf:adjacentTo(?cardiffWKT, ?bhamWKT)) }\n","HTTP error (most likely invalid query)\n","15\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT * WHERE { yago:County_Leitrim geo:hasGeometry ?leitrimGeom . ?leitrimGeom geo:asWKT ?leitrimWKT . yago:Ireland geo:hasGeometry ?irelandGeom . ?irelandGeom geo:asWKT ?irelandWKT . yago:Republic_of_Ireland geo:hasGeometry ?roiGeom . ?roiGeom geo:asWKT ?roiWKT . y2geoo:OS_County geo:hasGeometry ?countiesGeom . ?countiesGeom geo:asWKT ?countiesWKT . FILTER(strdf:contains(?leitrimWKT, ?countiesWKT) && strdf:contains(?irelandWKT, ?roiWKT) && strdf:contains(?roiWKT, ?countiesWKT)) }\n","URI: 1\n","16\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT MIN(?a) AS ?min WHERE { yago:England geo:hasGeometry ?eGeom . ?eGeom geo:asWKT ?engWKT . ?lake a y2geoo:OSM_lake ; geo:hasGeometry ?lgGeom . ?lgGeom geo:asWKT ?lwkt . FILTER(geof:sfWithin(?engWKT, ?lwkt)) . BIND(STRDF:AREA(?lwkt) AS ?a)}\n","Materialize failed: {\"timestamp\":\"2024-09-17T11:06:03.887+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\n","HTTP error (most likely invalid query)\n","17\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["ASK { yago:Doolin geo:hasGeometry ?doolinGeom . yago:Dublin geo:hasGeometry ?dublinGeom . ?doolinGeom geo:asWKT ?doolinWKT . ?dublinGeom geo:asWKT ?dublinWKT . FILTER(strdf:below(?doolinWKT, ?dublinWKT)) }\n","URI: 2\n","18\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["ask{ yago:Dublin geo:hasGeometry ?dublinGeom . yago:Arklow geo:hasGeometry ?arklowGeom . ?dublinGeom geo:asWKT ?dublinWKT . ?arklowGeom geo:asWKT ?arklowWKT . FILTER(geof:sfDistance(?dublinWKT, ?arklowWKT)>10000)}\n","HTTP error (most likely invalid query)\n","19\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT DISTINCT ?bay WHERE { yago:Ireland geo:hasGeometry ?iGeom . ?iGeom geo:asWKT ?iWKT . ?bay rdf:type y2geoo:OSM_bay . ?bay geo:hasGeometry ?bGeom . ?bGeom geo:asWKT ?bWKT . ?park rdf:type y2geoo:OSM_park . ?park geo:hasGeometry ?pGeom . ?pGeom geo:asWKT ?pWKT . FILTER (strdf:eastOf(?bWKT, ?pWKT)) }\n","URI: 2\n","20\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["ASK { yago:Kent geo:hasGeometry ?kentGeom . yago:Norfolk geo:hasGeometry ?norfolkGeom . ?kentGeom geo:asWKT ?kentWKT . ?norfolkGeom geo:asWKT ?norfolkWKT . FILTER(strdf:westOf(?kentWKT, ?norfolkWKT)) }\n","HTTP error (most likely invalid query)\n","21\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["ASK{ yago:Hertfordshire geo:hasGeometry ?hg . yago:Essex geo:hasGeometry ?eg . ?hg geo:asWKT ?hWKT . ?eg geo:asWKT ?eWKT . FILTER(strdf:intersects(?hWKT, ?eWKT)) }\n","URI: 3\n","22\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT DISTINCT ?barony ?forest WHERE { yago:Ireland geo:hasGeometry ?iGeom . ?iGeom geo:asWKT ?iWKT . ?barony rdf:type y2geoo:OSI_Barony . ?barony geo:hasGeometry ?bGeom . ?bGeom geo:asWKT ?bWKT . ?forest rdf:type y2geoo:OSM_forest . ?forest geo:hasGeometry ?fGeom . ?fGeom geo:asWKT ?fWKT . FILTER (strdf:contains(?iWKT, ?bWKT) && strdf:within(?fWKT, ?bWKT)) }\n","URI: 3\n","23\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT (count(distinct ?c) AS ?num) WHERE { yago:Wales geo:hasGeometry ?wgeo . ?wgeo geo:asWKT ?wgWKT . ?c rdf:type y2geoo:OSM_city . ?c geo:hasGeometry ?cg . ?cg geo:asWKT ?cgWKT . ?s rdf:type y2geoo:OSM_stream . ?s geo:hasGeometry ?sg . ?sg geo:asWKT ?sgWKT . FILTER (strdf:above(?cgWKT, ?sgWKT)) . FILTER (strdf:contains(?wgWKT, ?cgWKT)) }\n","URI: 4\n","24\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT DISTINCT ?c1 ?c2 ?county ?stream WHERE { yago:Ireland geo:hasGeometry ?iGeom . ?iGeom geo:asWKT ?iWKT . ?c1 rdf:type y2geoo:OS_County ; geo:hasGeometry ?c1Geom . ?c1Geom geo:asWKT ?c1WKT . ?c2 rdf:type y2geoo:OS_County ; geo:hasGeometry ?c2Geom . ?c2Geom geo:asWKT ?c2WKT . ?county rdf:type y2geoo:OS_County ; geo:hasGeometry ?countyGeom . ?countyGeom geo:asWKT ?countyWKT . ?stream rdf:type y2geoo:OSM_stream ; geo:hasGeometry ?streamGeom . ?streamGeom geo:asWKT ?streamWKT . FILTER(strdf:intersects(?iWKT, ?c1WKT) || strdf:intersects(?iWKT, ?c2WKT) ) FILTER(strdf:contains(?c1WKT, ?countyWKT) || strdf:contains(?c2WKT, ?countyWKT) ) FILTER(strdf:crosses(?streamWKT, ?countyWKT)) }\n","URI: 4\n","25\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["ASK { yago:Athens geo:hasGeometry ?geo1 . yago:Manchester geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(strdf:above(?geoWKT1, ?geoWKT2)) }\n","URI: 4\n","26\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT (count(distinct ?c) AS ?crossingCount) WHERE { yago:Oxford geo:hasGeometry ?oxfGeom . ?oxfGeom geo:asWKT ?oxfWKT . ?cr rdf:type y2geoo:OSM_stream ; geo:hasGeometry ?crGeom . ?crGeom geo:asWKT ?crWKT . ?nr rdf:type y2geoo:OSM_nature_reserve ; geo:hasGeometry ?nrGeom . ?nrGeom geo:asWKT ?nrWKT . FILTER(geof:sfIntersects(?oxfWKT, ?nrWKT)) . FILTER(geof:sfIntersects(?crWKT, ?nrWKT)) . } GROUP BY ?nr\n","URI: 4\n","27\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT DISTINCT ?m WHERE { yago:Central_Athens_Regional_Unit geo:hasGeometry ?rgeo . ?rgeo geo:asWKT ?regWKT . ?m rdf:type y2geoo:GAG_Municipality ; geo:hasGeometry ?mg . ?mg geo:asWKT ?mWKT . ?m yago:hasResidentCount ?residents . ?m yago:contains ?parks . ?parks rdf:type y2geoo:OSM_park . FILTER (strdf:within(?regWKT, ?mWKT) && xsd:integer(?residents) < 50000 ) }\n","URI: 4\n","28\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT (strdf:area(?aPondGeom) AS ?totalArea) WHERE { yago:Andover,_Massachusetts geo:hasGeometry ?andoverGeom . ?andoverGeom geo:asWKT ?andoverWKT . ?pond rdf:type y2geoo:OSM_waterway ; geo:hasGeometry ?pondGeom . ?pondGeom geo:asWKT ?pondWKT . FILTER(strdf:contains(?andoverWKT, ?pondWKT)) . BIND(?pondGeom AS ?aPondGeom)}\n","Materialize failed: {\"timestamp\":\"2024-09-17T11:17:21.755+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\n","HTTP error (most likely invalid query)\n","29\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT DISTINCT ?b where { yago:Athens geo:hasGeometry ?aGeom . ?aGeom geo:asWKT ?athenswkt . ?b rdf:type y2geoo:OSM_beach ; geo:hasGeometry ?bGeom . ?bGeom geo:asWKT ?wkt . FILTER(geof:sfDistance(?athenswkt, ?wkt) < 100000) }\n","URI: 4\n","30\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT * WHERE { yago:Texas geo:hasGeometry ?geometry . ?geometry geo:asWKT ?wkt . }\n","URI: 5\n","31\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["ASK { yago:Athlone geo:hasGeometry ?aGeom . ?u rdfs:subClassOf yago:University . ?u geo:hasGeometry ?uGeom . ?aGeom geo:asWKT ?aWKT . ?uGeom geo:asWKT ?uWKT . FILTER(strdf:contains(?aWKT, ?uWKT)) }\n","URI: 6\n","32\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["ASK { yago:Norilsk geo:hasGeometry ?northGeom . yago:Dublin geo:hasGeometry ?dublinGeom . ?northGeom geo:asWKT ?norWKT . ?dublinGeom geo:asWKT ?dubWKT . FILTER(strdf:above(?norWKT, ?dubWKT)) }\n","URI: 7\n","33\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT (xsd:decimal (?woodland / ?ukArea * 100) AS ?percentage) WHERE { yago:United_Kingdom geo:hasGeometry ?ukg . ?ugk geo:asWKT ?wktUkg . yago:England geo:hasGeometry ?engg . ?engg geo:asWKT ?wktEngg . yago:Scotland geo:hasGeometry ?scottishg . ?scottishg geo:asWKT ?wktScottish . yago:Wales geo:hasGeometry ?walessg . ?walessg geo:asWKT ?wktWales . yago:Northern_Ireland geo:hasGeometry ?northernirishg . ?northernirishg geo:asWKT ?wktNorthernIrish . yago:UK_territories geo:hasGeometry ?utg . ?utg geo:asWKT ?wktUT . yago:Great_Britain geo:hasGeometry ?gb . ?gb geo:asWKT ?wktGB . yago:England geo:hasGeometry ?e . ?e geo:asWKT ?wkte . yago:Scotland geo:hasGeometry ?s . ?s geo:asWKT ?wtks . yago:Wales geo:hasGeometry ?w . ?w geo:asWKT ?wtw . yago:Northern_Ireland geo:hasGeometry ?ni . ?ni geo:asWKT ?wni . yago:UK_territories geo:hasGeometry ?ut . ?ut geo:asWKT ?wtu . yago:Great_Britain geo:hasGeometry ?gb . ?gb geo:asWKT ?wtkb . yago:England geo:hasGeometry ?e . ?e geo:asWKT ?wkte . yago:Scotland geo:hasGeometry ?s . ?s geo:asWKT ?wts . yago:Wales geo:hasGeometry ?w . ?w geo:asWKT ?wtw . yago:Northern_Ireland geo:hasGeometry ?ni . ?ni geo:asWKT ?wni . yago:UK_territories geo:hasGeometry ?ut . ?ut geo:asWKT ?wtu . yago:Great_Britain geo:hasGeometry ?gb . ?gb geo:asWKT ?wtkb . yago:England geo:hasGeometry ?e . ?e geo:asWKT ?wkte . yago:Scotland geo:hasGeometry ?s . ?s geo:asWKT ?wts . yago:Wales geo:hasGeometry ?w . ?w geo:asWKT ?wtw . yago:Northern_Ireland geo:hasGeometry ?ni . ?ni geo:asWKT ?wni . yago:UK_territories geo:hasGeometry ?ut . ?ut geo:asWKT ?wtu . yago:Great_Britain geo:hasGeometry ?gb . ?gb geo:asWKT ?wtkb . yago:England geo:hasGeometry ?e . ?e geo:asWKT ?wkte . yago\n","Materialize failed: {\"timestamp\":\"2024-09-17T11:22:20.917+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\n","HTTP error (most likely invalid query)\n","34\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT DISTINCT ?bridge ?date WHERE { yago:Ireland geo:hasGeometry ?geometry . ?bridge rdfs:subClassOf yago:Bridge ; geo:hasGeometry ?bridgeGeom . ?bridgeGeom geo:asWKT ?wkt . ?date yago:startDate ?bridge . FILTER (strdf:contains(?wkt, ?geometry)) } ORDER BY DESC(?date) OFFSET 0 LIMIT 2\n","URI: 7\n","35\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT ?city WHERE { yago:County_Kilkenny geo:hasGeometry ?kgeo . ?kgeo geo:asWKT ?kgwkt . ?city rdfs:label \"Kilkenny\"@en ; geo:hasGeometry ?cgeo . ?cgeo geo:asWKT ?cgwkt . FILTER (strdf:contains(?kgwkt, ?cgwkt)) }\n","URI: 7\n","36\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["ASK { yago:England geo:hasGeometry ?geo1 . yago:Greece geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(strdf:westOf(?geoWKT1, ?geoWKT2)) }\n","HTTP error (most likely invalid query)\n","37\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT (count(distinct ?c) AS ?cnt) WHERE { yago:Texas geo:hasGeometry ?gtx . ?gtx geo:asWKT ?wkt . ?c rdf:type y2geoo:OS_County . ?c geo:hasGeometry ?wc . ?wc geo:asWKT ?wkttx . FILTER(strdf:contains(?wkt, ?wkttx)) }\n","URI: 7\n","38\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT ?location WHERE { yago:Lake_Kerkini geo:hasGeometry ?geometry . ?geometry geo:asWKT ?wkt . ?location geo:hasGeometry ?locGeom . ?locGeom geo:asWKT ?locWkt . FILTER(strdf:contains(?wkt, ?locWkt)) }\n","URI: 7\n","39\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT (count(distinct ?borderingVillages) AS ?numOfBorderings) WHERE { ?village rdf:type y2geoo:OSM_village ; geo:hasGeometry ?geometry . ?borderGeom rdf:type y2geoo:OSM_village ; geo:hasGeometry ?borderGeom . ?geometry geo:intersects ?borderGeom . } GROUP BY ?village\n","URI: 7\n","40\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT (count(distinct ?c) AS ?cnt) WHERE { ?c rdfs:subClassOf* y2geoo:OS_County ; geo:hasGeometry ?g . ?g geo:asWKT ?wkt . ?c geo:intersects ?wkt . ?c rdfs:label \"England\"@en . ?c yago:hasLanguage yago:English_language . ?p rdf:type y2geoo:OSM_park ; geo:hasGeometry ?pg . ?pg geo:asWKT ?pwkt . FILTER (strdf:contains(?wkt, ?pwkt)) } GROUP BY ?c\n","URI: 7\n","41\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT (count(distinct ?c) AS ?num) WHERE { ?c rdf:type y2geoo:OSM_city ; geo:hasGeometry ?cg . ?cg geo:asWKT ?cgwkt . ?b rdf:type y2geoo:OSM_bay ; geo:hasGeometry ?bg . ?bg geo:asWKT ?bwkt . FILTER(geof:sfWithin(?cgwkt, ?bwkt)) }\n","URI: 7\n","42\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT DISTINCT ?local WHERE { ?local rdf:type y2geoo:OSM_locality ; geo:hasGeometry ?localGeo . ?localGeo geo:asWKT ?localWKT . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?lakeGeo . ?lakeGeo geo:asWKT ?lakeWKT . FILTER (geof:sfWithinDistance(?localWKT, ?lakeWKT, 500000)) }\n","HTTP error (most likely invalid query)\n","43\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT (count(distinct ?r) AS ?rivers) WHERE { ?r rdf:type y2geoo:OSM_river ; geo:hasGeometry ?g . ?g geo:asWKT ?wkt . ?i rdf:type y2geoo:OSM_island ; geo:hasGeometry ?ig . ?ig geo:asWKT ?iwkt . FILTER(geof:sfWithin(?wkt, ?iwkt)) }\n","URI: 7\n","44\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["ASK { yago:Athens geo:hasGeometry ?aGeom . yago:Chania geo:hasGeometry ?cGeom . ?aGeom geo:asWKT ?aWKT . ?cGeom geo:asWKT ?cWKT . FILTER(strdf:eastOf(?aWKT, ?cWKT)) }\n","URI: 7\n","45\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT (xsd:decimal (?a) as ?area) WHERE { yago:West_Sussex geo:hasGeometry ?g . ?g geo:asWKT ?wk . BIND(strdf:area(?wk) AS ?a)}\n","URI: 8\n","46\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT DISTINCT ?dward WHERE { yago:Plymouth geo:hasGeometry ?poly . ?poly geo:asWKT ?wktPoly . ?dward rdf:type y2geoo:OS_DistrictWard ; geo:hasGeometry ?dwardGeom . ?dwardGeom geo:asWKT ?dwardWkt . FILTER (strdf:intersects(?wktPoly, ?dwardWkt)) . OPTIONAL{ ?dward rdf:type yago:AdministrativeDivisionOfCountry ; geo:hasGeometry ?admGeom . ?admGeom geo:asWKT ?admWkt . FILTER (strdf:intersects(?wktPoly, ?admWkt))} GROUP BY ?dward HAVING (count(distinct ?dward) = 3)}\n","Materialize failed: {\"timestamp\":\"2024-09-17T11:34:35.658+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\n","HTTP error (most likely invalid query)\n","47\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT (strdf:area(?aWKT) AS ?area) WHERE { yago:United_States geo:hasGeometry ?uWKT . ?state rdf:type y2geoo:NBD_State ; geo:hasGeometry ?aWKT . FILTER (strdf:contains(?uWKT, ?aWKT)) . OPTIONAL{ ?state yago:name ?n . BIND(STRDF('\"'+?n+'\"') AS ?label )} . } ORDER BY DESC(?area) LIMIT 1\n","Materialize failed: {\"timestamp\":\"2024-09-17T11:35:33.690+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\n","HTTP error (most likely invalid query)\n","48\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT (count(distinct ?town) AS ?num) WHERE { yago:Norfolk geo:hasGeometry ?norfolkGeom . ?norfolkGeom geo:asWKT ?norfolkWKT . ?town rdf:type y2geoo:OSM_town ; geo:hasGeometry ?townGeom . ?townGeom geo:asWKT ?townWKT . FILTER(strdf:within(?norfolkWKT, ?townWKT)) . FILTER(xsd:greaterThanOrEqual(?population, xsd:int(\"5000\")) AND xsd:lessThanOrEqual(?population, xsd:int(\"10000\"))) } GROUP BY ?town\n","Materialize failed: {\"timestamp\":\"2024-09-17T11:36:29.917+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\n","HTTP error (most likely invalid query)\n","49\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT DISTINCT ?lake WHERE { yago:Athens geo:hasGeometry ?aGeom . ?aGeom geo:asWKT ?aWKT . ?lake rdf:type y2geoo:OSM_lake . ?lake geo:hasGeometry ?lg . ?lg geo:asWKT ?lWKT . yago:Thessaloniki geo:hasGeometry ?thGeom . ?thGeom geo:asWKT ?thWKT . FILTER (strdf:above(?lWKT, ?aWKT) && strdf:below(?lWKT, ?thWKT)) }\n","URI: 8\n","50\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT DISTINCT ?state WHERE { yago:Key_Largo geo:hasGeometry ?keyGeom . ?keyGeom geo:asWKT ?wkt . ?state rdf:type y2geoo:NBD_State . ?state geo:hasGeometry ?statGeom . ?statGeom geo:asWKT ?statWkt . FILTER (strdf:contains(?wkt, ?statWkt)) }\n","URI: 8\n","51\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT DISTINCT ?bay WHERE { yago:Greece geo:hasGeometry ?greekGeo . ?greekGeo geo:asWKT ?wktGreek . ?bay rdf:type y2geoo:OSM_bay . ?bay geo:hasGeometry ?bayGeo . ?bayGeo geo:asWKT ?wktBay . ?reservoir rdf:type y2geoo:OSM_reservoir . ?reservoir geo:hasGeometry ?reservoirGeo . ?reservoirGeo geo:asWKT ?wktReservoir . FILTER (strdf:eastOf(?wktBay, ?wktReservoir)) FILTER (strdf:westOf(?wktBay, ?wktGreek)) }\n","HTTP error (most likely invalid query)\n","52\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT (?region AS ?name) (?population AS ?pop) WHERE { yago:Greece geo:hasGeometry ?greekGeom . ?greekGeom geo:asWKT ?wkt . ?region rdfs:subClassOf y2geoo:GAG_Region ; geo:hasGeometry ?regGeom . ?regGeom geo:asWKT ?rWKT . FILTER(strdf:contains(?wkt, ?rWKT)) . ?region yago:'hasPopulation ?population . } GROUP BY ?region , ?population ORDER BY DESC(?population) LIMIT 1\n","Materialize failed: {\"timestamp\":\"2024-09-17T11:41:11.775+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\n","HTTP error (most likely invalid query)\n","53\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["ASK { yago:Norilsk geo:hasGeometry ?geo1 . yago:Dublin geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(strdf:above(?geoWKT1, ?geoWKT2)) }\n","URI: 9\n","54\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["ASK { yago:Sennen_Cove geo:hasGeometry ?geo1 . yago:Helston geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(strdf:eastOf(?geoWKT1, ?geoWKT2)) }\n","HTTP error (most likely invalid query)\n","55\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT DISTINCT ?forest WHERE { yago:Illinois geo:hasGeometry ?i1 . ?i1 geo:asWKT ?geoWKT1 . ?forest rdf:type y2geoo:OSM_forest . ?forest geo:hasGeometry ?f1 . ?f1 geo:asWKT ?geoWKT2 . ?village rdf:type y2geoo:OSM_village . ?village geo:hasGeometry ?v1 . ?v1 geo:asWKT ?geoWKT3 . FILTER (strdf:intersects(?geoWKT1, ?geoWKT2) && strdf:intersects(?geoWKT1, ?geoWKT3)) }\n","URI: 9\n","56\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT (xsd:integer (?population) as ?pop) WHERE { yago:Gravia yago:'hasPopulation ?population. }\n","Materialize failed: {\"timestamp\":\"2024-09-17T11:45:02.651+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\n","HTTP error (most likely invalid query)\n","57\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT (count(distinct ?state) AS ?states) WHERE { yago:United_States geo:hasGeometry ?usaGeom . ?hotel rdf:type y2geoo:NBD_Hotel ; geo:hasGeometry ?hotelGeom . ?state rdf:type y2geoo:NBD_State ; geo:hasGeometry ?stateGeom . FILTER(geof:sfWithin(?hotelGeom, ?usaGeom)) . FILTER(geof:sfWithin(?stateGeom, ?usaGeom)) . } GROUP BY ?state\n","URI: 9\n","58\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT (count(distinct ?bay) AS ?nbay) WHERE { ?bay rdf:type y2geoo:OSM_bay ; geo:hasGeometry ?bayGeom . ?bayGeom geo:asWKT ?bayWKT . ?village rdf:type y2geoo:OSM_village ; geo:hasGeometry ?villageGeom . ?villageGeom geo:asWKT ?villageWKT . FILTER(geof:sfWithin(?bayWKT, ?villageWKT)) }\n","URI: 9\n","59\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT DISTINCT ?park WHERE { yago:Liverpool geo:hasGeometry ?geo1 . ?geo1 geo:asWKT ?wkt1 . ?park rdf:type y2geoo:OSM_park . ?park geo:hasGeometry ?geo2 . ?geo2 geo:asWKT ?wkt2 . FILTER (strdf:within(?wkt1, ?wkt2)) }\n","URI: 9\n","60\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT DISTINCT ?barony ?lake WHERE { ?barony rdf:type y2geoo:OSI_Barony ; geo:hasGeometry ?bGeom . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?lGeom . FILTER(geof:sfWithin(?bGeom, ?lGeom)) }\n","URI: 9\n","61\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT * WHERE { yago:Southampton_F.C._stadium geo:hasGeometry ?g . ?g geo:asWKT ?wkt . }\n","URI: 9\n","62\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT ?church WHERE { yago:New_York_City geo:hasGeometry ?nycGeom . ?church rdf:type y2geoo:OSM_building ; geo:hasGeometry ?churchGeom . ?churchGeom geo:asWKT ?wktChurch . ?nycGeom geo:asWKT ?wktNYC . FILTER(strdf:contains(?wktChurch, ?wktNYC)) . FILTER(strdf:intersectionType(?wktChurch, ?wktNYC) = \"Polygon\") . FILTER(strdf:interiorPointInside(?wktChurch, ?wktNYC)) . FILTER(strdf:inside(?wktChurch, ?wktNYC)) . FILTER(strdf:overlapArea(?wktChurch, ?wktNYC) > 0 ) . FILTER(strdf:intersectionType(?wktChurch, ?wktNYC) != \"Empty\" ) . FILTER(strdf:intersectionType(?wktChurch, ?wktNYC) != \"Null\" ) . FILTER(strdf:intersectionType(?wktChurch, ?wktNYC) != \"LineString\" ) . FILTER(strdf:intersectionType(?wktChurch, ?wktNYC) != \"MultiPolygon\" ) . FILTER(strdf:intersectionType(?wktChurch, ?wktNYC) != \"MultiLineString\" ) . FILTER(strdf:intersectionType(?wktChurch, ?wktNYC) != \"Point\" ) . FILTER(strdf:intersectionType(?wktChurch, ?wktNYC) != \"CurvePolygon\" ) . FILTER(strdf:intersectionType(?wktChurch, ?wktNYC) != \"Circle\" ) . FILTER(strdf:intersectionType(?wktChurch, ?wktNYC) != \"CompoundCurve\" ) . FILTER(strdf:intersectionType(?wktChurch, ?wktNYC) != \"CompositeCurve\" ) . FILTER(strdf:intersectionType(?wktChurch, ?wktNYC) != \"LinearRing\" ) . FILTER(strdf:intersectionType(?wktChurch, ?wktNYC) != \"PolygonalRing\" ) . FILTER(strdf:intersectionType(?wktChurch, ?wktNYC) != \"Triangle\" ) . FILTER(strdf:intersectionType(?wktChurch, ?wktNYC) != \"Quadrilateral\" ) . FILTER(strdf:intersectionType(?wktChurch, ?wktNYC) != \"Hexagon\" ) . FILTER(strdf:intersectionType(?wktChurch, ?wktNYC) != \"Octagon\" ) . FILTER(strdf:intersectionType(?wktChurch, ?wktNYC) != \"Non-Regular Polygon\" ) . FILTER(strdf:intersectionType(?wktChurch, ?wktNYC) != \"Star\" ) . FILTER(strdf:intersectionType(?wktChurch, ?wktNYC) != \"Ellipse\" )\n","Materialize failed: {\"timestamp\":\"2024-09-17T11:50:26.819+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\n","HTTP error (most likely invalid query)\n","63\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT (strdf:length(?aWKT) AS ?len) WHERE { yago:Loch_Awe geo:hasGeometry ?aGeo . ?aGeo geo:asWKT ?aWKT . }\n","URI: 9\n","64\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["ASK { yago:Plymouth geo:hasGeometry ?geo1 . yago:Cardiff geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(strdf:nearby(?geoWKT1, ?geoWKT2)) }\n","HTTP error (most likely invalid query)\n","65\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["ASK { yago:Belfast geo:hasGeometry ?bGeom . yago:London geo:hasGeometry ?lGeom . ?bGeom geo:asWKT ?bWKT . ?lGeom geo:asWKT ?lWKT . FILTER(strdf:westOf(?bWKT, ?lWKT)) }\n","URI: 10\n","66\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["ASK { yago:Scotland geo:hasGeometry ?geo1 . yago:Sfakia geo:hasGeometry ?geo2 . ?geo1 geo:asWKT ?geoWKT1 . ?geo2 geo:asWKT ?geoWKT2 . FILTER(strdf:contains(?geoWKT1, ?geoWKT2)) }\n","URI: 11\n","67\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT ?lat ?lon WHERE { yago:New_York_City geo:hasGeometry ?geometry . ?geometry geo:asWKT ?wkt . BIND(STRDF:X(?wkt) AS ?lat) . BIND(STRDF:Y(?wkt) AS ?lon) }\n","Materialize failed: {\"timestamp\":\"2024-09-17T11:55:07.680+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\n","HTTP error (most likely invalid query)\n","68\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT ?c1 ?c2 (strdf:area(?c1wkt) AS ?a1) (strdf:area(?c2wkt) AS ?a2) WHERE { ?c1 rdf:type y2geoo:OS_County ; geo:hasGeometry ?c1wkt . ?c2 rdf:type y2geoo:OS_County ; geo:hasGeometry ?c2wkt . OPTIONAL{ ?c1 wdt:P407 ?c1pop . ?c2 wdt:P407 ?c2pop . } GROUP BY ?c1 ?c2 HAVING MIN(?a1) = MIN(?a2) AND MAX(?a1) = MAX(?a2) }\n","Materialize failed: {\"timestamp\":\"2024-09-17T11:56:04.353+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\n","HTTP error (most likely invalid query)\n","69\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT DISTINCT ?county ?population WHERE { yago:Kansas geo:hasGeometry ?kansaGeom . ?kansaGeom geo:asWKT ?kansaWKT . ?county rdf:type y2geoo:OS_County . ?county geo:hasGeometry ?countyGeom . ?countyGeom geo:asWKT ?countyWKT . FILTER (strdf:contains(?kansaWKT, ?countyWKT)) OPTIONAL{ ?county yago:'hasPopulation ?population . }} GROUP BY ?county HAVING MIN(?population)\n","Materialize failed: {\"timestamp\":\"2024-09-17T11:57:00.337+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\n","HTTP error (most likely invalid query)\n","70\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT ?gag WHERE { yago:Greece geo:hasGeometry ?geo . ?geo geo:asWKT ?wkt . ?gag rdf:type y2geoo:GAG_Municipality ; geo:hasGeometry ?gagGeo . ?gagGeo geo:asWKT ?gagWkt . FILTER (strdf:contains(?wkt, ?gagWkt)) . FILTER (xsd:integer(?population) < xsd:integer(\"30000\"))} GROUP BY ?gag\n","URI: 11\n","71\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT (MAX(?pop) AS ?maxpop) WHERE { yago:Missouri geo:hasGeometry ?missouriGeom . ?missouriGeom geo:asWKT ?wktMissouri . ?city rdf:type yago:Missouri_City,_Missouri ; y2geoo:OSM_city ; yago:hasPopulation ?pop . ?city geo:hasGeometry ?cityGeom . ?cityGeom geo:asWKT ?wktCity . FILTER(strdf:contains(?wktMissouri, ?wktCity)) }\n","Materialize failed: {\"timestamp\":\"2024-09-17T11:58:53.114+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\n","HTTP error (most likely invalid query)\n","72\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT (xsd:integer (?population) as ?pop) WHERE { yago:Dublin yago:'hasPopulation ?population. }\n","Materialize failed: {\"timestamp\":\"2024-09-17T11:59:44.305+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\n","HTTP error (most likely invalid query)\n","73\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["ASK { yago:Oxfordshire geo:hasGeometry ?oxf . yago:Kent geo:hasGeometry ?knt . ?oxf geo:asWKT ?oxfwkt . ?knt geo:asWKT ?kntwkt . FILTER(strdf:distance(?oxfwkt, ?kntwkt)>100000)}\n","HTTP error (most likely invalid query)\n","74\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT (?cname AS ?mostPopulatedCityName), (?cpop AS ?mostPopulatedCityPopulation) WHERE { yago:Missouri y2geoo:nbd:stateOf ?osmState . ?osmState y2geoo:nbd:contains ?osmCounties . ?osmCounties y2geoo:nbd:countyOf ?osmCities . ?osmCities y2geoo:nbd:cityOf ?osmNeighborhoods . ?osmNeighborhoods y2geoo:nbd:neighborhoodOf ?osmBlocks . ?osmBlocks y2geoo:nbd:blockOf ?osmBuildings . ?osmBuildings y2geoo:nbd:buildingOf ?osmStreets . ?osmStreets y2geoo:nbd:streetOf ?osmAddresses . ?osmAddresses y2geoo:nbd:addressOf ?osmPeople . ?osmPeople y2geoo:nbd:personOf ?osmFamilies . ?osmFamilies y2geoo:nbd:familyOf ?osmHouseholds . ?osmHouseholds y2geoo:nbd:householdOf ?osmPersons . ?osmPersons y2geoo:nbd:personOf ?osmResidents . ?osmResidents y2geoo:nbd:residentOf ?osmZipCodes . ?osmZipCodes y2geoo:nbd:zipCodeOf ?osmPostOffices . ?osmPostOffices y2geoo:nbd:postOfficeOf ?osmAreas . ?osmAreas y2geoo:nbd:areaOf ?osmPlaces . ?osmPlaces y2geoo:nbd:placeOf ?osmLocations . ?osmLocations y2geoo:nbd:locationOf ?osmLandmarks . ?osmLandmarks y2geoo:nbd:landmarkOf ?osmFeatures . ?osmFeatures y2geoo:nbd:featureOf ?osmRegions . ?osmRegions y2geoo:nbd:regionOf ?osmStates . ?osmStates y2geoo:nbd:stateOf ?osmCountry . ?osmCountry y2geoo:nbd:countryOf ?osmContinent . ?osmContinent y2geoo:nbd:continentOf ?osmWorld . ?osmWorld y2geoo:nbd:worldOf ?osmGeography . ?osmGeography y2geoo:nbd:geographyOf ?osmEarth . ?osmEarth y2geoo:nbd:earthOf ?osmSolarSystem . ?osmSolarSystem y2geoo:nbd:solarSystemOf ?osmPlanetarySystem . ?osmPlanetarySystem y2geoo:nbd:planetarySystemOf ?osmStar . ?osmStar y2geoo:nbd:starOf ?osmMilkyWay . ?osmMilkyWay y2geoo:nbd:milkyWayOf ?osmUniverse . ?osmUniverse y2geoo:nbd:universeOf ?osmSpace . ?osmSpace y2geoo:nbd:spaceOf ?osmTime . ?osmTime y2geoo:nbd:timeOf ?osmMultiverse . ?osmMultiverse y2geoo:nbd:multiverse\n","Materialize failed: {\"timestamp\":\"2024-09-17T12:02:06.172+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\n","HTTP error (most likely invalid query)\n","75\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT * WHERE { yago:Ullswater geo:hasGeometry ?g . ?g geo:asWKT ?wkt . }\n","URI: 12\n","76\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT DISTINCT ?gag (xsd:integer (?population) AS ?pop) WHERE { ?gag rdf:type y2geoo:GAG_Municipality ; yago:hasPopulation ?population . } GROUP BY ?gag HAVING (?pop < 5000) ORDER BY DESC (?pop) LIMIT 3\n","Materialize failed: {\"timestamp\":\"2024-09-17T12:03:57.891+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\n","HTTP error (most likely invalid query)\n","77\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT * WHERE { yago:Drogheda geo:hasGeometry ?dgeo . ?dgeo geo:asWKT ?dWKT . }\n","URI: 13\n","78\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT (count(distinct ?b) AS ?nb) WHERE { yago:Greece geo:hasGeometry ?greekGeom . ?greekGeom geo:asWKT ?greekWKT . ?i rdf:type y2geoo:OSM_island ; geo:hasGeometry ?islandGeom . ?islandGeom geo:asWKT ?islandWKT . ?b rdf:type y2geoo:OSM_beach ; geo:hasGeometry ?beachGeom . ?beachGeom geo:asWKT ?beachWKT . FILTER(strdf:contains(?greekWKT, ?islandWKT)) . FILTER(strdf:intersects(?islandWKT, ?beachWKT)) } GROUP BY ?i HAVING (?nb > 0) ORDER BY DESC(?nb) LIMIT 1\n","URI: 13\n","79\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT (count(distinct ?c) AS ?n) WHERE { yago:Alabama geo:hasGeometry ?aGeom . ?aGeom geo:asWKT ?wktA . ?c rdf:type y2geoo:OSM_stream ; geo:hasGeometry ?cGeom . ?cGeom geo:asWKT ?wktC . FILTER(strdf:contains(?wktA, ?wktC)) }\n","URI: 14\n","80\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["ASK { yago:Dublin geo:hasGeometry ?dublinGeom . yago:Howth geo:hasGeometry ?howthGeom . ?dublinGeom geo:asWKT ?dublinWKT . ?howthGeom geo:asWKT ?howthWKT . FILTER(strdf:distance(?dublinWKT, ?howthWKT) < 5000)}\n","HTTP error (most likely invalid query)\n","81\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT DISTINCT ?nr WHERE { yago:Ireland geo:hasGeometry ?iGeom . ?iGeom geo:asWKT ?iWKT . ?nr rdf:type y2geoo:OSM_nature_reserve ; geo:hasGeometry ?nrGeom . ?nrGeom geo:asWKT ?nrWKT . FILTER (strdf:contains(?iWKT, ?nrWKT)) . OPTIONAL{ ?nr y2geoo:hasLake ?l . ?l rdf:type y2geoo:OSM_lake . ?l geo:hasGeometry ?lGeom . ?lGeom geo:asWKT ?lWKT . FILTER (strdf:contains(?nrWKT, ?lWKT))} }\n","URI: 14\n","82\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["ASK { yago:Leicester geo:hasGeometry ?leicGeom . yago:Birmingham geo:hasGeometry ?birmGeom . ?leicGeom geo:asWKT ?leicWKT . ?birmGeom geo:asWKT ?birmWKT . FILTER(strdf:eastOf(?leicWKT, ?birmWKT)) }\n","URI: 15\n","83\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT DISTINCT ?park WHERE { yago:United_States geo:hasGeometry ?usaGeom . ?usaGeom geo:asWKT ?usaWKT . ?state rdf:type y2geoo:NBD_State ; geo:hasGeometry ?stateGeom . ?stateGeom geo:asWKT ?stateWKT . ?county rdf:type yago:Forest_County,_Wisconsin ; geo:hasGeometry ?countyGeom . ?countyGeom geo:asWKT ?countyWKT . ?park rdf:type y2geoo:OSM_park ; geo:hasGeometry ?parkGeom . ?parkGeom geo:asWKT ?parkWKT . FILTER (strdf:contains(?usaWKT, ?stateWKT) && strdf:contains(?stateWKT, ?countyWKT) && strdf:within(?parkWKT, ?countyWKT)) }\n","Materialize failed: {\"timestamp\":\"2024-09-17T12:10:12.400+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\n","HTTP error (most likely invalid query)\n","84\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT DISTINCT ?district WHERE { yago:Cambridge geo:hasGeometry ?cambridgeGeom . ?cambridgeGeom geo:asWKT ?wktCambridge . ?district rdf:type y2geoo:OS_District ; geo:hasGeometry ?districtGeom . ?districtGeom geo:asWKT ?wktDistrict . ?forest rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?forestGeom . ?forestGeom geo:asWKT ?wktForest . FILTER(strdf:intersects(?wktDistrict, ?wktCambridge)) FILTER(strdf:contains(?wktForest, ?wktDistrict)) }\n","URI: 15\n","85\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT * WHERE { yago:Luton geo:hasGeometry ?g . ?g geo:asWKT ?wkt . }\n","URI: 16\n","86\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT (count(distinct ?d) AS ?numVillages) WHERE { yago:England geo:hasGeometry ?eGeom . ?eGeom geo:asWKT ?engWKT . ?d rdf:type y2geoo:OS_District ; geo:hasGeometry ?dGeom . ?dGeom geo:asWKT ?dWKT . ?v rdf:type y2geoo:OSM_village ; geo:hasGeometry ?vGeom . ?vGeom geo:asWKT ?vWKT . FILTER(strdf:within(?dWKT, ?engWKT)) . FILTER(strdf:contains(?vWKT, ?dWKT)) } GROUP BY ?d HAVING (count(distinct ?d) > count(distinct ?d2)) ORDER BY DESC(?numVillages) LIMIT 1\n","URI: 16\n","87\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT SUM(?population) AS ?total WHERE { yago:Manchester yago:'hasPopulation ?population. yago:London yago:'hasPopulation ?population. yago:Liverpool yago:'hasPopulation ?population. yago:Birmingham yago:'hasPopulation ?population. yago:Glasgow yago:'hasPopulation ?population. yago:United_Kingdom geo:hasGeometry ?ukGeom . ?ukGeom geo:asWKT ?wktUk . ?manchester rdf:type y2geoo:OSM_city ; geo:hasGeometry ?manchesterGeom . ?manchesterGeom geo:asWKT ?wktMan . ?glasgow rdf:type y2geoo:OSM_city ; geo:hasGeometry ?glasgowGeom . ?glasgowGeom geo:asWKT ?wktGlas . ?liverpool rdf:type y2geoo:OSM_city ; geo:hasGeometry ?liverpoolGeom . ?liverpoolGeom geo:asWKT ?wktLiv . ?birmingham rdf:type y2geoo:OSM_city ; geo:hasGeometry ?birminghamGeom . ?birminghamGeom geo:asWKT ?wktBin . FILTER(geof:sfWithin(?wktUk, ?wktMan) || geof:sfWithin(?wktUk, ?wktGlas) || geof:sfWithin(?wktUk, ?wktLiv) || geof:sfWithin(?wktUk, ?wktBin)) }\n","Materialize failed: {\"timestamp\":\"2024-09-17T12:14:03.191+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\n","HTTP error (most likely invalid query)\n","88\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT ?c (count(distinct ?l) AS ?num) WHERE { yago:England geo:hasGeometry ?eGeom . ?eGeom geo:asWKT ?engWKT . ?c rdf:type y2geoo:OSM_city ; geo:hasGeometry ?cGeom . ?cGeom geo:asWKT ?cWKT . ?l rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?lGeom . ?lGeom geo:asWKT ?lWKT . FILTER(geof:sfWithin(?cWKT, ?engWKT)) . FILTER(geof:sfIntersects(?cWKT, ?lWKT)) } GROUP BY ?c ORDER BY DESC(?num) LIMIT 1\n","URI: 16\n","89\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT * WHERE { yago:Chichester geo:hasGeometry ?cgeo . ?cgeo geo:asWKT ?cgwkt . }\n","URI: 17\n","90\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["ASK { yago:Belfast geo:hasGeometry ?bGeom . yago:Dublin geo:hasGeometry ?dGeom . ?bGeom geo:asWKT ?bWKT . ?dGeom geo:asWKT ?dWKT . FILTER(strdf:above(?bWKT, ?dWKT)) }\n","URI: 17\n","91\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT (strdf:area(?gwkt) AS ?a) , ?name WHERE { ?n rdfs:label \"Phoenix Park\"@en ; rdf:type y2geoo:OSM_park . ?n geo:hasGeometry ?gwkt . ?c rdfs:label \"Dublin\"@en ; yago:capitalOf ?country . ?c geo:hasGeometry ?cgwkt . FILTER(strdf:contains(?cgwkt, ?gwkt)) OPTIONAL{ ?c geo:hasGeometry ?cgwkt .} BIND(\"http://dbpedia.org/resource/\"~STRDF:SUBSTRING(STR(?n), STRPOS(STR(?n), \"#\")+1, LENGTH(?n)))AS ?id . ?n rdfs:label ?name . }ORDER BY DESC(?a)LIMIT 1\n","Materialize failed: {\"timestamp\":\"2024-09-17T12:17:47.392+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\n","HTTP error (most likely invalid query)\n","92\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT DISTINCT ?district WHERE { yago:Staffordshire_County geo:hasGeometry ?countyGeom . ?countyGeom geo:asWKT ?wktCounty . yago:Stafford_District geo:hasGeometry ?staffordGeom . ?staffordGeom geo:asWKT ?wktStafford . ?district rdf:type y2geoo:OS_District . ?district geo:hasGeometry ?distGeom . ?distGeom geo:asWKT ?wktDist . FILTER (strdf:touches(?wktCounty, ?wktDist) || strdf:contains(?wktCounty, ?wktDist)) }\n","URI: 17\n","93\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT DISTINCT ?lake WHERE { yago:Central_Macedonia geo:hasGeometry ?cmGeom . ?cmGeom geo:asWKT ?cmWKT . ?lake rdf:type y2geoo:OSM_lake . ?lake geo:hasGeometry ?lgGeom . ?lgGeom geo:asWKT ?lgWKT . FILTER (strdf:contains(?cmWKT, ?lgWKT)) }\n","URI: 18\n","94\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT DISTINCT ?gag WHERE { yago:Greece geo:hasGeometry ?geo . ?geo geo:asWKT ?wkt . ?gag rdf:type y2geoo:GAG_Municipality . ?gag geo:hasGeometry ?gagGeo . ?gagGeo geo:asWKT ?gagWkt . FILTER (strdf:contains(?wkt, ?gagWkt)) } ORDER BY ASC(?gagWkt) LIMIT 1\n","URI: 18\n","95\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT (MAX(?a) AS ?maxArea) WHERE { yago:Thessaloniki geo:hasGeometry ?thessGeom . ?thessGeom geo:asWKT ?thessWKT . ?gagMun rdf:type y2geoo:GAG_Municipality . ?gagMun geo:hasGeometry ?munGeom . ?munGeom geo:asWKT ?munWKT . FILTER(strdf:touches(?thessWKT, ?munWKT)) . ?gagMun yago:'hasArea ?a . }\n","Materialize failed: {\"timestamp\":\"2024-09-17T12:21:32.301+00:00\",\"status\":500,\"error\":\"Internal Server Error\",\"path\":\"/materialize-api\"}\n","HTTP error (most likely invalid query)\n","96\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT DISTINCT ?gag WHERE { yago:Greece geo:hasGeometry ?geo1 . ?geo1 geo:asWKT ?wkt1 . ?gag rdf:type y2geoo:GAG_Municipality . ?gag geo:hasGeometry ?geo2 . ?geo2 geo:asWKT ?wkt2 . FILTER (strdf:contains(?wkt1, ?wkt2)) }\n","URI: 18\n","97\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT DISTINCT ?barony ?forest WHERE { ?barony rdf:type y2geoo:OSI_Barony ; geo:hasGeometry ?bgeo . ?bgeo geo:asWKT ?bgwkt . ?forest rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?fgeo . ?fgeo geo:asWKT ?fgwkt . FILTER (strdf:within(?fgwkt, ?bgwkt)) }\n","URI: 18\n","98\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT * WHERE { yago:Birmingham geo:hasGeometry ?bhamGeom . ?bhamGeom geo:asWKT ?wkt . }\n","URI: 19\n","99\n"]},{"name":"stderr","output_type":"stream","text":["Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.\n"]},{"name":"stdout","output_type":"stream","text":["SELECT (count(distinct ?c) AS ?num) WHERE { yago:Merseyside geo:hasGeometry ?merseyGeom . ?merseyGeom geo:asWKT ?merseyWKT . ?c rdf:type y2geoo:OSM_city . ?c geo:hasGeometry ?cGeom . ?cGeom geo:asWKT ?cWKT . FILTER (strdf:within(?merseyWKT, ?cWKT)) }\n","URI: 20\n"]},{"ename":"NameError","evalue":"name 'detailed_comp' is not defined","output_type":"error","traceback":["\u001b[0;31m---------------------------------------------------------------------------\u001b[0m","\u001b[0;31mNameError\u001b[0m                                 Traceback (most recent call last)","Cell \u001b[0;32mIn[24], line 47\u001b[0m\n\u001b[1;32m     39\u001b[0m         \u001b[38;5;28mprint\u001b[39m(\u001b[38;5;124mf\u001b[39m\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mURI: \u001b[39m\u001b[38;5;132;01m{\u001b[39;00mdetailed_comp1\u001b[38;5;132;01m}\u001b[39;00m\u001b[38;5;124m\"\u001b[39m)\n\u001b[1;32m     41\u001b[0m \u001b[38;5;66;03m#     if gen_result2 and gt_result:\u001b[39;00m\n\u001b[1;32m     42\u001b[0m \u001b[38;5;66;03m#         comparisson = compare_csv_columns(gt_result, gen_result2)\u001b[39;00m\n\u001b[1;32m     43\u001b[0m \u001b[38;5;66;03m#         if comparisson == True:  \u001b[39;00m\n\u001b[1;32m     44\u001b[0m \u001b[38;5;66;03m#             detailed_comp2 += 1\u001b[39;00m\n\u001b[1;32m     45\u001b[0m \u001b[38;5;66;03m#         print(f\"PLAIN: {detailed_comp2}\")\u001b[39;00m\n\u001b[0;32m---> 47\u001b[0m \u001b[38;5;28mprint\u001b[39m (\u001b[43mdetailed_comp\u001b[49m\u001b[38;5;241m/\u001b[39m\u001b[38;5;241m100\u001b[39m)\n","\u001b[0;31mNameError\u001b[0m: name 'detailed_comp' is not defined"]}],"source":["import json, requests\n","\n","with open('/kaggle/input/aurii-concepts-instances-dataset/concepts_instances_dataset.json', 'r') as file:\n","    original_dataset = json.load(file)\n","    \n","detailed_comp1 = 0\n","\n","detailed_comp2 = 0\n","\n","gt_results = []\n","gen_results = []\n","\n","i = 0\n","for key in original_dataset:\n","    print(i)\n","    i+=1\n","#     if i < 99:\n","#         continue\n","    query = original_dataset[key]['Query']\n","    # Normalize the query\n","#     query = normalize_variables(query)\n","    gt_result = graphdb_send_request(query)\n","    gt_results.append(gt_result)\n","    \n","    question = original_dataset[key]['Question']\n","    \n","    uris = original_dataset[key]['Gen_URI']\n","    gen_query1 = generate_URI_injected_query(model, tokenizer, question, None, uris)\n","#     gen_query2 = generate_query(model, tokenizer, question)\n","    # Normalize the query\n","    gen_result1 = graphdb_send_request(gen_query1)\n","#     gen_result2 = graphdb_send_request(gen_query2)\n","    gen_results.append(gen_result1)\n","    \n","    if gen_result1 and gt_result:\n","        comparisson = compare_csv_columns(gt_result, gen_result1)\n","        if comparisson == True:  \n","            detailed_comp1 += 1\n","        print(f\"URI: {detailed_comp1}\")\n","        \n","#     if gen_result2 and gt_result:\n","#         comparisson = compare_csv_columns(gt_result, gen_result2)\n","#         if comparisson == True:  \n","#             detailed_comp2 += 1\n","#         print(f\"PLAIN: {detailed_comp2}\")\n","        \n","print (detailed_comp/100)"]},{"cell_type":"code","execution_count":null,"metadata":{"execution":{"iopub.status.busy":"2024-09-17T12:25:18.074010Z","iopub.status.idle":"2024-09-17T12:25:18.074339Z","shell.execute_reply":"2024-09-17T12:25:18.074196Z","shell.execute_reply.started":"2024-09-17T12:25:18.074182Z"},"trusted":true},"outputs":[],"source":["# def write_list_to_file(filename, data_list):\n","with open(filename, 'w') as file:\n","    for item in data_list:\n","        file.write(f\"{item}\\n\")\n","\n","# Write lists to files\n","write_list_to_file('gen.txt', gen_results)\n","write_list_to_file('gt.txt', gt_results)"]}],"metadata":{"kaggle":{"accelerator":"gpu","dataSources":[{"datasetId":5299649,"sourceId":8812575,"sourceType":"datasetVersion"},{"datasetId":5623080,"sourceId":9288757,"sourceType":"datasetVersion"},{"datasetId":5651610,"sourceId":9328230,"sourceType":"datasetVersion"},{"datasetId":5651612,"sourceId":9328232,"sourceType":"datasetVersion"}],"dockerImageVersionId":30733,"isGpuEnabled":true,"isInternetEnabled":true,"language":"python","sourceType":"notebook"},"kernelspec":{"display_name":"Python 3","language":"python","name":"python3"},"language_info":{"codemirror_mode":{"name":"ipython","version":3},"file_extension":".py","mimetype":"text/x-python","name":"python","nbconvert_exporter":"python","pygments_lexer":"ipython3","version":"3.10.13"}},"nbformat":4,"nbformat_minor":4}
